{
    "name": "Fungus Queen",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any underground<br/><b>Organization</b> solitary or cult (fungus queen plus 2–12 controlled plants and minions)<br/><b>Treasure</b> double"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Compel Plants (Su)</b> A fungus queen’s mind-affecting powers and spell-like abilities (and spells, should the fungus queen gain the ability to cast them) affect plant creatures (but not mindless plant creatures) as if they weren’t immune to mind-affecting effects. <br/><b>Create Spawn (Su)</b> A creature that would normally be slain by a fungus queen’s energy drain attack is not killed—instead, it immediately loses all negative levels imparted by the fungus queen and transforms into a fungus-infested minion in her service. Most creatures gain the fungoid simple template (see page 131), but vermin slain by a fungus queen instead rise as spore zombies (see page 287). Fungoid creatures and spore zombies are under the control of the fungus queen that created them, and remain enslaved until that fungus queen is destroyed or until they are cured of the infestation. A fungus queen can communicate telepathically with her fungoid spawn at any range as long as they are on the same plane. She can control a number of Hit Dice worth of enslaved spawn totaling no more than double her own Hit Dice. Any spawn she creates that would exceed this limit become free-willed fungoid creatures or spore zombies. A fungus queen can free an enslaved spawn in order to enslave a new spawn, but once freed, a creature cannot be enslaved again (although fungoid creatures can still be influenced by the fungus queen’s compel plants and plant empathy abilities). <br/><b>Energy Drain (Su)</b> A fungus queen drains energy from a mortal she lures into an act of passion, such as a kiss. An unwilling victim must be grappled before she can use this ability. The fungus queen’s embrace bestows one negative level and has the effect of a <i>suggestion</i> spell, asking the victim to accept another act of passion from the fungus queen. The victim must succeed on a DC 23 Will save to negate the suggestion. The DC is 23 for the Fortitude save to remove a negative level. Creatures killed by this attack do not die—they instead become infested with the fungus queen’s spores (see Create Spawn above). The save DCs are Charisma-based. <br/><b>Plant Empathy (Ex)</b> This ability functions as the druid’s wild empathy ability, save that a fungus queen can use this ability only on plant creatures. A fungus queen gains a +4 racial bonus on this check. Mindless plant creatures are imparted with a modicum of implanted intelligence when a fungus queen uses this ability, allowing her to train them as guardians. <br/><b>Sporepod (Su)</b> As a standard action, a fungus queen can cause a Medium pod of fungal material to burst out of the ground at any point within 60 feet of her current location. Once created, a sporepod cannot move. If the fungus queen travels more than 120 feet from a sporepod, it is destroyed. A fungus queen can maintain a number of sporepods equal to her Charisma modifier (7 for the typical fungus queen). As a move action, she can instantaneously travel to one of her sporepods as if using transport via plants. She can also choose to spread out her tentacle attacks among her sporepods, attacking a creature within 5 feet of any sporepod with a tentacle, though she is still limited to making only four tentacle attacks as part of a full attack, and only one as a standard action. A sporepod is an object with an AC of 15 and 20 hit points; damage dealt to a sporepod does not harm the fungus queen."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Hundreds of years ago, a cabal of powerful succubus assassins attempted to invade the Abyssal realm of the demon lord of disease and fungus. These succubi sought to slay a powerful witch who had befouled a profane temple the assassins served. The succubi failed at their mission, and from their corpses grew the first fungus queens. Pleased with this development, the witch seeded numerous Material Plane worlds with fungus queen spores, and these new fungus queens have taken to these new environments like rot to a carcass; today, hundreds of the subversive creatures dwell in the fouler reaches of the Material Plane. They are particularly fond of large cave systems and the slums of ruined cities. Fungus queens also often dwell in areas of corrupted woodlands where blighted fey rule, or in the sewers of active cities with an unusually large amount of magical pollution. <br/><br/>An encounter with a normally unintelligent plant monster acting in a sinister and organized way can be evidence of the manipulation of a fungus queen, but fungus queens are equally fond of commanding and keeping other creatures as pets and slaves—particularly attractive humanoids. Especially favored minions are given the gift of the fungus queen’s embrace and are transformed into fungoid minions forever loyal to their pallid mistress. Yet a fungus queen knows that a diverse array of guardians is best, and is certain to keep some non-plant minions on hand to protect her lair. <br/><br/>Fungus queens are violently jealous and possessive. Those who attempt to lure away their charmed and dominated pets or cure those who have been infested elicit their eternal ire, but it is succubi that most enrage fungus queens. Whether this is due to a simple territorial conflict or some deeper hatred born of their unique genesis, a fungus queen faced with someone whom she even suspects might be a succubus is a terror indeed, for in such battles the plants abandon their normal approach of subtle mental control and trickery, instead bringing all of their power to bear in an attempt to rip the offending creature apart. Fungus queens also take great and specific delight in transforming succubi into fungoid creatures under their control. <br/><br/>While their jealousy doesn’t compel them to do battle with other fungus queens, they are always careful to maintain their own territories apart from any nearby queens, and they take great pains not to “poach” from their sisters’ harems of charmed and infested pets. <br/><br/>Many fungus queens grow quite powerful over time, typically gaining class levels in bard, ranger, or sorcerer— they generally do not become more powerful by merely gaining racial Hit Dice or increasing in size. Fungus queen druids are remarkably rare. <br/><br/>A fungus queen is 6 feet tall and weighs 150 pounds."
        }
    ],
    "html": "<i>This eerie creature has the upper body of a beautiful, pale green woman, but her lower body is a pulsating mound of fungus.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Fungus Queen",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 7
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 18
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "detect good"
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "low-light vision"
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Plant",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "extraplanar"
                }
            ],
            "size": "Medium",
            "alignment": "Chaotic Evil",
            "alignment_text": "CE",
            "cr": "9",
            "xp": 6400
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 23,
                "touch": 13,
                "flat-footed": 20,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+3 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+10 natural"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 13
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 7
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 7
                }
            },
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 10,
                    "text": "10/cold iron or good",
                    "conjunction": "or",
                    "damage_types": [
                        "cold iron",
                        "good"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "electricity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "plant traits"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "acid"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "cold"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 20
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "20 ft.",
                        "movement_type": "walk",
                        "value": 20
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 2,
                    "name": "claws",
                    "bonus": [
                        14
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d6+5"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 4,
                    "name": "tentacles",
                    "bonus": [
                        12
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4+2"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "grab"
                        }
                    ]
                }
            ],
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "compel plants"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "1d4+5"
                        }
                    ],
                    "name": "constrict"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "create spawn"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "1 level"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "DC 23"
                        }
                    ],
                    "name": "energy drain"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "sporepod"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Spell-Like Abilities",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "detect good"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "tongues"
                                    }
                                ],
                                "count_text": "Constant",
                                "frequency": "Constant"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "veil",
                                        "spell_dc": 23,
                                        "modifiers": [
                                            {
                                                "type": "stat_block_section",
                                                "subtype": "modifier",
                                                "name": "self only"
                                            }
                                        ]
                                    }
                                ],
                                "count_text": "At will",
                                "frequency": "At will"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "charm monster",
                                        "spell_dc": 21
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "detect thoughts",
                                        "spell_dc": 19
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "suggestion",
                                        "spell_dc": 20
                                    }
                                ],
                                "count_text": "3/day",
                                "count": 3,
                                "frequency": "day"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "dominate person",
                                        "spell_dc": 22
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "mind fog",
                                        "spell_dc": 22
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "slow",
                                        "spell_dc": 20
                                    }
                                ],
                                "count_text": "1/day",
                                "count": 1,
                                "frequency": "day"
                            }
                        ],
                        "caster_level": 9,
                        "concentration": 16
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 9
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+18 grapple"
                    }
                ],
                "value": 14
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "can’t be tripped"
                    }
                ],
                "value": 27
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 21,
            "dex": 17,
            "con": 21,
            "int": 18,
            "wis": 16,
            "cha": 24,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Expertise",
                    "link": {
                        "type": "link",
                        "name": "Combat Expertise",
                        "alt": "Combat Expertise",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Expertise"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Combat Reflexes",
                        "alt": "Combat Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative",
                    "link": {
                        "type": "link",
                        "name": "Improved Initiative",
                        "alt": "Improved Initiative",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Initiative"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Multiattack",
                    "link": {
                        "type": "link",
                        "name": "Multiattack",
                        "alt": "Multiattack",
                        "href": "FeatDisplay.aspx?ItemName=Multiattack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Power Attack",
                    "link": {
                        "type": "link",
                        "name": "Power Attack",
                        "alt": "Power Attack",
                        "href": "FeatDisplay.aspx?ItemName=Power%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "Disguise"
                        }
                    ],
                    "name": "Skill Focus",
                    "link": {
                        "type": "link",
                        "name": "Skill Focus (Disguise)",
                        "alt": "Skill Focus (Disguise)",
                        "href": "FeatDisplay.aspx?ItemName=Skill%20Focus"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Bluff",
                        "value": 22
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Disguise",
                        "value": 28
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (dungeoneering, planes)",
                        "value": 10
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 18
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Sense Motive",
                        "value": 18
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Use Magic Device",
                        "value": 22
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Abyssal"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Aklo"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Undercommon"
                    }
                ],
                "communication_abilities": [
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "telepathy",
                        "range": {
                            "type": "stat_block_section",
                            "subtype": "range",
                            "text": "100 ft.",
                            "range": 100,
                            "unit": "feet"
                        }
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "tongues"
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "plant empathy +23"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Bestiary 6",
            "link": {
                "type": "link",
                "name": "Bestiary 6 pg. 130",
                "alt": "Bestiary 6 pg. 130",
                "href": "http://paizo.com/products/btpy9oge?Pathfinder-Roleplaying-Game-Bestiary-6-Hardcover%0D%0A"
            },
            "page": 130
        },
        {
            "type": "source",
            "name": "Inner Sea Bestiary",
            "link": {
                "type": "link",
                "name": "Inner Sea Bestiary pg. 12",
                "alt": "Inner Sea Bestiary pg. 12",
                "href": "http://paizo.com/products/btpy8v2x?Pathfinder-Campaign-Setting-Inner-Sea-Bestiary%0D%0A"
            },
            "page": 12
        }
    ]
}