{
    "name": "Mosslord",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> temperate forests<br/><b>Organization</b> solitary<br/><b>Treasure</b> triple"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Deadwood Curse (Su)</b> When a mosslord confirms a critical hit with one of its claws, the victim must succeed at a DC 30 Fortitude save or a horrid curse transforms one of its limbs into an immobile wooden branch. Roll 1d4 to determine which limb is affected (1—right arm, 2—left arm, 3—right leg, 4—left leg; adjust the die as necessary for creatures with fewer or more limbs). The cursed limb hardens and becomes entirely immobile until the curse is lifted. If an arm is affected, the victim’s Strength is reduced by 2 and it cannot wield weapons in that hand or use the hand in any way. If a victim’s leg is affected, the victim’s Dexterity is reduced by 2 and its base speed is reduced by 15 feet. Each time a creature is affected by this curse, a new limb is affected, and the effects stack. If a cursed limb is amputated and regrown via magic, the new limb regrows as deadwood as long as the curse persists. This is a curse effect. The save DC is Constitution-based. <br/><br/><b>Perennial (Su)</b> When a mosslord dies, its body decomposes normally but regrows in 60 days. A dead mosslord cannot regrow during winter months or when there is frost or snow on the ground where it was slain; in such a condition, its regrowth is delayed until the thaw. If the region where the mosslord was slain is affected by a lasting winter (either via magic or as a result of natural conditions), its regrowth can be delayed indefinitely. Even completely destroying a mosslord’s body won’t stop its eventual regrowth. A <i>blight</i> or <i>diminish plants</i> spell applied to a mosslord’s remains can ensure its permanent death if the caster succeeds at a DC 30 caster level check. A mosslord slain on any plane other than the Material Plane remains dead permanently. Obscure rituals can also aid in the permanent death of a mosslord, at the GM’s discretion. <br/><br/><b>Sheets of Moss (Su)</b> Once every 1d4 rounds as a move action, a mosslord can cover a 20-foot-square area in a thick blanket of toxic moss at a range of up to 90 feet. Living creatures in the area are automatically entangled and sickened and must succeed at a DC 30 Fortitude save or take 1d4 points of Constitution damage per round until the moss dissipates or is destroyed. The moss has 25 hit points per 5-foot square, but can only be damaged by cold or effects that specifically target plants (such as <i>blight</i>) or deal additional damage to plants (such as <i>horrid wilting</i>). Otherwise, the sheets of moss wither away automatically after 1d4+4 rounds. The sickened effect and Constitution damage are poison effects. The save DC is Constitution-based. <br/><br/><b>Yellow Mold Blast (Su)</b> As a standard action, a mosslord can swiftly extrude a puffball and hurl it up to 60 feet. Upon impact, the puffball bursts into an unusually thick and potent cloud of yellow mold spores. This cloud of spores fills a 10-foot-radius area, obscuring vision as if it were a fog cloud and affecting all creatures within the area with yellow mold (<i>Pathfinder RPG Core Rulebook</i> 416), except the Fortitude save to resist the mold’s poisonous effects is DC 30. A creature that takes Constitution damage from these thick spores is also nauseated for 1 round. The cloud of spores persists for 1d4 rounds, after which it automatically dissipates. Creatures with <i>greensight</i> can see through these clouds of spores with ease. The save DC is Constitution-based."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Tales of the wretched mosslord have existed for as long as humanity has dared dwell amid the forests of the world. It appears in grotesque pictographs of long dead civilizations, covering the walls of lost cities on sunken continents or hidden in overgrown jungles. So ancient is the creature that its true origin remains unknown. In the cultures whose lore and legend tell of the mosslord, it is described as the living incarnation of the forest’s vengeance against the encroachment of civilization, a fury given mind and focus toward the destruction of humanity. To date, no one has ever reported spotting more than a single mosslord at a time, prompting speculation as to whether more than a single mosslord exists, or if it is a singular entity that simply regrows itself each time it is destroyed. <br/><br/>Most tales of the mosslord’s intentions hold true, although the legends of there being but one mosslord are a false hope—in truth, multiple mosslords exist, and wherever one surfaces, ruin inevitably follows. Yet mosslords are hardly the simple, violent juggernauts that old legends purport. Instead, these wickedly intelligent creatures mastermind elaborate campaigns against civilization. Capable of commanding hordes of plant creatures, they typically spend months or even years seeding a target before launching an incursion—even if their attacks seem sudden and unprovoked to the victims. They are clever combatants, shielding themselves from direct attacks and avoiding melee if at all possible, in order to command and maneuver allies. Still, the creature is an able warrior in addition to having a potent arsenal of spells, and it doesn’t shy from engaging opponents in melee when directly faced with an immediate opponent. Among all humanoid forms of life, they despise humans and halflings in particular. <br/><br/>A mosslord has no known or ties to the fey world or to those worlds or planes beyond the material realm. Though the mosslord is no deity, it is a wholly supernatural being and the apocalyptic texts of over a dozen different religions depict its wrath. These texts often revile the mosslord and condemn those who would worship it or pay it reverence. Despite ominous warnings, history reports a handful of occasions when doom cults praised, venerated, and pledged fealty to mosslords. Some even credit or blame such cults for the creation of the first mosslords, for it seems odd that plant creatures would naturally form upon the wooden frames that hold its fungal flesh in the form of a bipedal humanoid. Regardless, such efforts tend to be short lived; as soon as the cultists capture the mosslord’s attention, they find they have only attracted its relentless and utter destruction. <br/><br/>The mosslord’s body consists of a large skeletal frame that towers over 15 feet tall, fashioned from rough-cut pieces of wood. A thick layer of moss encompasses this frame, creating the appearance of flesh. While a mosslord’s body appears constructed, the creature is fully sentient and highly intelligent. Despite their similar hateful and destructive views of civilization, mosslords do not cooperate with blights or whisperers, and they often compete with these strange entities for control over their woodland territories."
        }
    ],
    "html": "<i>This towering, four-armed humanoid seems to be made of moss and splintered wood, its face sinister and mouthless.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Mosslord",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 13
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 35
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "greensight"
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "low-light vision"
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "see invisibility"
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Plant",
            "size": "Large",
            "alignment": "Lawful Evil",
            "alignment_text": "LE",
            "cr": "18",
            "xp": 153600
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 33,
                "touch": 19,
                "flat-footed": 23,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+9 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+1 dodge"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+14 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-1 size"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 22
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 17
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 17
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "perennial"
                }
            ],
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 15,
                    "text": "15/magic and slashing",
                    "conjunction": "and",
                    "damage_types": [
                        "magic",
                        "slashing"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "fire"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "plant traits"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 30,
                    "name": "electricity"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 4,
                    "name": "claws",
                    "bonus": [
                        28
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d8+11"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "curse"
                        }
                    ]
                }
            ],
            "space": "10 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "10 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "deadwood curse"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "sheets of moss"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "yellow mold blast"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Spell-Like Abilities",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "nondetection"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "pass without trace"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "see invisibility"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "speak with plants"
                                    }
                                ],
                                "count_text": "Constant",
                                "frequency": "Constant"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "command plants",
                                        "spell_dc": 20
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "fear",
                                        "spell_dc": 20
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "mind thrust VI",
                                        "spell_dc": 22
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "transport via plants"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "tree shape"
                                    }
                                ],
                                "count_text": "At will",
                                "frequency": "At will"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "animate plants"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "displacement"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "metamagic": "quickened",
                                        "name": "fungal infestation",
                                        "spell_dc": 19
                                    }
                                ],
                                "count_text": "3/day",
                                "count": 3,
                                "frequency": "day"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "control plants",
                                        "spell_dc": 24
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "microcosm",
                                        "spell_dc": 25
                                    }
                                ],
                                "count_text": "1/day",
                                "count": 1,
                                "frequency": "day"
                            }
                        ],
                        "caster_level": 18,
                        "concentration": 24
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 18
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+34 sunder"
                    }
                ],
                "value": 30
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "52 vs. sunder"
                    }
                ],
                "value": 50
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 32,
            "dex": 28,
            "con": 26,
            "int": 27,
            "wis": 25,
            "cha": 23,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Casting",
                    "link": {
                        "type": "link",
                        "name": "Combat Casting",
                        "alt": "Combat Casting",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Casting"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Combat Reflexes",
                        "alt": "Combat Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Critical Focus",
                    "link": {
                        "type": "link",
                        "name": "Critical Focus",
                        "alt": "Critical Focus",
                        "href": "FeatDisplay.aspx?ItemName=Critical%20Focus"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Dodge",
                    "link": {
                        "type": "link",
                        "name": "Dodge",
                        "alt": "Dodge",
                        "href": "FeatDisplay.aspx?ItemName=Dodge"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Greater Sunder",
                    "link": {
                        "type": "link",
                        "name": "Greater Sunder",
                        "alt": "Greater Sunder",
                        "href": "FeatDisplay.aspx?ItemName=Greater%20Sunder"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "claw"
                        }
                    ],
                    "name": "Improved Critical",
                    "link": {
                        "type": "link",
                        "name": "Improved Critical (claw)",
                        "alt": "Improved Critical (claw)",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative",
                    "link": {
                        "type": "link",
                        "name": "Improved Initiative",
                        "alt": "Improved Initiative",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Initiative"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Sunder",
                    "link": {
                        "type": "link",
                        "name": "Improved Sunder",
                        "alt": "Improved Sunder",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Sunder"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Iron Will",
                        "alt": "Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Mobility",
                    "link": {
                        "type": "link",
                        "name": "Mobility",
                        "alt": "Mobility",
                        "href": "FeatDisplay.aspx?ItemName=Mobility"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Power Attack",
                    "link": {
                        "type": "link",
                        "name": "Power Attack",
                        "alt": "Power Attack",
                        "href": "FeatDisplay.aspx?ItemName=Power%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "fungal infestation"
                        }
                    ],
                    "name": "Quicken Spell-Like Ability"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Staggering Critical",
                    "link": {
                        "type": "link",
                        "name": "Staggering Critical",
                        "alt": "Staggering Critical",
                        "href": "FeatDisplay.aspx?ItemName=Staggering%20Critical"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Climb",
                        "value": 36
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Intimidate",
                        "value": 31
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (arcana, geography, nature)",
                        "value": 33
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 35
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Sense Motive",
                        "value": 32
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Spellcraft",
                        "value": 33
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 33
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Survival",
                        "value": 32
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Aklo"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Sylvan"
                    }
                ],
                "communication_abilities": [
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "speak with plants"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "telepathy",
                        "range": {
                            "type": "stat_block_section",
                            "subtype": "range",
                            "text": "100 ft.",
                            "range": 100,
                            "unit": "feet"
                        }
                    }
                ]
            }
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Bestiary 6",
            "link": {
                "type": "link",
                "name": "Bestiary 6 pg. 194",
                "alt": "Bestiary 6 pg. 194",
                "href": "http://paizo.com/products/btpy9oge?Pathfinder-Roleplaying-Game-Bestiary-6-Hardcover%0D%0A"
            },
            "page": 194
        }
    ]
}