{
    "name": "Ouroboros",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any (Astral Plane)<br/><b>Organization</b> solitary or knot (2–4)<br/><b>Treasure</b> standard"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Body of Serpents (Su)</b> An ouroboros is simultaneously one enormous serpent and a collection of smaller, entwined serpents. These smaller serpents can split from the whole and lash out at the ouroboros’s enemies. An ouroboros can make up to 8 bite attacks each round. As the ouroboros is uniformly composed of serpents, it can even target creatures it has swallowed whole with these bite attacks, the serpents lining its stomach lashing out at the swallowed creature. <br/><br/><b>Hypnotic Coils (Su)</b> The mere sight of an ouroboros overwhelms the minds of lesser creatures. Any creature within 100 feet that can see an ouroboros must succeed at a DC 27 Will save or be paralyzed for 1d4+1 rounds, watching its endless consumption and churning coils. Any creature that begins its turn paralyzed by this ability must succeed at a DC 27 Will save or take 1d8 points of Wisdom damage as it slowly loses its grip on reality. Every time a creature takes Wisdom damage from this ability, it can immediately attempt a new DC 27 Will save; on a success, the paralysis effect from the hypnotic coils ends. Once a creature recovers from the hypnotic coils’ paralysis effect, it is immune to further paralysis from that particular ouroboros’s coils for 24 hours. This is a vision-based mind-affecting effect. The save DCs are Charisma-based. <br/><br/><b>Maw (Ex)</b> An ouroboros gains a powerful bite attack while not engaged in self-consumption. This is a primary attack that always applies 1-1/2 times the ouroboros’s Strength modifier to the damage roll. When it bites with its maw, its regular bite attacks become secondary attacks. <br/><br/><b>Perpetual Renewal (Su)</b> An ouroboros continually consumes and regrows itself. The duration of any spell or effect that causes an ouroboros to be dazed, deafened, diseased, exhausted, fatigued, nauseated, poisoned, sickened, or stunned can never have a duration of longer than 1 round. Any ability damage or drain an ouroboros receives is automatically healed at a rate of 1d4 points per round per ability. Perpetual renewal functions only while the ouroboros consumes itself. <br/><br/><b>Ruinous Blood (Su)</b> The blood that sprays from the ragged stump of an ouroboros’s tail is so potent with positive energy that it warps the flesh of those exposed to it, transforming them into fractured pieces of the ouroboros itself. Once every 1d4 rounds as a move action, an ouroboros can spray a 60-foot line of blood from the stump of its tail. Creatures caught in this area must succeed at a DC 27 Fortitude save or be permanently transformed into a venomous snake swarm (<i>Pathfinder RPG Bestiary 3</i> 249) that retains no memories of its previous life, as per <i>baleful polymorph</i> when the target fails its Will save to resist the spell’s secondary effect. This is a curse effect. The save DC is Charisma-based. <br/><br/><b>Self-Consumption (Su)</b> An ouroboros continuously eats its own tail. So long as the ouroboros continues its self-consumption, its regeneration cannot be suppressed by any form of attack and it benefits from the effects of perpetual renewal, but it cannot use its maw attack or its ruinous blood ability. Any effect that would kill the ouroboros outright merely halves the ouroboros’s remaining hit points. Once an ouroboros’s hit points are reduced to less than half its normal maximum (198 hit points for a typical ouroboros), the monster ceases its self-consumption, loses its perpetual renewal ability, and gains its maw and ruinous blood abilities. All its movement speeds are doubled when the ouroboros is in this state, but its regeneration can now be suppressed via damage caused by mythic weapons or spells. An ouroboros can resume self-consumption as a standard action as long as it has more than half its hit points. An ouroboros need not eat or drink to survive—its own body is all the sustenance it needs."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "The ouroboros—the serpent that eternally consumes itself— occupies a place in the mythology of many civilizations, yet few suspect that these legends are inspired by a real and terrifying race of creatures. Living ouroboroses dwell on the Astral Plane, where they are content to drift aimlessly through the silvery void. <br/><br/>Ouroboroses are capable of tremendous devastation, yet they have little reason to seek out such violence. They are each a world unto themselves, autonomous and reliant on no other creature for their sustenance or livelihood. An ouroboros can exist forever, constantly eating itself and replenishing its body with its own infinity. Barely sentient, an ouroboros has a powerful, almost pathological will to survive, which drives it to destroy any and all creatures that pose even the slightest threat to its well-being. This propensity to attack without clear provocation or warning has given ouroboroses a reputation for being engines of mindless destruction. <br/><br/>An ouroboros might appear to be a single creature, but closer inspection reveals the truth: its body is formed from a myriad of smaller entwined serpents, which are not independent creatures and become lifeless once separated from the main body. Those who have examined serpents detached from an ouroboros report that these creatures too are formed from smaller serpents that, when inspected under magnification, prove to be composed of tinier serpents still. <br/><br/>An ouroboros’s most striking feature is its ability to almost instantly grow new flesh and heal from nearly any wound. This profound regenerative ability comes in part from an ouroboros’s magical blood, which has many miraculous properties. Many have tried to harness the healing powers of the ouroboros’s blood to restore life to the dead or regenerate grievous wounds. While such treatments can be successful, given the application of the correct but obscure occult rituals, ouroboros blood is uniquely suited to the generation of ouroboros flesh and no other. Patients treated in this way typically suffer the fate of those exposed directly to the ouroboros’s blood and transform into serpents. <br/><br/>While ouroboroses seem mindless, they have crude intellects and can understand speech. Yet whatever motives the ouroboroses have for hiding away on the Material Plane are unclear. Most find their way to this reality by accident, tumbling through rents in reality from the Astral Plane or perhaps conjured here by powerful magic wielded by mad spellcasters eager to unleash devastation upon the world. <br/><br/>An ouroboros is usually coiled into a circle roughly 50 feet in diameter. It weighs 260 tons."
        }
    ],
    "html": "<i>This serpentine creature chews at its own tail. Its body consists of a multitude of entangled serpents with countless hissing jaws.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Ouroboros",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 12
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 23
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "blindsense 120 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "low-light vision"
            }
        ],
        "auras": [
            {
                "type": "stat_block_section",
                "subtype": "aura",
                "name": "hypnotic coils",
                "range": {
                    "type": "stat_block_section",
                    "subtype": "range",
                    "text": "100 ft.",
                    "range": 100,
                    "unit": "feet"
                },
                "saving_throw": {
                    "type": "stat_block_section",
                    "subtype": "save_dc",
                    "text": "DC 27",
                    "dc": 27
                }
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Magical Beast",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "extraplanar"
                }
            ],
            "size": "Colossal",
            "alignment": "Neutral",
            "alignment_text": "N",
            "cr": "21",
            "xp": 409600
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 38,
                "touch": 11,
                "flat-footed": 29,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+8 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+1 dodge"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+27 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-8 size"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 25
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 22
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 18
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "perpetual renewal"
                }
            ],
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 15,
                    "text": "15/magic and slashing",
                    "conjunction": "and",
                    "damage_types": [
                        "magic",
                        "slashing"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "acid"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "aging"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "mind-affecting effects"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "negative energy"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "paralysis"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 32
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "60 ft.",
                        "movement_type": "walk",
                        "value": 60
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "perfect<br/>"
                            }
                        ],
                        "name": "fly 60 ft.",
                        "movement_type": "fly",
                        "value": 60
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 8,
                    "name": "bites",
                    "bonus": [
                        30
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d6+14"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 8,
                    "name": "bites",
                    "bonus": [
                        25
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d6+7"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "maw",
                    "bonus": [
                        30
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "4d8+21"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "grab"
                        }
                    ]
                }
            ],
            "space": "30 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "60 ft. with maw"
                    }
                ],
                "value": "30 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "body of serpents"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "fast swallow"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "ruinous blood"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "6d8 bludgeoning plus 6d8 acid damage"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "AC 23"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "39 hp"
                        }
                    ],
                    "name": "swallow whole"
                }
            ],
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 24
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+48 bull rush"
                    }
                ],
                "value": 46
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "67 vs. bull rush"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "can’t be tripped"
                    }
                ],
                "value": 65
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 38,
            "dex": 27,
            "con": 32,
            "int": 3,
            "wis": 27,
            "cha": 20,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Awesome Blow",
                    "link": {
                        "type": "link",
                        "name": "Awesome Blow",
                        "alt": "Awesome Blow",
                        "href": "FeatDisplay.aspx?ItemName=Awesome%20Blow"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Combat Reflexes",
                        "alt": "Combat Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Critical Focus",
                    "link": {
                        "type": "link",
                        "name": "Critical Focus",
                        "alt": "Critical Focus",
                        "href": "FeatDisplay.aspx?ItemName=Critical%20Focus"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Dodge",
                    "link": {
                        "type": "link",
                        "name": "Dodge",
                        "alt": "Dodge",
                        "href": "FeatDisplay.aspx?ItemName=Dodge"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Flyby Attack"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Bull Rush",
                    "link": {
                        "type": "link",
                        "name": "Improved Bull Rush",
                        "alt": "Improved Bull Rush",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Bull%20Rush"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "bite"
                        }
                    ],
                    "name": "Improved Critical",
                    "link": {
                        "type": "link",
                        "name": "Improved Critical (bite)",
                        "alt": "Improved Critical (bite)",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Iron Will",
                        "alt": "Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Mobility",
                    "link": {
                        "type": "link",
                        "name": "Mobility",
                        "alt": "Mobility",
                        "href": "FeatDisplay.aspx?ItemName=Mobility"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Power Attack",
                    "link": {
                        "type": "link",
                        "name": "Power Attack",
                        "alt": "Power Attack",
                        "href": "FeatDisplay.aspx?ItemName=Power%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Staggering Critical",
                    "link": {
                        "type": "link",
                        "name": "Staggering Critical",
                        "alt": "Staggering Critical",
                        "href": "FeatDisplay.aspx?ItemName=Staggering%20Critical"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Fly",
                        "value": 23
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 23
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Aklo",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "cannot speak"
                            }
                        ]
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "no breath"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "self consumption"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Bestiary 6",
            "link": {
                "type": "link",
                "name": "Bestiary 6 pg. 206",
                "alt": "Bestiary 6 pg. 206",
                "href": "http://paizo.com/products/btpy9oge?Pathfinder-Roleplaying-Game-Bestiary-6-Hardcover%0D%0A"
            },
            "page": 206
        }
    ]
}