{
    "name": "Agyra",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> warm mountains<br/><b>Organization</b> solitary (unique)<br/><b>Treasure</b> incidental"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Blinding Flash (Su)</b> By spreading her wings as a full-round action while she stands upon the ground, Agyra can create a blinding flash of light that targets all creatures within 100 feet. Affected creatures must succeed at a DC 41 Fortitude save or be permanently blinded and staggered for 1d6 rounds by the blast of light. A successful saving throw reduces the blindness to 1 round and negates the staggered effect. The save DC is Constitution-based.<br/><br/><b>Breath Weapon (Su)</b> Once every 4 rounds as a standard action, each of Agyra’s twin heads can breathe out a line of electricity to a range of 1,200 feet. Agyra can breathe each line in a different direction. Each creature caught in a line of electricity must succeed at a DC 41 Reflex save or take 20d6 points of electricity damage and be staggered for 1d4 rounds. A successful saving throw halves the damage and negates the staggered effect. A creature struck by both breath weapons simultaneously must attempt separate saving throws against each breath weapon, but takes a –4 penalty on both—the damage and staggered condition duration stack with each other. A creature wearing medium or heavy metal armor or a creature composed mostly of metal that fails its saving throw is also stunned for 1 round. A creature slain by Agyra’s breath weapon remains electrified for 2d4 rounds after death—any creature that touches the body automatically takes 3d6 points of electricity damage. The save DC is Constitution-based.<br/><br/><b>Electrified Corpse (Su)</b> If Agyra is slain, her corpse crackles and flashes with pulses of electrical light if she has not used her rebirth ability that year. Any creature that touches her corpse takes 3d6 points of electricity damage. Even if Agyra’s body is destroyed, the site of her death continues to carry this electrical charge for 1 minute, or until Agyra is reborn, whichever comes first.<br/><br/><b>Hurricane (Sp)</b> Once per day, Agyra can create a supernatural hurricane surrounding herself. This effect functions as <i>control weather</i>, save that it affects an area with a 4-mile radius, lasts for 24 hours, and can only be used to create hurricane-force winds. The hurricane created is static, and features a calm eye at the center with a 500-foot radius.<br/><br/><b>Rebirth (Su)</b> Agyra remains dead for only 1 minute before she come back to life, as if via a <i>true resurrection</i> spell. Agyra rises from the exact same position she occupied when she died, and typically takes advantage of this second chance to use her swift flight to escape as soon as possible. Agyra can only be reborn in this manner once per year; if she is slain a second time before a year has passed, her death is permanent and her corpse does not become electrified. This ability replaces Agyra’s ability to immediately heal damage that would normally kill her, granted by her recovery ability, but does not replace the other defenses granted by recovery.<br/><br/><b>Storm Flier (Ex)</b> Agyra does not take penalties on Fly checks when flying in strong or more powerful winds.<br/><br/><b>Swift Flight (Su)</b> As a standard action once per hour, Agyra can fly in a straight line at an incredible speed. She may travel up to 1 mile in this manner—doing so does not provoke attacks of opportunity. When Agyra activates this ability, her thunderous blast ability is automatically triggered from the swift flight’s point of origin.<br/><br/><b>Thunderous Blast (Su)</b> When Agyra uses her swift flight, she creates a thunderous sonic boom. This devastating explosion of sound occurs at her location when she activates swift flight, filling an area equal to her space and her reach combined—resulting in a 100-foot-diameter burst of sonic energy. All creatures in this area of effect take 20d10 points of sonic damage, are permanently deafened, are knocked prone, and are stunned for 1 round. A successful DC 41 Reflex save halves the damage, reduces the deafened condition to 1d4 rounds, and negates the knocked prone and stun effects entirely. The save DC is Constitution-based."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Agyra, the Forever Storm, is believed by many cultures to be the cause of seasonal typhoons or other great storms— such tempests being a manifestation of Agyra’s monstrous breaths as she exhales during her long slumber every season. While this kaiju is not in fact responsible for the world’s storms, her powers over wind and lightning are significant, and when she is vexed to rampage, the effects of her hurricanes can be as devastating to a region as her more direct attacks.<br/><br/>Agyra has the appearance of a primeval, two-headed flying reptile with a wingspan of over 150 feet. Her tail is perhaps the most fearsome of her aspects. This lengthy and flailing appendage is covered with razor-sharp blades and wickedly barbed spines capable of slashing through buildings and tearing through armor with great force and from great distances.<br/><br/>Agyra dwells on the upper slopes of a long-dormant volcano that sits on a remote tropical island beyond the main shipping lanes and the scope of most explorers’ travels. As with many kaiju, she spends the bulk of her time in deep and peaceful slumber. She is ferociously protective of the strange peoples who dwell on the shores of this island, and has been known to rouse herself to come to their defense against slavers, pirates, or other external threats to their way of life. Despite this strange protective streak, Agyra is not a kindly creature—and none know this more plainly than those who share her island. Her responses to intrusions to the island may simply be defenses of her perceived territories, for certainly the villages of the locals suffer significant damage during her local rampages. She’s been known to take wing to travel to distant cities as well, often as a result of some of her island’s inhabitants being taken from the shores as slaves. Yet the devastation she wreaks upon the slavers’ destination cities pays no regard to the safety of the slaves themselves—they are in as much danger as anyone else from the kaiju’s vengeful wrath in this situation.<br/><br/>There are rumors that certain shamans on the isle conceal sacred words or some ancient ritual to waken and command Agyra, and that many of her rampages are not the result of the kaiju being territorial or protective, but simply due to an ancient bargain the natives’ ancestors forged with the mighty beast in some forgotten era. Some speculate that such rituals require the sacrifice of trespassers, but this may be nothing more than fearful superstition or rumors spread by shamans to persuade foreigners to stay clear of their island.<br/><br/>Agyra has a particular hatred of the kaiju Mogaru, and often leaves her volcanic lair to fly west to the remote jungle lake that serves as Mogaru’s home to clash with her nemesis. Mogaru’s penchant for attacking coastal cities often results in a devastating escalation when Agyra arrives to do battle with the land-bound kaiju. Sometimes, methods of conjuring Agyra are used to deliberately lure the kaiju to a city besieged by Mogaru, but just as often her arrival seems to be driven by self-interest. Agyra typically manages to weaken Mogaru enough to drive him off, but is often slain herself in these battles, resurrecting and returning to her home at the same time Mogaru returns to his. The nature of this rivalry is unclear, but kaiju scholars believe that the two monsters have been enemies for longer than humanity has existed."
        }
    ],
    "html": "<i>This two-headed monstrosity has vast wings and a long tail covered in a forest of blades.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Agyra",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 11
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 38
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "blindsense 30 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 600 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "low-light vision"
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Magical Beast",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "air"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "kaiju"
                }
            ],
            "size": "Colossal",
            "alignment": "Chaotic Neutral",
            "alignment_text": "CN",
            "family": "Kaiju",
            "cr": "27",
            "xp": 3276800
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 45,
                "touch": 9,
                "flat-footed": 38,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+7 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+36 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-8 size"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 33
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 25
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 21
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "electrified corpse"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "ferocity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "rebirth"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "recovery"
                }
            ],
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 20,
                    "text": "20/epic",
                    "damage_types": [
                        "epic"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "ability damage"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "ability drain"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "death effects"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "disease"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "electricity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "energy drain"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "fear"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 30,
                    "name": "acid"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 30,
                    "name": "cold"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 30,
                    "name": "fire"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 30,
                    "name": "negative energy"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 30,
                    "name": "sonic"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "80 ft.",
                        "movement_type": "walk",
                        "value": 80
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "average"
                            }
                        ],
                        "name": "fly 200 ft.",
                        "movement_type": "fly",
                        "value": 200
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "swift flight"
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 2,
                    "name": "bites",
                    "bonus": [
                        41
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "6d6+17"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 2,
                    "name": "talons",
                    "bonus": [
                        41
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "3d8+17"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "tail slap",
                    "bonus": [
                        36
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "10d6+8"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "bleed"
                        }
                    ]
                }
            ],
            "space": "50 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "75 ft. with tail"
                    }
                ],
                "value": "50 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "5d6"
                        }
                    ],
                    "name": "bleed"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "blinding flash"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "breath weapon"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "hurl foe"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "hurricane"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "thunderous blast"
                }
            ],
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 32
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+61 bull rush"
                    }
                ],
                "value": 57
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "76 vs. bull rush"
                    }
                ],
                "value": 74
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 44,
            "dex": 25,
            "con": 41,
            "int": 3,
            "wis": 29,
            "cha": 25,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Combat Reflexes",
                        "alt": "Combat Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Critical Focus",
                    "link": {
                        "type": "link",
                        "name": "Critical Focus",
                        "alt": "Critical Focus",
                        "href": "FeatDisplay.aspx?ItemName=Critical%20Focus"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Greater Bull Rush",
                    "link": {
                        "type": "link",
                        "name": "Greater Bull Rush",
                        "alt": "Greater Bull Rush",
                        "href": "FeatDisplay.aspx?ItemName=Greater%20Bull%20Rush"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Greater Vital Strike",
                    "link": {
                        "type": "link",
                        "name": "Greater Vital Strike",
                        "alt": "Greater Vital Strike",
                        "href": "FeatDisplay.aspx?ItemName=Greater%20Vital%20Strike"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Hover",
                    "link": {
                        "type": "link",
                        "name": "Hover",
                        "alt": "Hover",
                        "href": "FeatDisplay.aspx?ItemName=Hover"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Bull Rush",
                    "link": {
                        "type": "link",
                        "name": "Improved Bull Rush",
                        "alt": "Improved Bull Rush",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Bull%20Rush"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "tail slap"
                        }
                    ],
                    "name": "Improved Critical",
                    "link": {
                        "type": "link",
                        "name": "Improved Critical (tail slap)",
                        "alt": "Improved Critical (tail slap)",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "bite"
                        }
                    ],
                    "name": "Improved Critical",
                    "link": {
                        "type": "link",
                        "name": "Improved Critical (bite)",
                        "alt": "Improved Critical (bite)",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative",
                    "link": {
                        "type": "link",
                        "name": "Improved Initiative",
                        "alt": "Improved Initiative",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Initiative"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Improved Iron Will",
                        "alt": "Improved Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Vital Strike",
                    "link": {
                        "type": "link",
                        "name": "Improved Vital Strike",
                        "alt": "Improved Vital Strike",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Vital%20Strike"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Iron Will",
                        "alt": "Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Power Attack",
                    "link": {
                        "type": "link",
                        "name": "Power Attack",
                        "alt": "Power Attack",
                        "href": "FeatDisplay.aspx?ItemName=Power%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Staggering Critical",
                    "link": {
                        "type": "link",
                        "name": "Staggering Critical",
                        "alt": "Staggering Critical",
                        "href": "FeatDisplay.aspx?ItemName=Staggering%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Vital Strike",
                    "link": {
                        "type": "link",
                        "name": "Vital Strike",
                        "alt": "Vital Strike",
                        "href": "FeatDisplay.aspx?ItemName=Vital%20Strike"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Wingover",
                    "link": {
                        "type": "link",
                        "name": "Wingover",
                        "alt": "Wingover",
                        "href": "FeatDisplay.aspx?ItemName=Wingover"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Fly",
                        "value": 24
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 38
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+16 Perception"
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Auran",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "can’t speak"
                            }
                        ]
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "massive"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "storm flier"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Bestiary 4",
            "link": {
                "type": "link",
                "name": "Bestiary 4 pg. 166",
                "alt": "Bestiary 4 pg. 166",
                "href": "http://paizo.com/products/btpy91ds?Pathfinder-Roleplaying-Game-Bestiary-4"
            },
            "page": 166
        }
    ]
}