{
    "name": "Mogaru",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> warm forests or water<br/><b>Organization</b> solitary (unique)<br/><b>Treasure</b> incidental"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Absorb Energy (Ex)</b> Mogaru absorbs energy attacks that damage him, including negative energy attacks. Damage blocked by one of his resistances or immunities instead heals him an amount equal to the damage dealt. He may absorb only one kind of energy in this manner in a round. The first type of energy that affects him in a round (whether or not it penetrates his immunities or resistance to actually damage him) sets the type of energy he absorbs for that round. Hit points gained in excess of his normal maximum are lost. Mogaru cannot gain healing from energy effects generated by himself.<br/><br/><b>Breath Weapon (Su)</b> Once every 4 rounds, Mogaru can breathe out a beam of fiery red force. When Mogaru uses this attack, he can choose to focus the breath weapon into a single 1,200-foot-long line, or he can shorten the range and turn his head and body while breathing, effectively affecting a 600-foot-long cone. All creatures caught in this area of effect take 20d6 points of fire damage, 20d6 points of force damage, and are staggered for 1d6 rounds from the devastating energy (Reflex DC 42 halves the damage and prevents the staggered effect). A creature slain by this effect is disintegrated, whether the saving throw was successful or not. This breath weapon is particularly effective at blasting through cover—cover does not grant any bonuses on Reflex saves against Mogaru’s breath weapon. The save DC is Constitution-based.<br/><br/><b>Firebolts (Su)</b> As a standard action on any round immediately following the use of his breath weapon, Mogaru can fire bolts of red energy from the glowing spines along his back. These bolts are ranged touch attacks with a range of 1,200 feet. When Mogaru uses this ability, he must choose between firing one firebolt, three firebolts, or six firebolts. If he fires one, it deals 20d6 points of damage on a hit. If he fires three bolts, each deals 8d6 points of damage on a hit. If he fires six bolts, each deals 5d6 points of damage on a hit. Half of the damage caused by any one firebolt is fire damage, the other half is force damage. Firebolts deal full damage against objects, and ignore the first 10 points of hardness possessed by an object.<br/><br/><b>Reflexive Breath (Ex)</b> The first time in any round that Mogaru can make an attack of opportunity, he can choose to use a diminished version of his breath weapon instead of making a physical attack. This reflexive breath weapon attack only targets the creature that provoked the attack of opportunity, but otherwise causes the same damage and effects his breath weapon normally inflicts (Reflex DC 32 halves the damage and negates the staggered effect). Use of his breath weapon in this way does not affect the recharge rate of the regular breath weapon. The save DC is Constitution-based, and includes a –10 penalty to reflect the fact that the reflexive breath is a shorter (but no less intense) blast of energy than the kaiju’s typical breath weapon attack.<br/><br/><b>Sense Kaiju (Su)</b> Mogaru can sense the location of the nearest active kaiju, as if using <i>discern location</i>, at will.<br/><br/><b>Susceptible to Song (Ex)</b> Mogaru’s actions can be influenced by song, provided the kaiju notices the singing. If the kaiju is not currently engaged in battle, he automatically hears any song within 100 feet that is directed at him in an attempt to influence him, but when he is in combat, there’s only a cumulative 20% chance per round of sustained singing that he notices the song. In order to influence Mogaru, the singer must make a DC 35 Perform (sing) check (this check cannot be bolstered by the aid another action, and the singer cannot take 10 or 20 on the check). The result of this check sets the DC of the Will save Mogaru must make in order to not be influenced by the song. The singer can choose to influence Mogaru as if she had successfully cast <i>suggestion</i> on the kaiju (CL = the singer’s ranks in Perform [sing]). If Mogaru succeeds at a Will save (DC = the singer’s ranks in Perform [sing] + the singer’s Charisma modifier), the effects of the influence last for a maximum of 1d4 rounds; otherwise, the effects last as long as a <i>suggestion</i> spell would normally last. Mogaru cannot use his recovery ability to recover from song influence, and a single singer may influence Mogaru only once per day."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Mogaru, known as the Final King to kaiju scholars, or simply as King Mogaru, is one of the most destructive of his kind. Although not the most powerful kaiju (a sobering thought in and of itself ), Mogaru is certainly the most active of the known kaiju. Additionally, Mogaru seems to be as eager to rampage through the works of humanity as he is to attack and kill other kaiju, making him something of a mixed blessing to kaiju-threatened cities. While the prospect of an attack by Mogaru is the stuff of nightmares, the possibility of his intervention during a different kaiju attack is the stuff of hope, though the damage dealt to a city during its defense may be significant. Mogaru appears as a towering dinosaur with twin tails, spines that glow red as he uses his breath weapon, and two powerful clawed forearms.<br/><br/>King Mogaru dwells in the depths of a tropical jungle, sleeping silently at the bottom of an unusually deep lake until roused. Legends hold that Mogaru was born of the world itself, either formed from the spirits of countless plants and animals resulting from ages of hunting and predation by humanoids for food or sport, or formed from the souls of the countless slain in an ancient apocalypse or war that devastated one of the first of the world’s empires. Regardless of the actual cause, the birth of Mogaru in these legends seems to be the same—soon after another kaiju, Lord Varklops, emerged from an erupting volcano, Mogaru rose to oppose the Thrice-Headed Fiend in a vast battle that nearly slew Varklops while devastating an entire nation in the process. Mogaru is also rumored to have slain no fewer than a dozen other kaiju, including Agmazar the Star Titan, now believed to be the only undead kaiju in existence.<br/><br/>Of particular note is the curious fact that Mogaru exhibits a particularly unique interest in song. Legends of skilled singers being able to save their cities with a single mournful paean to the kaiju, or of vengeful bards using their craft to waken the monster from his lair to send him on a rampage are common along coastal regions with a history of kaiju attacks, and in such regions renowned singers are well respected for this ability to inf luence one of the world’s most destructive creatures. Kaiju scholars suspect that song manages to penetrate Mogaru’s memories of some primeval event, but the reasons for the kaiju’s reaction to the song are its own.<br/><br/>Mogaru stands 140 feet high and weighs 20,000 tons, and is nearly 300 feet long from nose to tail."
        }
    ],
    "html": "<i>This towering saurian lumbers on its hind legs, its twin tails thrashing and the spines on its back glowing with red energy.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Mogaru",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 9
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 45
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 600 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "low-light vision"
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "see invisibility"
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "sense kaiju"
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Magical Beast",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "kaiju"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "water"
                }
            ],
            "size": "Colossal",
            "alignment": "Chaotic Neutral",
            "alignment_text": "CN",
            "family": "Kaiju",
            "cr": "28",
            "xp": 4915200
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 47,
                "touch": 7,
                "flat-footed": 42,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+5 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+40 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-8 size"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 34
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 24
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 23
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "absorb energy"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "ferocity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "recovery"
                }
            ],
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 20,
                    "text": "20/epic",
                    "damage_types": [
                        "epic"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "ability damage"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "ability drain"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "death effects"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "disease"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "energy drain"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "fire"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": ""
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "fear"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 30,
                    "name": "acid"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 30,
                    "name": "cold"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 30,
                    "name": "electricity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 30,
                    "name": "negative energy"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 30,
                    "name": "sonic"
                }
            ],
            "weaknesses": [
                {
                    "type": "stat_block_section",
                    "subtype": "weakness",
                    "name": "susceptible to song"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "100 ft.",
                        "movement_type": "walk",
                        "value": 100
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "swim 100 ft.",
                        "movement_type": "swim",
                        "value": 100
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "bite",
                    "bonus": [
                        46
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "8d6+20"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "grab"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 2,
                    "name": "claws",
                    "bonus": [
                        46
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "4d8+20"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 2,
                    "name": "tail slaps",
                    "bonus": [
                        44
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "6d6+10"
                        }
                    ]
                }
            ],
            "ranged": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "ranged",
                    "touch": true,
                    "name": "firebolts",
                    "bonus": [
                        31
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "damage variable"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "see below"
                        }
                    ]
                }
            ],
            "space": "60 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "60 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "breath weapon"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "ferocity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "fast swallow"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "hurl foe"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "reflexive breath"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "10d6 bludgeoning and 10d6 fire damage"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "AC 30"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "69 hp"
                        }
                    ],
                    "name": "swallow whole"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "4d8+30"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "DC 47"
                        }
                    ],
                    "name": "trample"
                }
            ],
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 34
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+66 bull rush"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+66 grapple"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+66 sunder"
                    }
                ],
                "value": 62
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "81 vs. bull rush"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "81 vs. sunder"
                    }
                ],
                "value": 79
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 50,
            "dex": 21,
            "con": 41,
            "int": 3,
            "wis": 30,
            "cha": 26,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Combat Reflexes",
                        "alt": "Combat Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Critical Focus",
                    "link": {
                        "type": "link",
                        "name": "Critical Focus",
                        "alt": "Critical Focus",
                        "href": "FeatDisplay.aspx?ItemName=Critical%20Focus"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Greater Bull Rush",
                    "link": {
                        "type": "link",
                        "name": "Greater Bull Rush",
                        "alt": "Greater Bull Rush",
                        "href": "FeatDisplay.aspx?ItemName=Greater%20Bull%20Rush"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Greater Sunder",
                    "link": {
                        "type": "link",
                        "name": "Greater Sunder",
                        "alt": "Greater Sunder",
                        "href": "FeatDisplay.aspx?ItemName=Greater%20Sunder"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Greater Vital Strike",
                    "link": {
                        "type": "link",
                        "name": "Greater Vital Strike",
                        "alt": "Greater Vital Strike",
                        "href": "FeatDisplay.aspx?ItemName=Greater%20Vital%20Strike"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Bull Rush",
                    "link": {
                        "type": "link",
                        "name": "Improved Bull Rush",
                        "alt": "Improved Bull Rush",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Bull%20Rush"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "bite"
                        }
                    ],
                    "name": "Improved Critical",
                    "link": {
                        "type": "link",
                        "name": "Improved Critical (bite)",
                        "alt": "Improved Critical (bite)",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "claw"
                        }
                    ],
                    "name": "Improved Critical",
                    "link": {
                        "type": "link",
                        "name": "Improved Critical (claw)",
                        "alt": "Improved Critical (claw)",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative",
                    "link": {
                        "type": "link",
                        "name": "Improved Initiative",
                        "alt": "Improved Initiative",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Initiative"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Improved Iron Will",
                        "alt": "Improved Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Sunder",
                    "link": {
                        "type": "link",
                        "name": "Improved Sunder",
                        "alt": "Improved Sunder",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Sunder"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Vital Strike",
                    "link": {
                        "type": "link",
                        "name": "Improved Vital Strike",
                        "alt": "Improved Vital Strike",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Vital%20Strike"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Iron Will",
                        "alt": "Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Multiattack",
                    "link": {
                        "type": "link",
                        "name": "Multiattack",
                        "alt": "Multiattack",
                        "href": "FeatDisplay.aspx?ItemName=Multiattack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Power Attack",
                    "link": {
                        "type": "link",
                        "name": "Power Attack",
                        "alt": "Power Attack",
                        "href": "FeatDisplay.aspx?ItemName=Power%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Staggering Critical",
                    "link": {
                        "type": "link",
                        "name": "Staggering Critical",
                        "alt": "Staggering Critical",
                        "href": "FeatDisplay.aspx?ItemName=Staggering%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Vital Strike",
                    "link": {
                        "type": "link",
                        "name": "Vital Strike",
                        "alt": "Vital Strike",
                        "href": "FeatDisplay.aspx?ItemName=Vital%20Strike"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 45
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Swim",
                        "value": 49
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+16 Perception"
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Aquan",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "can’t speak"
                            }
                        ]
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "massive"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Bestiary 4",
            "link": {
                "type": "link",
                "name": "Bestiary 4 pg. 170",
                "alt": "Bestiary 4 pg. 170",
                "href": "http://paizo.com/products/btpy91ds?Pathfinder-Roleplaying-Game-Bestiary-4"
            },
            "page": 170
        }
    ]
}