{
    "name": "Necrocraft",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any land or underground<br/><b>Organization</b> solitary, pair, or gang (3–6)<br/><b>Treasure</b> none"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Construction Points</b> Necrocrafts have a number of Construction Points (CP) used to purchase abilities and defenses. A Medium necrocraft has 2 CP; differently sized necrocrafts have CP totals as detailed on the size chart on page 201. If a necrocraft is built with more CP than its size category would allow, its CR increases by 1 (minimum of +1) for every 2 additional CP spent. Unless otherwise stated, each of these abilities can be purchased only once. The stats presented here are for a Medium necrocraft (with 2 CP spent on additional movement [fly] and extra attack [bite]).<br/><br/><i>Additional Movement (Ex, 1 CP)</i>: The necrocraft gains a new mode of movement (burrow, climb, fly [clumsy], or swim) at a speed equal to its base speed.<br/><br/><i>All-Around Vision (Ex, 2 CP)</i>: The necrocraft has an additional head facing in the opposite direction from its main head, or has extra eyes grafted at various points around its body. The necrocraft gains all-around vision.<br/><br/><i>Blade Fists (Ex, 1 CP)</i>: Up to two of the necrocraft’s claw attacks are replaced with sharpened bones or metal blades. These attacks deal 1d4 points of bleed damage. This ability can be selected multiple times, applying it to more claw attacks.<br/><br/><i>Bone Armor (Ex, 1 CP)</i>: Fortified with extra bone (perhaps including bones fused to its outer surface like armor), the necrocraft increases its natural armor bonus by 2. This ability can be selected up to three times.<br/><br/><i>Cannibalize (Ex, 1 CP)</i>: If the necrocraft is left near the corpse of a Medium or larger creature with discernible anatomy, it eats the corpse or tears off parts to repair its own substance. An undead creature consumed in this fashion heals the necrocraft 5 hit points plus 5 hit points per size category above Medium; any other type of creature restores only 1/5 this amount. Feeding takes 1 hour; any interruption (such as combat) requires it to start again.<br/><br/><i>Constrict (Ex, 1 CP)</i>: The necrocraft’s claw attacks gain the constrict ability. It must have grab before this ability can be selected.<br/><br/><i>Disease (Su, 1 CP)</i>: One of the necrocraft’s natural attacks is grafted with ghoul mouthparts, exposing a creature it hits to ghoul fever. <i>Ghoul Fever</i>: Bite, claw, or slam—injury; <i>save </i>Fort DC 13; <i>onset </i>1 day; <i>frequency </i>1/day; <i>effect </i>1d3 Con damage and 1d3 Dex damage; <i>cure </i>2 consecutive saves. The save DC is Charisma-based. A humanoid who dies of ghoul fever rises as a ghoul at the next midnight. A humanoid who becomes a ghoul in this way retains none of the abilities it possessed in life. It is not under the control of any other ghouls, but it hungers for the flesh of the living and behaves like a normal ghoul in all respects. A humanoid of 4 Hit Dice or more rises as a ghast.<br/><br/><i>Extra Attack (Ex, 1 CP)</i>: The necrocraft gains an additional bite attack or claw attack. This ability can be selected multiple times.<br/><br/><i>Extra Legs (Ex, 1 CP)</i>: The necrocraft gains two more legs, increasing its base speed by 5 feet and increasing its CMD against overrun and trip attempts by 4. This ability can be selected multiple times.<br/><br/><i>Extra Strength (Ex, 1 CP)</i>: The necrocraft’s Strength increases by 2 but its Dexterity decreases by 2. This ability can be selected twice.<br/><br/><i>Faster (Ex, 1 CP)</i>: The necrocraft’s base, burrow, climb, fly, or swim speed increases by 10 ft.<br/><br/><i>Grab (Ex, 1 CP)</i>: The necrocraft gains the grab ability with its natural attacks.<br/><br/><i>Metal Armor (Ex, 2 CP)</i>: Metal plates are bolted to or fused with the necrocraft, serving as armor and granting it a +4 armor bonus to AC.<br/><br/><i>Mostly Skeletons (Ex, 1 CP)</i>: Most of the necrocraft’s parts come from undead skeletons. The necrocraft gains DR 5/bludgeoning and resist cold 5. This ability can’t be added to a necrocraft with the mostly zombies ability.<br/><br/><i>Mostly Zombies (Ex, 1 CP)</i>: Most of the necrocraft’s parts come from zombies. The necrocraft gains DR 5/slashing and 5 additional hit points. This ability can’t be added to a necrocraft with the mostly skeletons ability.<br/><br/><i>Paralysis (Su, 2 CP)</i>: Up to three of necrocraft’s natural attacks gain the paralysis ability (1d4+1 rounds, DC 13, elves are immune to this effect). This graft requires the body of at least 1 ghoul. For an additional Construction Point, the paralysis ability can affect elves.<br/><br/><i>Reach Attacks (Ex, 1 CP)</i>: Up to two of the necrocraft’s natural attacks increase their natural reach by 5 feet. This ability can be selected multiple times.<br/><br/><i>Rending Claws (Ex, 2 CP)</i>: The necrocraft gains the rend ability, activating when both claws hit and dealing additional damage equal to the damage dice for one claw plus 1-1/2 times the necrocraft’s Strength bonus.<br/><br/><i>Rotting Flesh (Ex, 2 CP)</i>: Two of the necrocraft’s bite or claw attacks are poisonous. <i>Poison</i>: bite or claw—injury; <i>save </i>Fort DC 15; <i>frequency </i>1/round for 2 rounds; <i>effect </i>1d3 Constitution damage; <i>cure </i>1 save.<br/><br/><i>Stench (Ex, 2 CP)</i>: The necrocraft has the stench ability (10- foot radius, Fort DC 15 negates, sickened for 1d6+4 minutes). This graft requires the body of at least one ghoul.<br/><br/><i>Trample (Ex, 2 CP)</i>: The necrocraft gains the trample universal monster ability as a special attack."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "A necrocraft is a medley of undead body parts and corpses grafted together with dark magic to create a single animated undead creature with abilities based on its component pieces and the surgical and necromantic talents of its creator. Necrocrafts are better suited for brute force than delicate manipulation, and most creators build larger hulks rather than smaller, more agile (and fragile) necrocrafts. Though necrocrafts can be of virtually any size and can be made up of undead bodies or parts of any size, a typical Medium specimen is 7 feet tall and weighs 250 pounds.<br/><br/>The details of the ritual to create a necrocraft vary greatly, and depend on the particular undead parts used and the intended size of the resulting creature. The final anatomy of the creation largely depends on the master’s artistry, creativity, and personal preferences—as well as any specific goals it has in mind for the creature. For example, a necrocraft’s “teeth” could actually be dozens of clawed ghoul talons, or its eyes and mouth might be located in its chest rather than in a distinct head."
        }
    ],
    "html": "<i>Thick muscle and jutting bone from multiple corpses fused together form a winged, humanlike predator.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Necrocraft",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 1
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 0
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Undead",
            "size": "Medium",
            "alignment": "Neutral Evil",
            "alignment_text": "NE",
            "cr": "3",
            "xp": 800
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 15,
                "touch": 11,
                "flat-footed": 14,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+1 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+4 natural"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 2
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 2
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 4
                }
            },
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "undead traits"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "clumsy<br/>"
                            }
                        ],
                        "name": "fly 30 ft.",
                        "movement_type": "fly",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 2,
                    "name": "claws",
                    "bonus": [
                        5
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4+2"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "bite",
                    "bonus": [
                        5
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d6+2"
                        }
                    ]
                }
            ],
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 3
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "value": 5
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "value": 16
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 15,
            "dex": 13,
            "con": null,
            "int": null,
            "wis": 10,
            "cha": 13,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Toughness",
                    "link": {
                        "type": "link",
                        "name": "Toughness",
                        "alt": "Toughness",
                        "href": "FeatDisplay.aspx?ItemName=Toughness"
                    },
                    "notation": "B"
                }
            ],
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "additional movement [fly]"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "extra attack [bite]"
                        }
                    ],
                    "name": "Construction Points"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Bestiary 4",
            "link": {
                "type": "link",
                "name": "Bestiary 4 pg. 200",
                "alt": "Bestiary 4 pg. 200",
                "href": "http://paizo.com/products/btpy91ds?Pathfinder-Roleplaying-Game-Bestiary-4"
            },
            "page": 200
        }
    ]
}