{
    "name": "Xotani (The Firebleeder)",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any<br/><b>Organization</b> solitary<br/><b>Treasure</b> standard<br/><b>Advancement</b> 48+ HD (Colossal)"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Blindsight (Ex)</b> Xotani can “see” by emitting highfrequency sounds, inaudible to most other creatures, that allow it to ascertain objects and creatures within 120 feet. A <i>silence</i> spell negates this ability, but its other forms of vision prevent it from being utterly blinded.<br/><br/><b>Breath Weapon (Su)</b> 70-foot cone, once every 1d4 rounds, damage 16d10 fire, Reflex DC 43 half. The save DC is Constitution-based.<br/><br/><b>Firebleed (Ex)</b> As a creature of living fire and wrath, Xotani ferociously strikes back against any creature that wounds it. Any attack that does more than 10 points of damage to Xotani causes the wound to erupt in a 30-foot cone of magma. This cone deals 1d6 points of fire damage plus an additional 1d6 points of fire damage for every 10 points of damage dealt by the attack. Thus, an attack dealing 22 points of damage results in a cone dealing 3d6 points of fire damage, while an attack dealing 49 points of damage results in a cone dealing 5d6 points of fire damage. Creatures affected by the cone may make a DC 43 Reflex save to take only half damage. The save DC is Constitution-based. Ranged attacks and any magical attacks that deal damage also cause this special ability to take effect. Xotani cannot firebleed at will, but might do so 10 times per round (an amount equal to its Constitution modifier).<br/><br/><b>Frightful Presence (Su)</b> Xotani can inspire terror by attacking. Affected creatures must succeed on a DC 35 Will save or become shaken, remaining in that condition as long as they remain within 60 feet of Xotani. This is a mind-affecting fear effect. The save DC is Charisma-based.<br/><br/><b>Heat (Ex)</b> Xotani generates so much heat that its mere touch deals additional 4d8 points of fire damage. Creatures striking Xotani with natural attacks or unarmed attacks are subject to this damage, but creatures striking with melee weapons do not take damage from its heat. This heat can melt or char weapons; any weapon that strikes Xotani is allowed a DC 43 Fortitude save to avoid destruction. The save DC is Constitution-based.<br/><br/><b>Improved Grab (Ex)</b> To use this ability, Xotani must hit a Huge or smaller opponent with its bite attack. It can then attempt to start a grapple as a free action without provoking an attack of opportunity. If it wins the grapple check, it establishes a hold and can try to swallow the foe the following round.<br/><br/><b>Regeneration (Ex)</b> No form of attack deals lethal damage to Xotani. Xotani regenerates even if it fails a saving throw against a <i>disintegrate</i> spell or a death effect. If Xotani fails its save against a spell or effect that would kill it instantly (such as those mentioned above), the spell or effect instead deals nonlethal damage equal to the creature’s full normal hit points +10 (or 738 hp). Xotani is immune to effects that produce incurable or bleeding wounds, such as mummy rot, a sword with the wounding special ability, or a clay golem’s cursed wound ability.<br/><br/>Xotani can be slain only by raising its nonlethal damage total to its full normal hit points +10 (or 738 hit points), at least half of which must be inflicted by cold damage, and using a wish or <i>miracle</i> spell to keep it dead.<br/><br/>If Xotani loses a limb or body part, the lost portion regrows in 1d6 minutes (the detached piece dies and decays normally). Xotani can reattach the severed member instantly by holding it to the stump.<br/><br/><b>Sunlight Blindness (Ex)</b> Abrupt exposure to sunlight (such as <i>sunlight</i>, but not a <i>daylight</i> spell) blinds Xotani for 1 round. On subsequent rounds, it is dazzled while operating in direct sunlight.<br/><br/><b>Swallow Whole (Ex)</b> When Xotani begins its turn with a grappled opponent in its mouth, it can swallow that opponent whole with a successful grapple check. Once inside Xotani, the opponent takes 2d8+7 points of bludgeoning damage plus 20d6 points of fire damage per round from being submerged in the magma pool that is Xotani’s stomach. A swallowed creature can cut its way out by using a light slashing or piercing weapon to deal 50 points of damage to the gizzard (AC 25). Once the creature exits, muscular action closes the hole; another swallowed opponent must cut its own way out. Xotani’s gullet can hold 2 Huge, 8 Large, 32 Medium, 128 Small, or 512 Tiny or smaller creatures.<br/><br/><b>Trample (Ex)</b> Reflex DC 47 half. The save DC is Strength-based."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "A being of living flame and magma, crawled from the depths of Golarion and the prison of the caged god of destruction, Xotani the Firebleeder is one of the unfathomable monstrosities known and feared as the Spawn of Rovagug. A creature born of rage within the unfathomable depths of the world, it is a creature of pure devastation and hottest flames knowing only wrath, fire, and the harsh stone of the realms below. The surface world is pain to Xotani, especially the cursed sun, from which it retreats by day. By night, however, it bursts from the depths, preceded by sweeping firestorms and deadly claws and followed by a trail like a burnt pyre, all charred ruins and smoking corpses. It is rumored that vast tunnel systems melted into the earth by the passage of the Firebleeder spiderweb the lands of northeastern Garund—the region most devastated by Xotani’s rampages—to modern times, immense subterranean corridors that still burn with the Spawn of Rovagug’s passage.<br/><br/>Like the majority of Rovagug’s ruinous children, Xotani is wrath and devastation given life. It has no desires or intentions beyond destroying all that crosses its path and consuming the ashes. All the life, growth, and creations of the surface worlds are anathema to the living holocaust, which takes some measure of primal satisfaction in crushing the charred remains of such order, yet finds itself endlessly frustrated and incensed by the openness of the surface, the tepid storms and weak rages of weather, and the endless number of wet, hollowing things that fall in its wake. It makes no distinction between the servants of its terrible parent and all the other pathetic things of the lands above, burning and devouring all, caring nothing for whether its living tinder sees its flames as blessing or damnation.<br/><br/>Numerous attempts were made to slay the Firebleeder before its rampage finally came to an end. Through innate cunning and unstoppable profane determination, the titanic abomination survived numerous and varied attempts to lay it low, including potent freezing magics, being magically dropped from an incredible height, and immersion in the Obari Ocean. Yet, despite its seemingly invincible form, Xotani was destroyed by an alliance of potent mages in 2104 ar, who, at the cost of untold lives, ended its rampage across northern Garund in the Brazen Peaks of western Katapesh. The remains of the Firebleeder’s corpse lie in the volcanic caverns beneath the spire known as Pale Mountain—a peak said to take its color from the crushed bones of those who died battling the beast. Yet no terror as relentless as a Spawn of Rovagug ever truly dies, and there are those who would see the flames of Xotani rekindled to scour the dross of the world anew."
        }
    ],
    "html": "<img src=\"images\\ThreeFiveSymbol.gif\" style=\"margin: 3px 3px 0px 3px\"/><i>Like a living volcanic eruption, the sheer massiveness of this titan defies all reason. Monstrously shaped in part like a gigantic, terrible centipede and in part like some primeval, wingless dragon, this living holocaust is completely armored over in plates of angry, obsidian-sharp magma. Two massive claws like insectile scythes sheer before the burning terror as is skitters forth in rapid bursts of motion, leaving only flames and barren earth smoldering in its wake.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Xotani (The Firebleeder)",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 8
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "listen",
                "value": 21
            },
            {
                "type": "stat_block_section",
                "subtype": "spot",
                "value": 21
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "blindsight 120 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "low-light vision"
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Magical Beast",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "fire"
                }
            ],
            "size": "Colossal",
            "alignment": "Chaotic Evil",
            "alignment_text": "CE",
            "family": "Spawn of Rovagug",
            "cr": "20"
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 35,
                "touch": 6,
                "flat-footed": 31,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+4 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+29 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-8 size"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 37
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 31
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 20
                }
            },
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 15,
                    "text": "15/epic",
                    "damage_types": [
                        "epic"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "ability damage"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "energy drain"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "fire"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "disease"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "paralysis"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "poison"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "sleep"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 20,
                    "name": "electricity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 20,
                    "name": "sonic"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 30
            },
            "weaknesses": [
                {
                    "type": "stat_block_section",
                    "subtype": "weakness",
                    "name": "vulnerable to cold"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "weakness",
                    "name": "sunlight blindness"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "60 ft.",
                        "movement_type": "walk",
                        "value": 60
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "burrow 60 ft.",
                        "movement_type": "burrow",
                        "value": 60
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "climb 60 ft.",
                        "movement_type": "climb",
                        "value": 60
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 2,
                    "name": "claws",
                    "bonus": [
                        53
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d8+14"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "4d8",
                            "effect": "fire",
                            "damage_type": "",
                            "damage_type_text": "fire"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "bite",
                    "bonus": [
                        51
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "4d8+7"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "4d8",
                            "effect": "fire",
                            "damage_type": "",
                            "damage_type_text": "fire"
                        }
                    ]
                }
            ],
            "space": "40 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "40 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "breath weapon"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "improved grab"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "swallow whole"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "2d8+21"
                        }
                    ],
                    "name": "trample"
                }
            ],
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 47
            },
            "grapple": {
                "type": "stat_block_section",
                "subtype": "grapple",
                "value": 77
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 38,
            "dex": 19,
            "con": 30,
            "int": 3,
            "wis": 17,
            "cha": 14,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Awesome Blow",
                    "link": {
                        "type": "link",
                        "name": "Awesome Blow",
                        "alt": "Awesome Blow",
                        "href": "FeatDisplay.aspx?ItemName=Awesome%20Blow"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Blind-Fight",
                    "link": {
                        "type": "link",
                        "name": "Blind-Fight",
                        "alt": "Blind-Fight",
                        "href": "FeatDisplay.aspx?ItemName=Blind-Fight"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Cleave",
                    "link": {
                        "type": "link",
                        "name": "Cleave",
                        "alt": "Cleave",
                        "href": "FeatDisplay.aspx?ItemName=Cleave"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Combat Reflexes",
                        "alt": "Combat Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Diehard",
                    "link": {
                        "type": "link",
                        "name": "Diehard",
                        "alt": "Diehard",
                        "href": "FeatDisplay.aspx?ItemName=Diehard"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Endurance",
                    "link": {
                        "type": "link",
                        "name": "Endurance",
                        "alt": "Endurance",
                        "href": "FeatDisplay.aspx?ItemName=Endurance"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Great Cleave",
                    "link": {
                        "type": "link",
                        "name": "Great Cleave",
                        "alt": "Great Cleave",
                        "href": "FeatDisplay.aspx?ItemName=Great%20Cleave"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Great Fortitude",
                    "link": {
                        "type": "link",
                        "name": "Great Fortitude",
                        "alt": "Great Fortitude",
                        "href": "FeatDisplay.aspx?ItemName=Great%20Fortitude"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Bull Rush",
                    "link": {
                        "type": "link",
                        "name": "Improved Bull Rush",
                        "alt": "Improved Bull Rush",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Bull%20Rush"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative",
                    "link": {
                        "type": "link",
                        "name": "Improved Initiative",
                        "alt": "Improved Initiative",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Initiative"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Overrun",
                    "link": {
                        "type": "link",
                        "name": "Improved Overrun",
                        "alt": "Improved Overrun",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Overrun"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Iron Will",
                        "alt": "Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Lightning Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Lightning Reflexes",
                        "alt": "Lightning Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Lightning%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Multiattack",
                    "link": {
                        "type": "link",
                        "name": "Multiattack",
                        "alt": "Multiattack",
                        "href": "FeatDisplay.aspx?ItemName=Multiattack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Power Attack",
                    "link": {
                        "type": "link",
                        "name": "Power Attack",
                        "alt": "Power Attack",
                        "href": "FeatDisplay.aspx?ItemName=Power%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Run",
                    "link": {
                        "type": "link",
                        "name": "Run",
                        "alt": "Run",
                        "href": "FeatDisplay.aspx?ItemName=Run"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Climb",
                        "value": 32
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Listen",
                        "value": 21
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Search",
                        "value": 6
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Spot",
                        "value": 13
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Survival",
                        "value": 21
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+8 Listen"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+8 Spot"
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "firebleed"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "frightful presence"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "heat"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Pathfinder #24: The Final Wish",
            "link": {
                "type": "link",
                "name": "Pathfinder #24: The Final Wish pg. 88",
                "alt": "Pathfinder #24: The Final Wish pg. 88",
                "href": "http://paizo.com/pathfinder/adventurePath/legacyOfFire/v5748btpy89a2"
            },
            "page": 88
        }
    ]
}