{
    "name": "Aphorite",
    "type": "monster",
    "sections": [
        {
            "name": "Description",
            "type": "section",
            "html": "The primary inhabitants of the perfect city of Axis are the race known as axiomites, outsiders born of lawful neutral souls whose primary focus is to serve Axis in one of three ways: the construction and tending of inevitables, the expansion and maintenance of the city itself, and exploring and calculating the laws and constants that underpin all reality in hopes of using this knowledge to bring order to the Great Beyond.<br/><br/> But the axiomites are ill-suited to interactions with mortals. As creatures of pure order, they find it difficult to deal with creatures who have the free will to choose their own destinies and to interpret (or even willfully ignore) laws. Ancient axiomites long pondered a solution to problematic encounters with visitors from the Material Plane. The answer they arrived at was the creation of a new form of life—a melding of their own perfection of order with the unpredictable and fragile bodies and minds of mortal humanoids.<br/><br/> Thus, the first aphorites came to be. Although these women and men were always welcome in Axis, the perfect city was not their true home. Infused with a spark of mortality and the influence of the Material Plane, aphorites were created to serve as diplomats, translators, and envoys between the axiomites and the myriad cultures of the countless Material Plane worlds. As native outsiders, aphorites have free will of their own, and they live and die just as other mortals do. Though akin in many ways to other native outsiders such as aasimars, ganzis, and tieflings, the aphorites differ in that they are not the results of unions between outsiders and mortals. While the original population was forged in Axis by the axiomites, new aphorites are born to aphorite parents. In cases where an aphorite and a humanoid have a child, the offspring is either a newborn aphorite or a member of the humanoid parent’s race. Originally, the aphorites were created with nearly uniform physical appearances, but they have diversified as a result of generations spent on the Material Plane. Today, an aphorite always appears humanoid in form with golden skin that flickers and periodically coruscates with sparkling crystalline dust, and eyes and hair that tend toward metallic hues (with copper, gold, and silver being common colors). Beyond this, they can appear similar to dwarves, elves, and humans, or any other Medium humanoid race. The heritage of the immutable order of Axis has long prevented the formation of aphorites of other sizes, but exceptions have occurred with increasing frequency as each new generation of aphorites is born on the Material Plane.<br/><br/> Aphorites do not exist in large numbers on most Material Plane worlds, and Golarion is no exception. The first aphorites to arrive on Golarion did not seek to establish their own race as a distinct cultural element, but instead to assimilate into established societies to help guide the formation of laws and bolster potential interactions with the citizens of Axis. But as the aphorite race spread, something that the axiomites should have anticipated occurred: as native outsiders with the ability to choose their own destinies, many aphorites became intrigued by the societies they were living in. There are some limits to this acceptance of new societies; aphorites who embrace chaos are considered outcasts and troublemakers by their kin, despite the fact that these aphorites are natural expressions of mortals’ defining characteristics.<br/><br/> Smart and strong, aphorites are as likely to become the focus of attention and admiration as they are the victims of jealousy and hatred. Their ordered and structured personalities often cause strained relations with more capricious or mischievous neighbors and can be a source of conflict with cultures who highly value individual expression of thought, such as that of the elves. Races with stronger tendencies toward law typically build stronger bonds with aphorites. Dwarves in particular enjoy the company of aphorites and find the birth of an aphorite among their own kind a welcome event, as aphorites have an intuitive understanding of the crafting so integral to dwarven society.<br/><br/> While not all aphorites are inherently lawful, most relish structure and order in their lives. Ideas of morality, however, are less clear cut to aphorites. While most can appreciate scholarly studies of the philosophy of good and evil and recognize the differences between them, this divide does not influence them to the same extent that the structure of law versus the disorganized madness of chaos does. Consequently, most aphorites are lawful neutral. Typically, aphorites drawn to theology choose lawful gods as patrons, with the worship of Abadar in particular resonating with their inherent desires and goals of building a perfect society. When an aphorite embraces chaos, other aphorites often treat their wayward kin with a mix of curiosity, horror, and pity. Chaotic aphorites themselves tend to be loners and have little interest in the traditions of their own kind, instead seeking out other societies to join.<br/><br/> Most aphorites, no matter the culture they are raised in, eventually experience a longing to see the world beyond the boundaries of their birthplace. Be it by choice or chance, aphorites seem predisposed to the life of an adventurer. Always seeking to better understand not only the world, but themselves as well, aphorites excel when they are placed in situations where their intellects might shine. Being both cunning of mind and naturally strong, aphorites gravitate toward classes which blend the arts of spellcasting and combat, such as magus or warpriest.<br/><br/> Aphorite names typically reflect the society they are raised in, so an aphorite raised among humans would have a name befitting a human child, while an aphorite raised by dwarves would have a name drawn from dwarven heritage."
        }
    ],
    "html": "<i>The shimmering flesh of this gold-skinned figure flashes with points of light that seem, at times, to create strange runic shapes.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Aphorite",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": -1
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 2
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Outsider",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "native"
                }
            ],
            "size": "Medium",
            "alignment": "Lawful Neutral",
            "alignment_text": "LN",
            "cr": "1/2",
            "xp": 200,
            "grafts": [
                {
                    "type": "stat_block_section",
                    "subtype": "graft",
                    "name": "Aphorite"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "graft",
                    "name": "fighter 1"
                }
            ]
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 13,
                "touch": 9,
                "flat-footed": 13,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+4 armor"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-1 Dex"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 4
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": -1
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 3,
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "+2 vs. poison and mind-affecting effects"
                        }
                    ]
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "crystalline dust"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 5,
                    "name": "electricity"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "cold iron warhammer",
                    "bonus": [
                        5
                    ],
                    "critical_range": "×3",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d8+3"
                        }
                    ]
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Spell-Like Abilities",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "protection from chaos"
                                    }
                                ],
                                "count_text": "1/day",
                                "count": 1,
                                "frequency": "day"
                            }
                        ],
                        "caster_level": 1,
                        "concentration": 0
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 1
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "value": 4
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "value": 13
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 17,
            "dex": 8,
            "con": 14,
            "int": 14,
            "wis": 13,
            "cha": 8,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Iron Will",
                        "alt": "Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "warhammer"
                        }
                    ],
                    "name": "Weapon Focus",
                    "link": {
                        "type": "link",
                        "name": "Weapon Focus (warhammer)",
                        "alt": "Weapon Focus (warhammer)",
                        "href": "FeatDisplay.aspx?ItemName=Weapon%20Focus"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Craft (armor)",
                        "value": 8
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (engineering)",
                        "value": 6
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (planes)",
                        "value": 3
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 2
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+2 Craft (armor)"
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Celestial"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    }
                ]
            }
        },
        "ecology": {
            "name": "Ecology",
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "any (Axis)",
            "organization": "solitary or guild (2–12)",
            "treasure": "NPC gear (chain shirt, warhammer, other treasure)"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "name": "Crystalline Dust",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su",
                "text": "An aphorite can manifest a haze of crystalline dust that forms into indistinct runes and glyphs surrounding its body. This effect grants the aphorite a 20% miss chance against melee and ranged attacks. Activating this dust is a move action, but it can be maintained each round as a free action. The effect cannot be disrupted, but it ends immediately if the aphorite is killed, paralyzed, stunned, knocked unconscious, or otherwise prevented from taking a free action to maintain it each round. An aphorite can use this ability a number of rounds per day equal to its Hit Dice, but the rounds do not need to be consecutive."
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Planar Adventures",
            "link": {
                "type": "link",
                "name": "Planar Adventures pg. 224",
                "alt": "Planar Adventures pg. 224",
                "href": "http://paizo.com/products/btpya1am"
            },
            "page": 224
        }
    ]
}