{
    "name": "Duskwalker",
    "type": "monster",
    "sections": [
        {
            "name": "Description",
            "type": "section",
            "html": "Duskwalkers are tall, bipedal, gray-skinned beings with a connection to Pharasma’s Boneyard. They manifest directly on the Material Plane, incarnating from souls that have earned the honor of a second life. The souls that become duskwalkers have often distinguished themselves in the eyes of psychopomps as guardians of the cycle of birth and death. Other than their gray skin, their physical features bear some resemblance to those they held in their previous lives. As such, a typical duskwalker looks mostly human, other than her unusual coloration. However, duskwalkers whose ancestors belonged to other races can manifest with characteristic features such as pointed ears, hairy feet, or even feathers, horns, scales, or tails—though they rarely manifest smaller or larger than Medium.<br/><br/> The first duskwalkers appeared as the result of a bargain between two powerful psychopomps: an olethros mother and a yamaraj. The olethros mother made the case to allow certain souls whose actions helped preserve and protect the cycle of souls, but whose lives had been cut short of what fate had decreed for them to reincarnate once before passing to their final judgment. After a long debate, the yamaraj agreed but imposed a strict limit on the number of duskwalkers that can exist at one time. Whenever this limit has been reached, dead duskwalkers cannot be restored to life. Most duskwalkers accept this limitation and appreciate that the end of their lives opens the door for new lives to begin. Some request that those mourning their deaths also celebrate the birth of a new duskwalker in the near future. The length of time it takes for a new duskwalker to be born when one dies varies, but is rarely more than a year.<br/><br/> When a duskwalker is born, she appears spontaneously in a sanctified place with a connection to death, most often a graveyard or a temple. Duskwalkers do not experience infancy, instead beginning their lives with the appearance and facilities of a roughly 8-year-old human child. These mysterious children always appear cloaked in simple white robes, with a small satchel of food and water by their sides. Duskwalker children mature at a variable rate depending upon the support they receive. A child adopted into a nurturing family or taken into care at a temple matures at a rate similar to that of a human child and develops a healthy balance between her appreciation for life and her interest in death. While duskwalker children almost always appear near settlements, the unusual circumstances of their creation sometimes lead them to be ostracized to the point where they are forced to fend for themselves. Duskwalker children who endure such circumstances reach physical and intellectual maturity rapidly, but they struggle socially and emotionally.<br/><br/> Duskwalker naming conventions are varied. Many duskwalkers prefer to select their own names shortly after they manifest. Duskwalkers who have a good relationship with their surrounding community choose names that follow that community’s traditions. Isolated duskwalkers make up their own conventions, naming themselves after their accomplishments or values or even just selecting a string of syllables that sounds nice to them.<br/><br/> The role of duskwalkers has changed somewhat since the beginning of the Age of Lost Omens, when prophecy failed. Prior to that time, only souls that were destined to perform roles that would serve the Boneyard’s interests would be reincarnated as duskwalkers. With prophecy in disarray, however, duskwalkers began to shape their own fates. Some duskwalkers receive occasional visitations or messages from psychopomps, intended to steer them toward certain tasks, but they are under no obligation to follow this guidance. Still, because of their origins, most duskwalkers have an innate respect for the cycles of birth and death. They tend to gravitate toward positions and occupations that allow them to protect this cycle, such as hunters of the undead, midwives, morticians, and priests.<br/><br/> Because duskwalkers are so rare, the few duskwalker communities that exist are small and form mostly among individuals united by a common goal, such as adventuring bands of undead-hunters. Many duskwalkers go their entire lives without meeting another member of their race. Instead, they usually live among whichever races are most common near the graveyards in which they manifested. Duskwalkers meet with mixed reactions from human communities. Some people look askance at their ashen appearance and the manner of their creation. Others find the way in which duskwalkers relate to death unsettling. Duskwalkers struggle to understand the fear and hesitance with which most other races speak of death, and even cheerful duskwalkers tend toward dark and morbid senses of humor. However, other communities value or even revere duskwalkers for their wisdom, skill at medicine, and proficiency at fighting undead. Duskwalkers get along particularly well with members of other races that share a planar heritage, such as aasimars, aphorites, ganzis, and tieflings, but they share a mutual distrust with dhampirs.<br/><br/> Despite the prejudices they sometimes face, duskwalkers are typically companionable, open-minded, and accepting of people. They seek friendships and romantic relationships with others of many different races. Many duskwalkers seek to build a family with children at some point in their lives. They grow their families by adopting children from their communities, with a particular preference toward children that other prospective parents may look over. Most have no interest in sexual relationships, though, and no duskwalker is capable of bearing or siring biological children.<br/><br/> Duskwalkers are typically neutral in their alignment, like psychopomps themselves. Those who are not neutrally aligned tend toward good alignments over evil ones. Pharasma is the most popular deity among duskwalkers, but Sarenrae and the empyreal lord Ashava also command sizable followings. Members of a growing contingent of evil duskwalkers have been rejecting their inborn nature entirely, throwing in their lot with the sahkils, who delight in such perversion. These duskwalkers can lose the abilities that help them combat undead and gain powers better suited to inflicting fear, but such choices also have a chance of altering their ward against corruption in a particularly unsettling way. Such duskwalkers inevitably find that not only can they become undead, but that their deaths all but guarantee some form of unnatural unlife after death, often coming back as a ghost without such an entity’s classic inability to travel far from the place of its death."
        }
    ],
    "html": "<i>This tall, gray-skinned woman’s eyes flicker with determination. Her somber attire is decorated with small bones.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Duskwalker",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 3
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 6
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Outsider",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "native"
                }
            ],
            "size": "Medium",
            "alignment": "Neutral",
            "alignment_text": "N",
            "cr": "1/2",
            "xp": 200,
            "grafts": [
                {
                    "type": "stat_block_section",
                    "subtype": "graft",
                    "name": "Female"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "graft",
                    "name": "duskwalker"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "graft",
                    "name": "ranger 1"
                }
            ]
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 15,
                "touch": 13,
                "flat-footed": 12,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+2 armor"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+3 Dex"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 3
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 5
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 2,
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "+2 vs. negative energy and death effects"
                        }
                    ]
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "ward against corruption"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "dagger",
                    "bonus": [
                        2
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4+1"
                        }
                    ]
                }
            ],
            "ranged": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "ranged",
                    "name": "composite longbow",
                    "bonus": [
                        4
                    ],
                    "critical_range": "×3",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d8+1"
                        }
                    ]
                }
            ],
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "undead +2"
                        }
                    ],
                    "name": "favored enemy"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "ghost hunter"
                }
            ],
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 1
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "value": 2
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "value": 15
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 13,
            "dex": 17,
            "con": 12,
            "int": 10,
            "wis": 14,
            "cha": 8,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Point-Blank Shot",
                    "link": {
                        "type": "link",
                        "name": "Point-Blank Shot",
                        "alt": "Point-Blank Shot",
                        "href": "FeatDisplay.aspx?ItemName=Point-Blank%20Shot"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Acrobatics",
                        "value": 4
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Heal",
                        "value": 8
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (nature)",
                        "value": 4
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (religion)",
                        "value": 3
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 6
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Survival",
                        "value": 6
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+2 Heal"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+2 Knowledge (religion)"
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Celestial"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "track +1"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "wild empathy +0"
                }
            ]
        },
        "ecology": {
            "name": "Ecology",
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "any",
            "organization": "solitary, pair, or team (3–6)",
            "treasure": "NPC gear (composite longbow with 20 arrows, leather armor, dagger, other treasure)"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "name": "Ghost Hunter",
                "ability_type": "Supernatural",
                "ability_type_abbrev": "Su",
                "text": "In a duskwalker’s hands, any weapon can strike true against spectral beings. A duskwalker’s nonmagical weapons deal half damage to incorporeal creatures, as if they were magic weapons, and her magic weapons can deal critical hits and precision damage, even if they do not have the ghost touch property. Once per day as a standard action, a duskwalker can focus her natural revulsion toward undead. If she does so, she treats all weapons she wields as if they had the ghost touch property for 1 minute."
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "name": "Ward against Corruption",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex",
                "text": "Duskwalkers gain a +2 racial bonus on saving throws against negative energy and death effects, as well as the spell-like and supernatural abilities of undead and sahkils. They are immune to all abilities that would transform their bodies or souls into undead."
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Planar Adventures",
            "link": {
                "type": "link",
                "name": "Planar Adventures pg. 230",
                "alt": "Planar Adventures pg. 230",
                "href": "http://paizo.com/products/btpya1am"
            },
            "page": 230
        }
    ]
}