{
    "name": "Ganzi",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any (Maelstrom)<br/><b>Organization</b> solitary, pair, or band (3–12)<br/><b>Treasure</b> NPC gear (leather armor, light steel shield, dagger, other treasure)"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Ganzi Oddity</b> As creatures infused with the entropic forces of the Maelstrom, all ganzis have a distinct and unusual oddity that manifests as a physical or magical ability that sets the ganzi apart. Typically, a ganzi’s oddity is chosen from the most common manifestations of entropy listed below, but other, more unique oddities can certainly exist. The numbers listed for each option can be used to randomly determine what form of ganzi oddity a particular Ganzi might have, at the GM’s option, but the quibble ability is the most common.<br/><br/><b>1–2: Chaos Champion (Su)</b> Ganzis with a lineage linked to the einherji often become crusaders for the forces of entropy and excel in combat against lawful beings. The ganzi can smite law once per day as a swift action, targeting a lawful foe. She adds her Charisma modifier as a bonus on attack rolls and gains a bonus on damage rolls equal to her Hit Dice. Once activated, smite law persists until the target is dead or the ganzi rests, whichever comes first.<br/><br/><b>3–4: Entropic Flesh (Ex)</b> Ganzis with lineages that link strongly to chaos beasts retain some of their ancestors’ immunity to transformation. In addition to gaining a +2 bonus on Escape Artist checks and to CMD against grapple combat maneuvers, when such ganzis are affected by a hostile transmutation effect (such as polymorphing or petrification), they can attempt a new saving throw at the start of their next turn to end the effect. They gain a +4 bonus on this second saving throw, but if they fail, the transmutation effect persists as long as it normally would.<br/><br/><b>5–6: Prehensile Tail (Ex)</b> Ganzis with lineages that are particularly influenced by the presence of proteans often have colorful feathers, scales, or skin, and a long serpentine tail. This tail can be used to carry items. While ganzis with this oddity cannot wield weapons with their tails, they can use their tails to retrieve small, stowed objects carried on their persons as a swift action.<br/><br/><b>7–14: Quibble (Su)</b> For most ganzis, the influence of chaos is relatively subtle and manifests as an ability to infect others with entropy and unexpected luck (be it good luck or bad). Once per day as an immediate action, a ganzi can twist probability and alter the luck of a single creature within 20 feet, forcing it to reroll a single d20 roll it has just made. The target must take the second result, even if it is worse. A ganzi can use this ability after the target has rolled but must use it before the GM declares whether the roll was a success or failure. Unwilling creatures can resist a ganzi’s quibble with a successful Will save (DC = 10 + half the ganzi’s level + the ganzi’s Charisma modifier). This is a curse effect.<br/><br/><b>15–18: Spell-Like Ability (Sp)</b> Ganzis whose chaotic influences rise from regions other than the Maelstrom or its inhabitants often manifest an oddity that duplicates the effects of a specific spell. Such ganzis gain one of the following spelllike abilities, usable once per day at a caster level equal to the ganzi’s HD: <i>alter self</i>, <i>blur</i>, <i>detect thoughts</i>, <i>hideous laughter</i>, <i>minor image</i>, <i>shatter</i>, or <i>spider climb</i>.<br/><br/><b>19–20: Weaponplay (Ex) </b>Ganzis with lineages that link to the valkyries manifest their heritage in their skill in combat. Such ganzis are always proficient with all simple and martial weapons, and they can qualify for feats normally available only to fighters (such as Weapon Specialization) even if they don’t have any fighter class levels."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Ganzis are the end result of planar chaos touching living creatures. Where the planes brush against the Material Plane or where chaotic inhabitants (be they chaos beasts, proteans, valkyries, or others) affect or influence mortal life, ganzis are born in their wake like ripples in a pond.<br/><br/> While ganzis are superficially human in appearance, they often have features that set them apart from the rest of humanity. These features can vary widely; one ganzi might have a discolored hand that flickers with entropic (but harmless) energy, while another might have brightly colored scales covering her shoulders and back, and yet another might have horns and glowing green eyes. Likewise, ganzi height and weight can vary dramatically, even by human standards, but the average ganzi stands between 5 and 6 feet tall and weighs anywhere from 100 to 300 pounds.<br/><br/> Many ganzis are mistaken for aasimars or tieflings at birth, but in truth ganzi births very rarely result from mortals mingling with outsiders. The vast majority are born after one or both parents were exposed to a force of chaotic or entropic energy. As such, the circumstances of a ganzi’s childhood can vary dramatically and depend on the parents’ tolerance for the unexpected. A ganzi’s tendency towards chaos exacerbates this, with many ganzis developing gregarious, iconoclastic, or thrill-seeking reputations among their peers. A sizable minority of ganzis appear completely human early in life, their anarchic heritage manifesting shortly after puberty in a chaotic—and traumatic—spasm of rapid evolution. While ganzis are most commonly of human stock, it is not unknown for ganzis to be born among other races. These ganzis bear superficial signs of their nonhuman heritage, but their statistics and abilities are identical to those born to humans.<br/><br/> Like other native outsiders of humanoid heritage, ganzis are found most often scattered amidst the societies of their parent races. The rare ganzis who choose not to wander may live their entire lives without meeting another of their kind. Due to their scattered pattern of birth and their tendency towards wandering lifestyles, ganzis rarely congregate in significant numbers and almost never form cultures of their own. On occasion, a Material Plane society in a region with links to other planes will produce enough ganzis over time for them to form their own subculture, but such societies are rare indeed.<br/><br/> Given their relationship to the Cerulean Void and its natives, it is not uncommon for ganzis with awareness of their heritage and the resources for planar travel to journey to the Maelstrom. Some ganzis make this pilgrimage to seek out proteans, valkyries, or other natives of the Maelstrom in hopes of understanding their own place in the cosmos, while others are drawn to the idea of communing with the vast and potent force of primordial chaos itself.<br/><br/> As befits their chaotic origin, the personality and outlook of individual ganzis can vary significantly. Often chaotic-aligned, with no particular tendency towards good or evil, many find themselves drawn to the life of the wandering adventurer. Ganzis are commonly possessed of deep curiosity and powerful creative talent, leading many to become artists or bards, while others enjoy the alchemist’s dichotomous mastery of creation and destruction. Sorcerous talents and oracular mysteries of all varieties are unsurprisingly common among ganzis."
        }
    ],
    "html": "<i>This dark-skinned woman moves with grace and confidence, but her vibrant eyes hold a hint of unpredictable wildness.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Ganzi",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 1
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 3
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Outsider",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "native"
                }
            ],
            "size": "Medium",
            "alignment": "Chaotic Neutral",
            "alignment_text": "CN",
            "cr": "1/2",
            "xp": 200,
            "grafts": [
                {
                    "type": "stat_block_section",
                    "subtype": "graft",
                    "name": "Female"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "graft",
                    "name": "ganzi"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "graft",
                    "name": "bard 1"
                }
            ]
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 14,
                "touch": 11,
                "flat-footed": 13,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+2 armor"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+1 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+1 shield"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 3
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 3
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 1,
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "+2 vs. polymorph effects"
                        }
                    ]
                }
            },
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 5,
                    "name": "acid"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 5,
                    "name": "electricity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 5,
                    "name": "sonic"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "dagger",
                    "bonus": [
                        0
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4"
                        }
                    ]
                }
            ],
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "countersong"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "distraction"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "fascinate [DC 13]"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "inspire courage +1"
                        }
                    ],
                    "name": "bardic performance 7 rounds/day"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "quibble"
                        }
                    ],
                    "name": "ganzi oddity"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Bard Spells Known",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "cure light wounds"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "grease",
                                        "spell_dc": 14
                                    }
                                ],
                                "level_text": "1st",
                                "level": 1,
                                "count_text": "2/day",
                                "count": 2,
                                "frequency": "day"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "daze",
                                        "spell_dc": 13
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "ghost sound",
                                        "spell_dc": 13
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "mage hand"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "prestidigitation"
                                    }
                                ],
                                "level_text": "0",
                                "level": 0,
                                "count_text": "at will",
                                "frequency": "at will"
                            }
                        ],
                        "caster_level": 1,
                        "concentration": 4
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 0
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "value": 0
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "value": 11
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 10,
            "dex": 13,
            "con": 16,
            "int": 10,
            "wis": 8,
            "cha": 17,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Arcane Strike",
                    "link": {
                        "type": "link",
                        "name": "Arcane Strike",
                        "alt": "Arcane Strike",
                        "href": "FeatDisplay.aspx?ItemName=Arcane%20Strike"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Acrobatics",
                        "value": 4
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Diplomacy",
                        "value": 7
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 3
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perform (act)",
                        "value": 7
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Sense Motive",
                        "value": 5
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Spellcraft",
                        "value": 4
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Survival",
                        "value": 1
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+2 Sense Motive"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+2 Survival"
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Protean"
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "bardic knowledge +1"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Planar Adventures",
            "link": {
                "type": "link",
                "name": "Planar Adventures pg. 234",
                "alt": "Planar Adventures pg. 234",
                "href": "http://paizo.com/products/btpya1am"
            },
            "page": 234
        }
    ]
}