{
    "name": "Champion Automaton",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any (Axis)<br/><b>Organization</b> solitary or pair<br/><b>Treasure</b> none"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Arcane Pincers (Ex)</b> A champion automaton’s pincers function as claw attacks but have been magically treated to make them more powerful. A champion applies twice its Strength as a bonus on damage rolls with its pincers. If a champion automaton grabs a creature smaller than itself with a pincer, the champion automaton does not gain the grappled condition and can move normally while holding the creature in its pincer. While holding a creature in a pincer, the champion automaton loses access to that pincer attack and gains an additional slam attack. If the champion automaton uses this slam attack against a creature or object while a creature is held in its pincer, the held creature takes damage equal to the slam attack on a hit. The champion automaton must still maintain the grapple every round, but it can do so as a free action. The grappled creature can attempt to break free as normal. <br/><br/><b>Energy Beam (Ex)</b> A champion automaton can focus the energy in its core to emit either a 60-foot line or a 30-foot cone as a standard action. The beam deals 8d6 points of damage to each creature caught in the area (Reflex DC 20 half). Half of the damage dealt is fire damage and half is force damage. A champion automaton can use its energy beam once every 1d4 rounds. A champion automaton can use its energy beam when it is grappling or being grappled. The save DC is Charisma-based. <br/><br/><b>Warrior’s Resolve (Ex)</b> The innate determination and instinct in a champion automaton’s core grants it an insight bonus to AC equal to its Wisdom bonus (if any). Additionally, this resolve grants the champion a number of bonus hit points per Hit Die equal to its Wisdom bonus (if any)."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Of all the warriors of the Artificer Conclave, champion automatons are the best suited for combat. Before the empire’s collapse, champion automatons served on the front lines of the Jistka Imperium’s armies, facing the empire’s foes head-on. Although champion automatons were not invincible, most who encountered one, let alone a battalion of them, were quick to face defeat.<br/><br/> Champion automatons are enormous constructs typically made from a combination of magically treated stone and metal, which allows them to withstand the powerful blows typically encountered in battle. Although these bodies are extremely heavy, the magical energies that power them allow the automatons to move as quickly as most other combatants, if not faster. A typical champion automaton is 14 feet tall and weighs 2 tons, though the Artificer Conclave created some bigger champion automatons to take on the largest enemy genies, with some reaching as much as 40 feet in height.<br/><br/> The most notable features of a champion automaton are its enormous pincers. The durability of its body and the magical ritual that reinforces the pincers’ structure allows a champion automaton to swing its pincer with tremendous force. In combat, these constructs use the pincers to clamp onto particularly pesky enemies. Once a champion has successfully grabbed an enemy, it remains free to keep swinging its pincer, slamming its captive foe into other enemies to damage both creatures.<br/><br/> The other devastating weapon of a champion automaton is the <i>automaton core</i> itself. The potent core constantly collects planar energy at an impressive rate in order to power the large constructs. A champion automaton can focus excess energy into a deadly beam of force capable of destroying structures or slaying large numbers of foes. Although it takes some time to recharge its energy reserves between blasts, a champion remains formidable. The champion automaton’s energy beam is not the only type of energy weapon the Conclave created, but it quickly became the standard across the majority of automatons.<br/><br/> The Artificer Conclave chose all manner of Jistkan warriors to serve as their champions, from lowly foot soldiers up to the most decorated generals. The bodies of the champion automatons more than made up for a lack in combat prowess, and warriors of great skill found that their new bodies greatly improved their innate abilities, allowing them to make the most of these new construct forms. Of note were the twin champions Kifir and Orla, whose specialized frames allowed them to join together and share their combat instincts to create a fury never before seen on the battlefield. This fury was lost to time, however, as the pair mysteriously vanished after an Osirian ambush.<br/><br/> Many champion automatons abandoned their posts once the Jistka Imperium’s demise was a certainty. Those who remained eventually faced destruction on the battlefield. The rest sought other fights, traveling to the far corners of Golarion—an effort that continues to this day. Historical footnotes mention terrifying constructs jumping into great battles, seemingly without an agenda. These mysterious constructs would fight against whichever side seemed strongest, only to depart as quickly as they arrived once they appeared satisfied with the outcome of the battle. Even today, these champion automatons show up in areas such as the Worldwound, the furthest depths of the Darklands, Iscadero Island in Arcadia, and the Valashmai Jungle in Tian Xia.<br/><br/> Of the champion automatons that left Golarion, most now reside in the city of Axis, finding satisfaction in their existence and taking on more subdued lives in the planar city when not seeking battle on the planes. Occasionally, these automatons join inevitables in their missions, serving as additional muscle when the outsiders need assistance but wish to avoid pulling other inevitables away from their duties. Champion and stalker automatons frequently cross paths in Axis, as their <i>automaton cores</i> have a tendency to subtly pull towards each other, and they often meet up to spar or trade old tales of battles long forgotten by history. One group of champions and stalkers unites once a decade to host a simple tournament on the outskirts of Axis. The tournament invites all combatants within the city to test their prowess against the automatons, with the winner awarded the title of a lost Jistkan hero."
        }
    ],
    "html": "<i>This large construct has arms that end in massive pincers, and the core in the center of its head glows with an unrivaled ferocity.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Champion Automaton",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 2
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 19
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 120 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "low-light vision"
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "see invisibility"
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Construct",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "automaton"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "extraplanar"
                }
            ],
            "size": "Large",
            "alignment": "Lawful Neutral",
            "alignment_text": "LN",
            "family": "Automaton",
            "cr": "10",
            "xp": 9600
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 24,
                "touch": 14,
                "flat-footed": 22,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+2 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+2 insight"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+10 natural"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 4
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 6
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 6
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "warrior's resolve"
                }
            ],
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 10,
                    "text": "10/adamantine",
                    "damage_types": [
                        "adamantine"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "construct traits"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "electricity"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "cold"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "sonic"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 21
            },
            "weaknesses": [
                {
                    "type": "stat_block_section",
                    "subtype": "weakness",
                    "name": "vulnerable mind"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "40 ft.",
                        "movement_type": "walk",
                        "value": 40
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "climb 30 ft.",
                        "movement_type": "climb",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 2,
                    "name": "arcane pincers",
                    "bonus": [
                        18
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d6+12"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "grab"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "slam",
                    "bonus": [
                        18
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d8+6"
                        }
                    ]
                }
            ],
            "space": "10 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "10 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "60-ft. line or 30-ft. cone"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "DC 18"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "8d6"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "usable every 1d4 rounds"
                        }
                    ],
                    "name": "energy beam"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Spell-Like Abilities",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "see invisibility"
                                    }
                                ],
                                "count_text": "Constant",
                                "frequency": "Constant"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "force hook charge"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "shatter",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 16",
                                            "dc": 16
                                        }
                                    }
                                ],
                                "count_text": "At will",
                                "frequency": "At will"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "fly"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "mirror image"
                                    }
                                ],
                                "count_text": "3/day",
                                "count": 3,
                                "frequency": "day"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "haste"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "plane shift",
                                        "modifiers": [
                                            {
                                                "type": "stat_block_section",
                                                "subtype": "modifier",
                                                "name": "self plus 50 lbs. of objects only"
                                            }
                                        ]
                                    }
                                ],
                                "count_text": "1/day",
                                "count": 1,
                                "frequency": "day"
                            }
                        ],
                        "caster_level": 13,
                        "concentration": 17
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 13
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+22 bull rush"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "sunder"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+24 grapple"
                    }
                ],
                "value": 20
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "34 vs. bull rush or sunder"
                    }
                ],
                "value": 32
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 22,
            "dex": 15,
            "con": null,
            "int": 14,
            "wis": 15,
            "cha": 18,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Cleave",
                    "link": {
                        "type": "link",
                        "name": "Cleave",
                        "alt": "Cleave",
                        "href": "FeatDisplay.aspx?ItemName=Cleave"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Combat Reflexes",
                        "alt": "Combat Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Great Cleave",
                    "link": {
                        "type": "link",
                        "name": "Great Cleave",
                        "alt": "Great Cleave",
                        "href": "FeatDisplay.aspx?ItemName=Great%20Cleave"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Bull Rush",
                    "link": {
                        "type": "link",
                        "name": "Improved Bull Rush",
                        "alt": "Improved Bull Rush",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Bull%20Rush"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Sunder",
                    "link": {
                        "type": "link",
                        "name": "Improved Sunder",
                        "alt": "Improved Sunder",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Sunder"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Power Attack",
                    "link": {
                        "type": "link",
                        "name": "Power Attack",
                        "alt": "Power Attack",
                        "href": "FeatDisplay.aspx?ItemName=Power%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Vital Strike",
                    "link": {
                        "type": "link",
                        "name": "Vital Strike",
                        "alt": "Vital Strike",
                        "href": "FeatDisplay.aspx?ItemName=Vital%20Strike"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Climb",
                        "value": 31
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Diplomacy",
                        "value": 21
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Intimidate",
                        "value": 21
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 19
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Sense Motive",
                        "value": 19
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Swim",
                        "value": 23
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    }
                ],
                "communication_abilities": [
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "telepathy",
                        "range": {
                            "type": "stat_block_section",
                            "subtype": "range",
                            "text": "100 ft.",
                            "range": 100,
                            "unit": "feet"
                        }
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "automaton core"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "intelligent construct"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Construct Handbook",
            "link": {
                "type": "link",
                "name": "Construct Handbook pg. 22",
                "alt": "Construct Handbook pg. 22",
                "href": "https://paizo.com/products/btq01vam"
            },
            "page": 22
        }
    ]
}