{
    "name": "Agnoia",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any (Outer Planes)<br/><b>Organization</b> solitary, pair, or forgetting (3–8)<br/><b>Treasure</b> none"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Aura of Ignorance (Su)</b> Creatures other than aeons that attempt Knowledge checks within 30 feet of an agnoia automatically fail. An agnoia can suppress or resume its aura of ignorance as a swift action.<br/><b>Forgotten One (Su)</b> A creature under the effects of an agnoia’s feeblemind cannot be the target of divination spells, including discern location or legend lore. In addition, memory of the target is dulled in all creatures other than aeons; the target cannot be considered an ally of any creature. Most creatures forget about the target once it is out of sight, although friends and family members might retain memories for longer based on the strength of their feelings for the target.<br/><b>Glance of Understanding (Su)</b> An agnoia knows the weaknesses of any creature it sees, as though it had succeeded at a Knowledge check to identify the creature’s weaknesses with a result of a natural 20.<br/><b>Lore Minder (Ex)</b> An agnoia treats all Knowledge skills as class skills and can attempt Knowledge checks untrained, even if the DC is higher than 10."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Agnoias are not yet deemed outcasts by the ranks of aeonkind, but they teeter on the edge of exile from the ranks of the caretakers of reality. Like all aeons, agnoias work to maintain a precarious cosmic balance—in their case, this balance is between the dissemination of knowledge and the preservation of ignorance. Although these aeons once worked to keep this balance in careful check by distributing truths across planetary and planar gulfs and obliterating dangerous truths from mortal minds, agnoias collectively decided several years ago that the sum total of knowledge in the multiverse had reached dangerous heights. Creation had become too well informed to sustain redoubts of ignorance for long, and the balance agnoias worked to maintain was in danger. As a group, the agnoias agreed that they would wholly forsake their duties regarding the spread of learning and instead focus on fostering ignorance, returning the multiverse to a safely unenlightened level. Agnoias connected to universities and libraries turned on their associates, setting controlled fires and transporting scholars to isolated wildernesses. This rapid change in direction, nearly unprecedented by aeon standards, caused most other aeons to mark agnoias as reckless and dangerous.<br/><br/> Agnoias see this change as absolutely vital to the performance of their overall function as arbiters of knowledge and ignorance. In fact, some agnoias express frustration that the drive to obliterate universal knowledge wasn’t initiated much sooner, when knowledge was more centralized in nascent civilizations and therefore easier to manage. No agnoia would dare to blame the Monad directly for this error in intellectual administration, as they see it, but most agnoias express some satisfaction for finally being able to act as they deem fit rather than remaining shackled to a higher power.<br/><br/> Agnoias have a particular dislike for mortal explorers and planar travelers. As mortals learn to travel quickly across their worlds and between the planes, they spread their knowledge like a plague, disrupting nascent civilizations and exposing long-sequestered secrets. Such travelers are agnoias’ most frequent targets, as these aeons consider them vectors for spreading the disease of enlightenment. Agnoias work to close planar gates and sabotage transport vessels, first seeking to control the transmission of knowledge and then working to eradicate it. Although they have little concern for mortal lives that might be lost in a sinking ship or a burning library, they aren’t cruel and usually time their actions to minimize the loss of innocent—and particularly ignorant—life. Agnoias often work alone, but this is primarily because they view their tasks as urgent and their numbers are very few. When given the opportunity to work together, agnoias operate in eerie concert, each seeming to predict the actions of the others with automatic prescience.<br/><br/> Agnoias don’t apply their recent knowledgeobliterating directive to their own kind. Many agnoias in fact hoard knowledge, and they are surprisingly well informed on a broad variety of topics. Most have labored for years in academies or universities, absorbing minutiae on particular specialties and adding this information to their vast mental storehouses. Getting an agnoia to part with its knowledge is all but impossible, however, as each knows that any information might start yet another cascade of erudition it must later extinguish.<br/><br/> In combat, agnoias prefer to reduce their enemies’ intellects as quickly as possible. Their preferred tactic is to afflict their most intelligent opponents with feeblemind, which agnoias augment by removing targets’ memories not only from the targets’ own minds, but also from the consciousness of reality. Victims of this attack have their intellects reduced, and their effect upon the cosmic network of knowledge is dulled—people once familiar with a victim find their recollections clouding over, and any intellectual influence a victim may have had (such as authored works, public lectures, or tales of daring exploits) is removed. This effect even extends to printed works; a shelf of books authored by a victim transforms into paper covered with incomprehensible marks, unable to convey meaning or knowledge. Although this power is permanent, it is reversible, unfortunately for the agnoias. If a victim’s intellect is restored, so too are her works and the memories of her.<br/><br/> Agnoias are keen observers; their eyes drift around their bodies and switch from one side to another with a mere blink. They are particularly difficult to surprise, and their keen vision allows them to detect even magical auras with ease. Agnoias are also apt judges of character and have several lifetimes of experience interacting with mortals. As a result, they can predict actions and motivations with shrewd consideration that is as much a factor of their experience as it is their magical ability to detect creatures’ thoughts.<br/><br/> Agnoias appear as columns of fog and shadow. Within their roiling forms, the shadows never obscure the fog and the fog never conceals the dark shadow. Although an agnoia can walk on the three clawed feet protruding from the bottom of its column, it can just as easily fly with a thought. An agnoia’s three claws are spread radially around its torso. Despite their vaporous appearance, agnoias aren’t insubstantial, but they can compress their forms to fit into small spaces.<br/><br/> A typical agnoia is 16 feet tall and weighs 900 pounds."
        }
    ],
    "html": "<i>This cylindrical creature of pale fog and dark shadow stands on three clawed feet. Three pale arms jut from around the column, each ending in a hand with long, black claws.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Agnoia",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 8
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 25
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "detect magic"
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "detect thoughts"
            }
        ],
        "auras": [
            {
                "type": "stat_block_section",
                "subtype": "aura",
                "name": "ignorance",
                "range": {
                    "type": "stat_block_section",
                    "subtype": "range",
                    "text": "30 ft.",
                    "range": 30,
                    "unit": "feet"
                }
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Outsider",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "aeon"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "extraplanar"
                }
            ],
            "size": "Large",
            "alignment": "Neutral",
            "alignment_text": "N",
            "family": "Aeon",
            "cr": "14",
            "xp": 38400
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 29,
                "touch": 17,
                "flat-footed": 25,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+4 deflection"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+4 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+12 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-1 size"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 14
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 14
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 18
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "all-around vision"
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "cold"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "critical hits"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "poison"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "electricity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "fire"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 25
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "good<br/>"
                            }
                        ],
                        "name": "fly 40 ft.",
                        "movement_type": "fly",
                        "value": 40
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 3,
                    "name": "claws",
                    "bonus": [
                        23
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d6+8"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "bleed"
                        }
                    ]
                }
            ],
            "space": "10 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "10 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "1d3 Int damage"
                        }
                    ],
                    "name": "bleed"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "forgotten one"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Spell-Like Abilities",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "detect magic"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "detect thoughts"
                                    }
                                ],
                                "count_text": "Constant",
                                "frequency": "Constant"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "modify memory",
                                        "spell_dc": 19
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "touch of idiocy"
                                    }
                                ],
                                "count_text": "At will",
                                "frequency": "At will"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "feeblemind",
                                        "spell_dc": 20
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "metamagic": "quickened",
                                        "name": "touch of idiocy"
                                    }
                                ],
                                "count_text": "3/day",
                                "count": 3,
                                "frequency": "day"
                            }
                        ],
                        "caster_level": 16,
                        "concentration": 21
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 16
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "value": 25
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "45 vs. trip"
                    }
                ],
                "value": 43
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 26,
            "dex": 19,
            "con": 24,
            "int": 25,
            "wis": 22,
            "cha": 21,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Casting",
                    "link": {
                        "type": "link",
                        "name": "Combat Casting",
                        "alt": "Combat Casting",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Casting"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Expertise",
                    "link": {
                        "type": "link",
                        "name": "Combat Expertise",
                        "alt": "Combat Expertise",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Expertise"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Combat Reflexes",
                        "alt": "Combat Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Great Fortitude",
                    "link": {
                        "type": "link",
                        "name": "Great Fortitude",
                        "alt": "Great Fortitude",
                        "href": "FeatDisplay.aspx?ItemName=Great%20Fortitude"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative",
                    "link": {
                        "type": "link",
                        "name": "Improved Initiative",
                        "alt": "Improved Initiative",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Initiative"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Iron Will",
                        "alt": "Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Power Attack",
                    "link": {
                        "type": "link",
                        "name": "Power Attack",
                        "alt": "Power Attack",
                        "href": "FeatDisplay.aspx?ItemName=Power%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "touch of idiocy"
                        }
                    ],
                    "name": "Quicken Spell-Like Ability",
                    "link": {
                        "type": "link",
                        "name": "Quicken Spell-Like Ability (touch of idiocy)",
                        "alt": "Quicken Spell-Like Ability (touch of idiocy)",
                        "href": "FeatDisplay.aspx?ItemName=Quicken%20Spell-Like%20Ability"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Appraise",
                        "value": 26
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Fly",
                        "value": 17
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Intimidate",
                        "value": 24
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (arcana)",
                        "value": 34
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (dungeoneering)",
                        "value": 26
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (engineering)",
                        "value": 26
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (geography)",
                        "value": 26
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (history)",
                        "value": 34
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (local)",
                        "value": 26
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (nature)",
                        "value": 26
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (nobility)",
                        "value": 26
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (planes)",
                        "value": 34
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (religion)",
                        "value": 26
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 25
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Sense Motive",
                        "value": 25
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Spellcraft",
                        "value": 15
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 19
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Use Magic Device",
                        "value": 13
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "envisaging"
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "compression"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "extension of all"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "glance of understanding"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "lore minder"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "void form"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Concordance of Rivals",
            "link": {
                "type": "link",
                "name": "Concordance of Rivals pg. 52",
                "alt": "Concordance of Rivals pg. 52",
                "href": "https://paizo.com/products/btq01x4d?Pathfinder-Campaign-Setting-Concordance-of-Rivals"
            },
            "page": 52
        }
    ]
}