{
    "name": "Seilenos",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> temperate forests<br/><b>Organization</b> solitary, troupe (1 plus 3–9 advanced dire tigers, centaurs, ichthyocentaurs, leanan sidhe, maenads, satyrs, or NPCs of at least 11th level), or court (1–3 plus 1–3 muses, 4–12 centaurs or satyrs, and 3–9 leanan sidhe, maenads, or storm giants)<br/><b>Treasure</b> standard (composite longbow with 40 mithral arrows, mithral morningstar, mwk pipes, other treasure)"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Dramatic Flourish (Su)</b> As a standard action while its impossible verisimilitude is active, a seilenos can inspire strong emotions in all enemies, all allies, or all creatures (seilenos’s choice) within 120 feet that can hear or see it, replicating the effect of a spell of the seilenos’s choice: <i>charm monster, confusion, crushing despair, fear, good hope, joyful rapture, reckless infatuation, suggestion, vengeful outrage,</i> or <i>waves of ecstasy</i>. A creature that successfully saves against a seilenos’s dramatic flourish can’t be affected by that seilenos’s dramatic flourish again for 24 hours. Any save DC is 30, regardless of which effect the seilenos chooses. The save DC is Charisma-based.<br/><b>Grace (Su)</b> A seilenos gains a deflection bonus to AC equal to his Charisma bonus (minimum +1).<br/><b>Impossible Verisimilitude (Su)</b> As a standard action, a seilenos can begin telling a story so supernaturally vivid that the elements described spring to life, replicating the effect of a spell of the seilenos’s choice: <i>screen, shades</i> (can also mimic <i>summon nature’s ally VIII</i>), or <i>veil</i>. It must use a free action to continue the performance each round; if it doesn’t, the illusion immediately ends. As part of this free action, the seilenos can add, remove, or change one illusion effect each round, to a maximum of three simultaneous illusions. Any save DC is 30, regardless of which effect the seilenos chooses. The save DC is Charisma-based.<br/><b>Sustaining Joy (Su)</b> As long as it is within 60 feet of one or more other creatures that have a morale bonus or are under a harmless effect with the emotion descriptor, the seilenos gains regeneration 15.<br/><b>Thyrsus (Su)</b> Any weapon a seilenos wields functions as a +5 weapon. Whenever the seilenos strikes a foe with a weapon, he can spend a swift action to use a spell-like ability of 6th level or lower that can target that foe. Only the creature struck can be affected by the spell-like ability.<br/><b>Versatile Performance (Ex)</b> A seilenos can use versatile performance as a 20th-level bard, using the chosen Perform modifier for checks with the corresponding skills."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Elder kin to satyrs, seilenoi are primeval fey bound to the basest emotions, including lust, joy, surprise, aggression, and fear. These fey wander the world, indulging in any excuse to experience or inspire passionate feelings. New spectacles of beauty, physical adventure, and psychoactive plants and alcohol draw their attention, and they encourage creatures they encounter to be equally experimental. Seilenoi particularly enjoy luring stodgy, honorable, or self-important beings into grandiose acts of foolishness or indulgence. Although less notorious than satyrs for sexual exploits, seilenoi possess a rugged animal magnetism and an appreciation for all sorts of carnal pleasures. They are particularly renowned for their insight and skill as storytellers and playwrights.<br/><br/> Like satyrs, seilenoi prefer to keep to untamed wilds where they revel in the passionate emotions of the fey and beasts that live, grow, and play there. Creatures of the forest often f lock to seilenoi in small troupes or even traveling courts. Satyrs, leanan sidhe, and muses (see page 179) enjoy the artistry of a seilenos’s storytelling. Centaurs and maenads revere seilenoi for inspiring irresistibly passionate, ecstatic rage. The seilenos acts as a mercurial judge, jocular keeper of fey culture and secrets, and sometimes self-centered celebrity to these groups. Seilenoi traveling across the ocean often take on ichthyocentaurs as seafaring guides and honor guards. Most seilenoi get separated from their courts eventually, either because their fey followers move on to more sedate leaders or because the seilenos feels stif led and drunkenly wanders off in search of a change of pace.<br/><br/> Seilenoi who do not lead their own fey courts sometimes serve as jesters, emissaries, unpredictable generals, or companions for fey lords, deities, or other mighty beings. Seilenoi prove surprisingly dangerous on the battlefield, as they dash about scattering scores of enemies with every cutting joke and inspiring monologue. When dealing with more numerous foes, they confound the battlefield with seemingly natural barriers and illusory sheets of roaring f lame. Others enjoy deflating the egos of powerful fey (and, occasionally, mortals) with bitingly insightful satire.<br/><br/> In their wanderings, seilenoi sometimes seek out new kinds of indulgence and distraction among mortals, in which case these fey generally prove themselves amiable, though gruff. Seilenoi can charm almost anyone with raucous affection or witty commentary. Those they can’t talk into joining the revelry, they generally ply with alcohol or psychotropic plants to lower the inhibitions of civilization and enable a freer expression of raw emotion. Bored seilenoi occasionally take it upon themselves to mentor mortals with exceptional self-awareness and power. Sometimes they do so while disguised with polymorph magic to avoid undue attention.<br/><br/> Seilenoi are passionate creatures, as thrilled by the chance to have a drunken brawl with new opponents as to explore the body of a new lover. Usually, seilenoi view combat as a sort of hunting or wrestling game, but if they recognize true hostility, they become a terrifying force. A seilenos never faces combat alone; it summons allies to distract foes if necessary and hides an ever-shifting <i>mirage arcana</i> while rallying allies and keeping foes off balance by manipulating their emotions. Its illusions represent the natural elements with which a seilenos is familiar, from fantastical mazes of writhing vines to confusing clouds of spores. It is particularly amused by exchanging the appearances of enemies and allies. Seilenoi have also been known to transform especially vexing foes into harmless animals or useful plants.<br/><br/> Although their wide range of moods tends toward joy and frivolity, all seilenoi at times indulge in the insidious thrill of violence, hatred, or madness. When filled with these dark passions, a seilenos might provoke a battle among evenly matched friends to watch the tense contest or dive headlong into the confused heart of a fray.<br/><br/> Seilenoi are about the same size and weight as male humans, although they tend toward the heavier end of that range."
        }
    ],
    "html": "<i>This creature has the body of a middle-aged human man and the pointed ears and legs of a goat.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Seilenos",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 13
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 38
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "low-light vision"
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "true seeing"
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Fey",
            "size": "Medium",
            "alignment": "Chaotic Neutral",
            "alignment_text": "CN",
            "cr": "19",
            "xp": 204800
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 37,
                "touch": 30,
                "flat-footed": 26,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+9 deflection"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+9 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+2 dodge"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+7 natural"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 18
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 23
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 21
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "grace"
                }
            ],
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 15,
                    "text": "15/cold iron and magic",
                    "conjunction": "and",
                    "damage_types": [
                        "cold iron",
                        "magic"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "sonic"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 30
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "40 ft.",
                        "movement_type": "walk",
                        "value": 40
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 5,
                    "name": "morningstar",
                    "bonus": [
                        28,
                        28,
                        23,
                        18
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d8+20"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "hoof",
                    "bonus": [
                        17
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d6+5"
                        }
                    ]
                }
            ],
            "ranged": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "ranged",
                    "count": 5,
                    "name": "composite longbow",
                    "bonus": [
                        27,
                        27,
                        22,
                        17
                    ],
                    "critical_range": "×3",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d8+13"
                        }
                    ]
                }
            ],
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "dramatic flourish"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "impossible verisimilitude"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "thyrsus"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Spell-Like Abilities",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "haste"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "speak with animals"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "stone tell"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "true seeing"
                                    }
                                ],
                                "count_text": "Constant",
                                "frequency": "Constant"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "commune with nature"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "confusion (DC 23)"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "crushing despair",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 23",
                                            "dc": 23
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "dancing lights",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 19",
                                            "dc": 19
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "divination"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "fear (DC 21)"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "good hope"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "mass suggestion (DC 25)"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "mirage arcana",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 24",
                                            "dc": 24
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "persistent image",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 24",
                                            "dc": 24
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "polymorph any object",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 27",
                                            "dc": 27
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "reckless infatuation",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 22",
                                            "dc": 22
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "waves of ecstasy",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 26",
                                            "dc": 26
                                        }
                                    }
                                ],
                                "count_text": "At will",
                                "frequency": "At will"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "greater heroism",
                                        "metamagic": "quickened"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "vengeful outrage (DC 25)"
                                    }
                                ],
                                "count_text": "3/day",
                                "count": 3,
                                "frequency": "day"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "cloak of dreams",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 25",
                                            "dc": 25
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "freedom"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "insanity (DC 26)"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "mass charm monster",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 27",
                                            "dc": 27
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "plant growth"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "reincarnate"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "summon (level 9, 4d4 advanced dire tigers, 4d4 advanced maenads, or 2 storm giants 100%)"
                                    }
                                ],
                                "count_text": "1/day",
                                "count": 1,
                                "frequency": "day"
                            }
                        ],
                        "caster_level": 21,
                        "concentration": 30
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 11
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "value": 19
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "value": 49
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 31,
            "dex": 29,
            "con": 32,
            "int": 24,
            "wis": 26,
            "cha": 29,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Dodge",
                    "link": {
                        "type": "link",
                        "name": "Dodge",
                        "alt": "Dodge",
                        "href": "FeatDisplay.aspx?ItemName=Dodge"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "morningstar"
                        }
                    ],
                    "name": "Improved Critical",
                    "link": {
                        "type": "link",
                        "name": "Improved Critical (morningstar)",
                        "alt": "Improved Critical (morningstar)",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Mobility",
                    "link": {
                        "type": "link",
                        "name": "Mobility",
                        "alt": "Mobility",
                        "href": "FeatDisplay.aspx?ItemName=Mobility"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Point-Blank Shot",
                    "link": {
                        "type": "link",
                        "name": "Point-Blank Shot",
                        "alt": "Point-Blank Shot",
                        "href": "FeatDisplay.aspx?ItemName=Point-Blank%20Shot"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Power Attack",
                    "link": {
                        "type": "link",
                        "name": "Power Attack",
                        "alt": "Power Attack",
                        "href": "FeatDisplay.aspx?ItemName=Power%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Precise Shot"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "greater heroism"
                        }
                    ],
                    "name": "Quicken Spell-Like Ability",
                    "link": {
                        "type": "link",
                        "name": "Quicken Spell-Like Ability (greater heroism)",
                        "alt": "Quicken Spell-Like Ability (greater heroism)",
                        "href": "FeatDisplay.aspx?ItemName=Quicken%20Spell-Like%20Ability"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Rapid Shot"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Spring Attack",
                    "link": {
                        "type": "link",
                        "name": "Spring Attack",
                        "alt": "Spring Attack",
                        "href": "FeatDisplay.aspx?ItemName=Spring%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "morningstar"
                        }
                    ],
                    "name": "Weapon Focus",
                    "link": {
                        "type": "link",
                        "name": "Weapon Focus (morningstar)",
                        "alt": "Weapon Focus (morningstar)",
                        "href": "FeatDisplay.aspx?ItemName=Weapon%20Focus"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "longbow"
                        }
                    ],
                    "name": "Weapon Focus"
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (arcana, history, religion)",
                        "value": 30
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (geography, nature)",
                        "value": 33
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 38
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perform (act)",
                        "value": 35
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perform (comedy)",
                        "value": 35
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perform (dance)",
                        "value": 35
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perform (oratory)",
                        "value": 39
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perform (wind instruments)",
                        "value": 37
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 39
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Survival",
                        "value": 31
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+4 Perception"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+4 Perform (oratory)"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+4 Stealth"
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Elven"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Sylvan"
                    }
                ],
                "communication_abilities": [
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "speak with animals"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "stone tell"
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "act"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "comedy"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "dance"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "oratory"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "wind instruments"
                        }
                    ],
                    "name": "versatile performance"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Bestiary 5",
            "link": {
                "type": "link",
                "name": "Bestiary 5 pg. 224",
                "alt": "Bestiary 5 pg. 224",
                "href": "http://paizo.com/products/btpy9g9x?Pathfinder-Roleplaying-Game-Bestiary-5%0D%0A"
            },
            "page": 224
        }
    ]
}