{
    "name": "Twilight Pitri (Barhisad)",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any (Positive Energy Plane)<br/><b>Organization</b> solitary<br/><b>Treasure</b> none"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Anatomical Undoing (Ex)</b> A twilight pitri adds its Wisdom modifier instead of its Strength modifier to damage dealt by its unarmed attacks, as it has an intuitive grasp of how to unmake corporeal forms. On a critical hit with its unarmed strike, it deals triple damage.<br/><b>Cerulean Nimbus (Su)</b> Twilight pitris are surrounded by an eerie blue light said to be a reflection from a previous version of the multiverse. While active, this light grants them a +4 shield bonus to their AC. A twilight pitri can make use of its frightful presence aura only while its cerulean nimbus surrounds it. The pitri can dismiss the light as a free action, even when it is not the pitri’s turn, to reroll any one saving throw or to negate a critical hit. A dismissed nimbus returns in 1d3 rounds.<br/><b>Lunar Rays (Su)</b> A twilight pitri can shoot rays of moonlight with a range of 100 feet. A twilight pitri can fire a single ray as an attack action, or up to four rays as a full attack action. Firing a ray does not provoke attacks of opportunity. A twilight pitri can apply its Vital Strike feats to lunar rays. Each ray deals 8d6 points of cold damage and 8d6 points of positive energy damage. This positive energy does not harm creatures that aren’t normally damaged by positive energy, nor does it heal them.<br/><b>Third Eye (Su)</b> As a swift action, a twilight pitri can open or close its third eye. While the eye is open, the twilight pitri gains access to an additional pool of 45 PE and gains a constant <i>true seeing</i> effect, but loses the benefits of its cerulean nimbus. This pool of psychic energy is separate from the twilight pitri’s regular pool, and is accessible only while the third eye is open. Effects that blind a twilight pitri prevent the use of this ability."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "While clerics and oracles spin their own myths of creation, manasaputras tout an occult truth behind these stories— the current multiverse is not the first to exist and it won’t be the last. Like the cycle of seasons and the moon, existence itself waxes and wanes.<br/><br/> Similar to the highest caste of pitris, twilight pitris are manasaputras whose existence predates the current multiverse. Unlike the solar pitris, these creatures started their path to enlightenment in the preceding multiverse, not some more ancient one. During that indescribable existence, twilight pitris were mortals who ascended to the ranks of manus. Surviving the natural end of their native reality, they endured and were incarnated into the current multiverse as this higher caste of manasaputras. Though they are in a higher form, it is one filled with tribulation and challenge, as becoming a twilight pitri is among the greatest trials in the path to absolute enlightenment.<br/><br/> This transition between multiverses has the effect of cutting off the former manus’ souls from the Cosmic Fire of creation. This “twilight” forces the new pitris to pursue enlightenment without the fire’s guidance.<br/><br/> While these creatures can hover around the Cosmic Fire on the Positive Energy Plane, they are barred from entering it. Some occult scholars believe this is merely a taboo, but the prohibition is more than a metaphysical barrier. These pitris are incapable of the spiritual incorporeality found among other types of manasaputras, which enables communion with the flame.<br/><br/> While some occult scholars teach that this exile is some form of punishment for actions in past incarnations, both twilight and even solar pitris deny this explanation. Instead, exile from the cosmic source is a test in spiritual suffering and self-sufficiency. Without the benefit of the Cosmic Fire, each twilight pitri must look within itself or to others to achieve full enlightenment, which is both challenging and spiritually taxing. Failure of this test leads to either the destruction of a twilight pitri or its continuance within lesser incarnations until the death of this multiverse and the creation of the next. Those who gain true enlightenment from this test become solar pitris when the next multiverse ignites, though most achieve status as a twilight pitri, fail the test, and are reincarnated as lesser manasaputras many times before succeeding and becoming solar pitris.<br/><br/> Because these pitris are disconnected from the cosmic source, their wisdom can sometimes seem imperfect, at least compared to that of the solar pitris. While all twilight pitris seek to expand enlightenment in the multiverse, their actions can accidently work against enlightened truth.<br/><br/> During the earliest epochs of this multiverse, the first twilight pitris sought not only to shepherd the f ledgling races, but also to impart knowledge and reason to those with whom they formed the closest bonds. The results of this effort still haunt them, as the pitris’ imperfect mastery of cosmic enlightenment turned these races into beings driven only by reason, logic, and systematic philosophies. As these beliefs opposed the spiritual ascension touted by other manasaputras, these early races ascended to become other types of outsiders, swelling the ranks of such beings. In the end, the kumaras had to intercede and right the wrongs inadvertently spurred by the twilight pitris’ actions. Because of this, many twilight pitris have chosen to be more contemplative and intuitive in deciding on their courses of action than other manasaputras, while others become more active hoping to make up for this early misstep.<br/><br/> In spite of their alien origins, twilight pitris seek to aid and inspire mortals of the Material Plane. They take great care to search for and study the individual mortals, societies, and worlds that hold the greatest promise. Mortals who show the best chance of becoming some form of manu in their next incarnations are chosen and taught the methods of contemplation, mindfully executed action, and focused meditation necessary to achieve their next stage of enlightenment. At the same time, such visitations—either to mortals or others of their kind— can be both a boon and a curse, for the twilight pitris often act in unexpected ways—their minds inscrutable to the denizens of the Material Plane—and their lack of connection with the Cosmic Fire often makes them seem disconnected from other manasaputras. A handful of kumaras seek out the aid of twilight pitris when they do leave the Positive Energy Plane, enjoying and finding wisdom in their sometimes alien and unexpected modes of thought.<br/><br/> Relationships between twilight pitris and manus are complicated. Many manus have at least one twilight pitri to thank for their first steps of enlightenment and acceptance into the manasaputra castes, but upon ascension, the new manus intuit how disconnected their former teachers are from the cosmic source of all things. They immediately find the words and guidance of the twilight pitris to be filled with half-truths and blind paths, even though the twilight pitri’s intentions are true and honorable. These manus still give members of this caste the respect and reverence they deserve, and understand the importance of this test—especially since they may face it themselves one day— but often go to great pains to avoid asking a twilight pitri for counsel. Relationships between twilight pitris and samsarans are even more strained, as knowledgeable members of that race blame the twilight pitris for nearly damning the entire samsaran race to a path outside of reincarnation and enlightenment. While they would never outwardly disrespect these higher forms of being, they are often suspicious of the twilight pitris’ guidance and disregard twilight pitris’ advice. Some samsarans outright refuse all aid coming from one of these manasaputras."
        }
    ],
    "html": "<i>Cerulean light surrounds this towering four-armed figure in a vibrant corona.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Twilight Pitri (Barhisad)",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 12
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 35
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            }
        ],
        "auras": [
            {
                "type": "stat_block_section",
                "subtype": "aura",
                "name": "frightful presence",
                "range": {
                    "type": "stat_block_section",
                    "subtype": "range",
                    "text": "60 ft.",
                    "range": 60,
                    "unit": "feet"
                },
                "saving_throw": {
                    "type": "stat_block_section",
                    "subtype": "save_dc",
                    "text": "DC 23",
                    "dc": 23
                }
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Outsider",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "extraplanar"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "good"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "lawful"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "manasaputra"
                }
            ],
            "size": "Large",
            "alignment": "Lawful Good",
            "alignment_text": "LG",
            "family": "Manasaputra",
            "cr": "18",
            "xp": 153600
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 36,
                "touch": 32,
                "flat-footed": 27,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+8 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+1 dodge"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+4 shield"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-1 size"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+14 Wis"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 15
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 22
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 22,
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "+2 vs. enchantment"
                        }
                    ]
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "cerulean nimbus"
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "calling"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "disease"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "poison"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 15,
                    "name": "adaptive"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 29
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "40 ft.",
                        "movement_type": "walk",
                        "value": 40
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "perfect<br/>"
                            }
                        ],
                        "name": "fly 60 ft.",
                        "movement_type": "fly",
                        "value": 60
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "unarmed strike",
                    "bonus": [
                        28,
                        23,
                        18,
                        13
                    ],
                    "critical_range": "19–20/×3",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d10+8"
                        }
                    ]
                }
            ],
            "ranged": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "ranged",
                    "touch": true,
                    "name": "lunar rays",
                    "bonus": [
                        31,
                        26,
                        21,
                        16
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "8d6",
                            "effect": "cold",
                            "damage_type": "",
                            "damage_type_text": "cold"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "8d6",
                            "effect": "positive energy",
                            "damage_type": "",
                            "damage_type_text": "positive energy"
                        }
                    ]
                }
            ],
            "space": "10 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "10 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "anatomical undoing"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "lunar rays"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "6/day"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "DC 18"
                        }
                    ],
                    "name": "stunning fist"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Spell-Like Abilities",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "greater teleport",
                                        "modifiers": [
                                            {
                                                "type": "stat_block_section",
                                                "subtype": "modifier",
                                                "name": "self only"
                                            }
                                        ]
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "plane shift",
                                        "modifiers": [
                                            {
                                                "type": "stat_block_section",
                                                "subtype": "modifier",
                                                "name": "self only"
                                            }
                                        ]
                                    }
                                ],
                                "count_text": "At will",
                                "frequency": "At will"
                            }
                        ],
                        "caster_level": 18,
                        "concentration": 26,
                        "notes": [
                            "Wisdom-based"
                        ]
                    },
                    {
                        "name": "Psychic Magic (Sp)",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "aversion",
                                        "psychic_energy": 2,
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 20",
                                            "dc": 20
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "awaken",
                                        "psychic_energy": 5
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "awaken construct",
                                        "psychic_energy": 6
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "babble",
                                        "psychic_energy": 3,
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 21",
                                            "dc": 21
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "ego whip V",
                                        "psychic_energy": 7,
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 25",
                                            "dc": 25
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "greater synaptic pulse",
                                        "psychic_energy": 5,
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 23",
                                            "dc": 23
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "mind thrust VI",
                                        "psychic_energy": 6,
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 24",
                                            "dc": 24
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "mindwipe",
                                        "psychic_energy": 4,
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 22",
                                            "dc": 22
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "psychic image",
                                        "psychic_energy": 9
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "psychic surgery",
                                        "psychic_energy": 6
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "synapse overload",
                                        "psychic_energy": 5,
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 23",
                                            "dc": 23
                                        }
                                    }
                                ],
                                "count_text": "45 PE",
                                "psychic_energy": 45
                            }
                        ],
                        "caster_level": 18,
                        "concentration": 26,
                        "notes": [
                            "Wisdom-based"
                        ]
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 24
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "value": 29
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "value": 62
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 19,
            "dex": 27,
            "con": 24,
            "int": 18,
            "wis": 26,
            "cha": 13,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Combat Reflexes",
                        "alt": "Combat Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Critical Focus",
                    "link": {
                        "type": "link",
                        "name": "Critical Focus",
                        "alt": "Critical Focus",
                        "href": "FeatDisplay.aspx?ItemName=Critical%20Focus"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Dodge",
                    "link": {
                        "type": "link",
                        "name": "Dodge",
                        "alt": "Dodge",
                        "href": "FeatDisplay.aspx?ItemName=Dodge"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "unarmed strike"
                        }
                    ],
                    "name": "Improved Critical",
                    "link": {
                        "type": "link",
                        "name": "Improved Critical (unarmed strike)",
                        "alt": "Improved Critical (unarmed strike)",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative",
                    "link": {
                        "type": "link",
                        "name": "Improved Initiative",
                        "alt": "Improved Initiative",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Initiative"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Unarmed Strike"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Vital Strike",
                    "link": {
                        "type": "link",
                        "name": "Improved Vital Strike",
                        "alt": "Improved Vital Strike",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Vital%20Strike"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Mobility",
                    "link": {
                        "type": "link",
                        "name": "Mobility",
                        "alt": "Mobility",
                        "href": "FeatDisplay.aspx?ItemName=Mobility"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Stunning Critical",
                    "link": {
                        "type": "link",
                        "name": "Stunning Critical",
                        "alt": "Stunning Critical",
                        "href": "FeatDisplay.aspx?ItemName=Stunning%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Stunning Fist",
                    "link": {
                        "type": "link",
                        "name": "Stunning Fist",
                        "alt": "Stunning Fist",
                        "href": "FeatDisplay.aspx?ItemName=Stunning%20Fist"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Vital Strike",
                    "link": {
                        "type": "link",
                        "name": "Vital Strike",
                        "alt": "Vital Strike",
                        "href": "FeatDisplay.aspx?ItemName=Vital%20Strike"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "unarmed strike"
                        }
                    ],
                    "name": "Weapon Focus",
                    "link": {
                        "type": "link",
                        "name": "Weapon Focus (unarmed strike)",
                        "alt": "Weapon Focus (unarmed strike)",
                        "href": "FeatDisplay.aspx?ItemName=Weapon%20Focus"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Acrobatics",
                        "value": 32,
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "+36 when jumping"
                            }
                        ]
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Fly",
                        "value": 41
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Intimidate",
                        "value": 25
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (arcana, dungeoneering, history, planes)",
                        "value": 31
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 35
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Spellcraft",
                        "value": 31
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 31
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Aklo"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Celestial"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    }
                ],
                "communication_abilities": [
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "telepathy",
                        "range": {
                            "type": "stat_block_section",
                            "subtype": "range",
                            "text": "100 ft.",
                            "range": 100,
                            "unit": "feet"
                        }
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "no breath"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "positive energy affinity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "third eye"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Bestiary 5",
            "link": {
                "type": "link",
                "name": "Bestiary 5 pg. 168",
                "alt": "Bestiary 5 pg. 168",
                "href": "http://paizo.com/products/btpy9g9x?Pathfinder-Roleplaying-Game-Bestiary-5%0D%0A"
            },
            "page": 168
        }
    ]
}