{
    "name": "Zygomind",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any temperate<br/><b>Organization</b> solitary<br/><b>Treasure</b> none or incidental"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Create Undead (Su)</b> A helpless body lying prone in a zygomind’s space takes 1 point of Constitution drain each day. A body that dies in this way rises as a mindless, corporeal undead (typically a skeleton or a zombie). Undead created by the zygomind wander forth from the plant, carrying its insidious mindscape within them. Their slam, claw, and bite attacks gain the zygomind’s soporific spores ability, and any creature that falls prey to the mindscape is compelled to walk toward the zygomind, regardless of its distance away. Undead retain this connection as long as they remain within 10 miles of the zygomind. Undead beyond 10 miles of the zygomind become free-willed undead, losing their connection to the mindscape and the soporific spores ability.<br/><b>Fascinating Aura (Su)</b> Creatures within 300 feet of a zygomind must succeed at a DC 36 Will save each round or become fascinated by the plant’s soothing mental commands. Since in most cases a known zygomind is an obvious threat (thus breaking the fascinated effect), this ability mainly assists an undetected zygomind, though even creatures who know of the zygomind’s threat are still exposed to the zygomind’s seamless reality ability if they fail the saving throw. The save DC is Charisma-based.<br/><b>Seamless Reality (Su)</b> Any creature that enters a zygomind’s space, fails its save against the zygomind’s fascinating aura, or is subjected to the zygomind’s soporific spores must succeed at a DC 29 Will save or be sucked into the zygomind’s mindscape. The zygomind’s mindscape is veiled and harmful, and time moves quickly for creatures inside it. It otherwise acts in all ways as the plane from which the affected creature entered the mindscape. Unlike the bodies of creatures whose consciousnesses are stuck in other mindscapes, the bodies of creatures whose minds are stuck in a zygomind’s mindscape are able to move; they invariably approach the zygomind at rate of 5 feet per round. Once within the zygomind’s space, the victims lie prone, allowing the zygomind to slowly absorb the bodies’ nutrients as their minds wander a false reality. A creature caught in the zygomind’s fascinating aura must succeed at a saving throw to avoid entering the mindscape each round it remains fascinated. A creature is not aware that it has entered the mindscape. The save DC is Constitution-based.<br/><b>Soporific Spores (Ex)</b> A creature that comes into physical contact with a zygomind must succeed at a DC 29 Will save or fall asleep for 1d4 days. Such creatures take a –5 penalty on saves and checks to realize they are in the zygomind’s mindscape. Creatures that succeed at their saves are immune to the zygomind’s soporific spores for 24 hours. The save DC is Constitution-based.<br/><b>Spore Explosion (Su)</b> When a zygomind is destroyed, it explodes in a cloud of ethereal spores that typically find their way back into space, sometimes floating along the solar winds for thousands of years before gravitating back toward a new bastion of intelligent life."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Civilizations across the Material Plane fear many disasters—hurricanes, earthquakes, plagues, and more— but few things spell doom for a settlement with such insidious certainty as a f lourishing zygomind. These massive fungi f loat through space as ethereal spores, spreading their cloying mycelia wherever creatures of intelligence thrive. The presence of a young zygomind is at first innocuous and difficult to detect, as animals and other creatures of low intelligence begin to disappear. Eventually, more intelligent creatures track their prey to the site and become lost themselves, wandering back toward civilization days or even weeks later as infected undead, dominated with the instinct to bring ever-greater intellects into the zygomind’s power. Over the course of only a few months, a growing zygomind can decimate a small city, rapidly accelerating its growth into a 500-foot monstrosity.<br/><br/> By the time a zygomind becomes visible above the treeline, it is likely too late for the intelligent life of the region; the zygomind’s insidious psychic trap defeats any resistance that most such creatures can mount. Frequently, those investigating the zygomind slip seamlessly into an alternate reality without realizing that they’ve fallen under the power of the very thing they sought to destroy. A zygomind’s mindscape only becomes more convincing as it subtly enslaves more and more minds—the fungus can reconstruct whole cities, even as the real-world inhabitants of those settlements proceed somnambulistically into the zygomind. Entire armies have marched upon mature zygominds, intent on ridding the region of the scourge, only to halt their assault mid-charge and plod calmly, rank by rank, into the zygomind’s physical and psychic grasp. The cruel irony of the plant’s trap is that these soldiers likely live the rest of their lives believing themselves victorious, forming memories of defeating the insidious fungus, returning home to their loving families, and eventually dying after a long and productive life, while in the real world the zygomind’s mycelium sucks the nutrients from their helpless bodies and transforms them into undead minions.<br/><br/> The wide-ranging habits of a zygomind’s minions make the fungi relatively easy to track for those who know of the obscure creatures. Stories of zombies or other virulent undead can sometimes point toward a zygomind’s inf luence, especially if the undead’s victims tend to wander off in a certain direction after infection. A particularly dedicated adventurer could follow one of these enthralled creatures for the entire journey back to the fungus, though the pace the victim sets often proves excruciatingly slow to all but the most patient individuals. Subtler clues could hint at a zygomind’s inf luence as well, such as a sudden rash of sleepwalking in a nearby town or whispered rumors about a logging camp whose workers all disappeared into the forest together without a word.<br/><br/> Those with the wherewithal to follow the clues to the zygomind invariably encounter a horde of slowly shuff ling, mindscape-bound victims on their way to offer themselves to the fungus. Attempting to shake these victims out of their torpor produces no effect, and forcibly restraining them is a temporary solution at best. Occasionally, certain brave or foolhardy adventurers submit themselves willingly to a zygomind’s mindscape, hoping to free the minds of those trapped within. This is a path fraught with peril, though, for the adventurers’ bodies approach the zygomind at the same rate, and the adventurers’ consciousnesses face the monumental challenge of trying to prove to a city of people that their world is a false construction. Powerful psychic spellcasters have had some luck helping victims escape by using spells such as <i>mindscape door</i>, but such forcible egress from the zygomind’s mindscape draws the attention of the zygomind itself, and it lashes out instinctively at these psychic invaders.<br/><br/> Depending on how long a zygomind has infested an area, a creature who is able to avoid being trapped in the mindscape could find a veritable hoard of weapons, armor, and magic items within the cage of its body, discarded as the bodies that brought them withered away, then rose as undead. Of course, a canny adventurer must always be aware that the discovery of such a trove within the fungus could simply be one more illusion imposed by the zygomind’s mindscape. Once a creature has had contact with a zygomind, it can never again truly be certain that the world it inhabits is the real one without the aid of powerful psychic magic or of those familiar with the logic and perils of mindscapes—yet even then, the zygomind smoothly creates the illusions of such individuals and abilities to reassure victims that they are indeed free.<br/><br/> When fully grown, a zygomind can reach a height of 500 feet, and its mycelium can stretch for 10 miles in all directions, comprising hundreds of tons of biomass. The main cage is usually 25–40 feet in diameter and weighs around 40,000 pounds."
        }
    ],
    "html": "<i>This enormous fungus looks like a cage, and a strange glow emanates from within.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Zygomind",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 7
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 7
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "blindsight 100 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "low-light vision"
            }
        ],
        "auras": [
            {
                "type": "stat_block_section",
                "subtype": "aura",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "10 rounds"
                    }
                ],
                "name": "fascinating aura",
                "range": {
                    "type": "stat_block_section",
                    "subtype": "range",
                    "text": "300 ft.",
                    "range": 300,
                    "unit": "feet"
                },
                "saving_throw": {
                    "type": "stat_block_section",
                    "subtype": "save_dc",
                    "text": "DC 36",
                    "dc": 36
                }
            },
            {
                "type": "stat_block_section",
                "subtype": "aura",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "2d4 rounds"
                    }
                ],
                "name": "stench",
                "range": {
                    "type": "stat_block_section",
                    "subtype": "range",
                    "text": "100 ft.",
                    "range": 100,
                    "unit": "feet"
                },
                "saving_throw": {
                    "type": "stat_block_section",
                    "subtype": "save_dc",
                    "text": "DC 29",
                    "dc": 29
                }
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Plant",
            "size": "Colossal",
            "alignment": "Neutral",
            "alignment_text": "N",
            "cr": "18",
            "xp": 153600
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 24,
                "touch": 9,
                "flat-footed": 17,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+7 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+15 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-8 size"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 21
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 16
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 16
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "all-around vision"
                }
            ],
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 20,
                    "text": "20/magic and slashing",
                    "conjunction": "and",
                    "damage_types": [
                        "magic",
                        "slashing"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "plant traits"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 29
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "5 ft.",
                        "movement_type": "walk",
                        "value": 5
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "climb 5 ft.",
                        "movement_type": "climb",
                        "value": 5
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 4,
                    "name": "tentacles",
                    "bonus": [
                        23
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d8+10"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "grab"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "soporific spores"
                        }
                    ]
                }
            ],
            "space": "30 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "50 ft. with tentacles"
                    }
                ],
                "value": "30 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "2d8+10"
                        }
                    ],
                    "name": "constrict"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "create undead"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "DC 29 plus soporific spores"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "1d10 rounds"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "hardness 5"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "hp 10"
                        }
                    ],
                    "name": "entrap"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "seamless reality"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "soporific spores"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Spell-Like Abilities",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "greater create mindscape"
                                    }
                                ],
                                "count_text": "At will",
                                "frequency": "At will"
                            }
                        ],
                        "caster_level": 18,
                        "concentration": 30
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 21
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+43 grapple"
                    }
                ],
                "value": 39
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "can’t be tripped"
                    }
                ],
                "value": 56
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 31,
            "dex": 25,
            "con": 20,
            "int": null,
            "wis": 24,
            "cha": 35,
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Climb",
                        "value": 18
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "spore explosion"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Bestiary 5",
            "link": {
                "type": "link",
                "name": "Bestiary 5 pg. 286",
                "alt": "Bestiary 5 pg. 286",
                "href": "http://paizo.com/products/btpy9g9x?Pathfinder-Roleplaying-Game-Bestiary-5%0D%0A"
            },
            "page": 286
        }
    ]
}