{
    "name": "Chyzaedu",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any<br/><b>Organization</b> solitary<br/><b>Treasure</b> double (7,500 gp of metallic material, other treasure)"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Alien Vestment (Su)</b> A chyzaedu wears a sheet of undulating metallic material blessed by its inscrutable gods. The chyzaedu treats this garment as a <i>+1 moderate fortification breastplate</i> that provides immunity to mind-affecting effects. The vestment also serves as a divine focus for any spell the chyzaedu casts. This vestment doesn’t function for any creature other than the chyzaedu for which it was originally crafted. If a chyzaedu’s vestment is stolen or destroyed, the chyzaedu can create a replacement with a month of work.<br/><br/><b>Ecstatic Hunger Aura (Su)</b> A chyzaedu’s zealous drive to consume infects the minds of those around it. Any living creature within 30 feet of a chyzaedu must succeed at a DC 19 Will save or immediately consume any food and beverages (including potions and the like) on its person or within its reach. This effect continues for as long as it takes the creature to consume all the food and beverages within its reach. The creature defends itself normally but takes no other actions while eating and drinking. If the creature succeeds at the saving throw, it cannot be affected again by the aura for another 24 hours. This is a mind-affecting compulsion effect. The save DC is Charisma-based.<br/><br/><b>Spells</b> Chyzaedu cast divine spells as 10th-level clerics, but they do not gain access to domains or to any other cleric abilities."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Chyzaedu resemble massive pale earthworms, save that each has a hard beaks at one end and a knot of short tentacles at the other. Their bodies are extremely flexible and ringed with powerful muscles. Chyzaedu have very efficient, well-developed digestive systems, allowing them to ingest a wide variety of materials, although they prefer to eat sentient creatures in order to share the religious experience of consumption.<br/><br/>Chyzaedu have a ring of tiny eyes around their beaklike maws, mostly hidden by the folds of their skin. These eyes are particularly keen and can dilate to allow the creature excellent night vision. Their eyes are supplemented by the lumpy and irregularly sized parietal eyes that line the area just behind their beaks; these serve as supplemental sensory organs, pinpointing the location of other nearby creatures in contact with the ground. The cloaca at the end of a chyzaedu’s body is ringed by five flexible, ridged tentacles, which can wind together to form a clawlike appendage. A chyzaedu has significant control over this appendage and can use it to grasp items, manipulate devices, or cast spells with somatic components.<br/><br/>Millennia ago, chyzaedu formed a brutal empire that subjugated several planets, and their voracious appetites stripped their conquered worlds of flora and fauna. Only the chyzaedu’ home planet was spared this depredation, as the giant worms revered the life found there. In a bizarre astronomical accident—which some suspect the inscrutable masters of the Dominion of the Black of orchestrating—the cherished chyzaedu homeworld was swallowed by a black hole. This void emitted a strange, singing noise as it did so, along with staccato exhalations reminiscent of cruel laughter.<br/><br/>The surviving chyzaedu saw this catastrophe as a divine revelation, experiencing a species-wide psychic rapture that resonates within all chyzaedu even today. The chyzaedu became zealots, spreading outward into space to preach the sanctity of destruction they call the Deglutitious Void. When the chyzaedu eventually encountered the starfaring collective called the Dominion of the Black, they found their theology to be closely aligned with the destructive philosophies of the Dominion.<br/><br/>Chyzaedu are now firmly ensconced as the priestly caste of the Dominion of the Black and lead the collective’s other races in abstruse religious rites. Most of these rites revolve around all-consuming voids, black holes, or gulfs of null space that utterly extinguish all matter. Most notably, chyzaedu orchestrate the biennial ceremony known as the Banquet, in which tens of thousands of sacrifices are hurled into black holes in the hope of evoking the same singing and chuckling exhalations that accompanied the consumption of the chyzaedu homeworld. Although focused on devouring, chyzaedu religion is not eschatological, but instead emphasizes the sanctity of the passage into the void: that is, the rapturous moment of devouring and of being devoured. All moments of swallowing are sacred to the chyzaedu. Creatures ingested by chyzaedu are unlikely to share the chyzaedu’s religious appreciation for the event, which puzzles the aberrations.<br/><br/>Chyzaedu are social creatures. They’re eager conversationalists, although they eventually bring any discourse around to the topic of religion, consumption, or both. Chyzaedu are often found alongside other races of the Dominion as advisors, diplomats, and spiritual advisors. Despite their great bulk, chyzaedu make excellent spies: they are welcome throughout most of Dominion territory, and few members of the mostly secular Dominion understand the full capabilities of the creatures’ divine magic. Chyzaedu rarely congregate with their own kind except during brief periods of mating or when communally presiding over religious services; idle chyzaedu inevitably quarrel with each other about religious minutiae, and such religious quarrels invariably end in violence.<br/><br/>Chyzaedu drape themselves with vestments of a flexible metallic fiber akin to mithral. Each chyzaedu crafts its own garment using secret processes the worm-priests do not share with other races. As few races in the Dominion of the Black use metal, chyzaedu’s vestments are both rare and distinctive in their cosmopolitan society. Although chyzaedu vestments don’t function for other races, the 500 pounds of metallic fabric that constitute the garment are worth 7,500 gp.<br/><br/>Unlike most races of the Dominion, chyzaedu have a keen interest in Golarion and make occasional expeditions to the planet. Chyzaedu share a myth similar to the Casmar legend of the Star-Worm—it tells of an interstellar monster that crashed on Golarion eons ago and gave birth to the first purple worms. Chyzaedu track and study purple worms and their variants (in particular, the colossal crimson worms of the Storval Plateau). Some chyzaedu view purple worms as enlightened brutes, devoid of intellect but wholly overwhelmed by the religious fervor of consumption. Other chyzaedu see purple worms as little more than breeding stock, but hope to use them to enhance future generations of their race. The worm-priests find the diverse panoply of deities worshipped on Golarion to be confusing and unnecessary, and are particularly offended by the worship of Rovagug—the Rough Beast’s theology of destruction wholly devoid of purpose smacks of apostasy.<br/><br/>Chyzaedu measure of 60 feet in length on average and weigh approximately 5,000 pounds."
        }
    ],
    "html": "<i>The massive, wormlike form of this eyeless, beaked beast is draped in shimmering metallic vestments.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Chyzaedu",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 0
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 22
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "tremorsense 60 ft."
            }
        ],
        "auras": [
            {
                "type": "stat_block_section",
                "subtype": "aura",
                "name": "ecstatic hunger",
                "range": {
                    "type": "stat_block_section",
                    "subtype": "range",
                    "text": "30 ft.",
                    "range": 30,
                    "unit": "feet"
                },
                "saving_throw": {
                    "type": "stat_block_section",
                    "subtype": "save_dc",
                    "text": "DC 19",
                    "dc": 19
                }
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Aberration",
            "size": "Gargantuan",
            "alignment": "Lawful Evil",
            "alignment_text": "LE",
            "cr": "10",
            "xp": 9600
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 24,
                "touch": 6,
                "flat-footed": 24,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+6 armor"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+12 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-4 size"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 9
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 4
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 14
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "50% chance to negate critical hits and sneak attacks"
                }
            ],
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 10,
                    "text": "10/magic",
                    "damage_types": [
                        "magic"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "acid"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "mindaffecting effects"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 21
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "burrow 20 ft.",
                        "movement_type": "burrow",
                        "value": 20
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "climb 20 ft.",
                        "movement_type": "climb",
                        "value": 20
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "bite",
                    "bonus": [
                        17
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d8+11"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "grab"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "claw",
                    "bonus": [
                        17
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d6+11"
                        }
                    ]
                }
            ],
            "space": "20 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "20 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "5d6 acid damage"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "AC 16"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "13 hp"
                        }
                    ],
                    "name": "swallow whole"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Cleric Spells Prepared",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "greater command",
                                        "spell_dc": 20
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "mass inflict light wounds",
                                        "spell_dc": 20
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "scrying",
                                        "spell_dc": 20
                                    }
                                ],
                                "count_text": "5th",
                                "frequency": "5th"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "air walk"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "cure critical wounds"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "dimensional anchor"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "sending"
                                    }
                                ],
                                "count_text": "4th",
                                "frequency": "4th"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "blindness/deafness",
                                        "spell_dc": 18
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "deeper darkness"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "magic circle against good"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "prayer"
                                    }
                                ],
                                "count_text": "3rd",
                                "frequency": "3rd"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "enthrall",
                                        "spell_dc": 17
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "shatter",
                                        "spell_dc": 17
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "silence",
                                        "spell_dc": 17
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "sound burst",
                                        "spell_dc": 17
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "spiritual weapon"
                                    }
                                ],
                                "count_text": "2nd",
                                "frequency": "2nd"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "cause fear",
                                        "spell_dc": 16
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "command",
                                        "spell_dc": 16
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "cure light wounds"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "divine favor"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "sanctuary",
                                        "spell_dc": 16
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "shield of faith"
                                    }
                                ],
                                "count_text": "1st",
                                "frequency": "1st"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "bleed"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "create water"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "detect magic"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "resistance"
                                    }
                                ],
                                "count_text": "0",
                                "frequency": "0"
                            }
                        ],
                        "caster_level": 10,
                        "concentration": 15
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 10
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+27 bull rush"
                    }
                ],
                "value": 25
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "37 vs. bull rush"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "can’t be tripped"
                    }
                ],
                "value": 35
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 32,
            "dex": 11,
            "con": 21,
            "int": 16,
            "wis": 21,
            "cha": 14,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Awesome Blow",
                    "link": {
                        "type": "link",
                        "name": "Awesome Blow",
                        "alt": "Awesome Blow",
                        "href": "FeatDisplay.aspx?ItemName=Awesome%20Blow"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Casting",
                    "link": {
                        "type": "link",
                        "name": "Combat Casting",
                        "alt": "Combat Casting",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Casting"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Eschew Materials",
                    "link": {
                        "type": "link",
                        "name": "Eschew Materials",
                        "alt": "Eschew Materials",
                        "href": "FeatDisplay.aspx?ItemName=Eschew%20Materials"
                    },
                    "notation": "B"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Extend Spell",
                    "link": {
                        "type": "link",
                        "name": "Extend Spell",
                        "alt": "Extend Spell",
                        "href": "FeatDisplay.aspx?ItemName=Extend%20Spell"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Bull Rush",
                    "link": {
                        "type": "link",
                        "name": "Improved Bull Rush",
                        "alt": "Improved Bull Rush",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Bull%20Rush"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Intimidating Prowess",
                    "link": {
                        "type": "link",
                        "name": "Intimidating Prowess",
                        "alt": "Intimidating Prowess",
                        "href": "FeatDisplay.aspx?ItemName=Intimidating%20Prowess"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Power Attack",
                    "link": {
                        "type": "link",
                        "name": "Power Attack",
                        "alt": "Power Attack",
                        "href": "FeatDisplay.aspx?ItemName=Power%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Vital Strike",
                    "link": {
                        "type": "link",
                        "name": "Vital Strike",
                        "alt": "Vital Strike",
                        "href": "FeatDisplay.aspx?ItemName=Vital%20Strike"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Climb",
                        "value": 16
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Diplomacy",
                        "value": 16
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Intimidate",
                        "value": 30
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (religion)",
                        "value": 20
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 22
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Sense Motive",
                        "value": 19
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Spellcraft",
                        "value": 20
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Survival",
                        "value": 22
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Aklo"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Infernal"
                    }
                ],
                "communication_abilities": [
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "telepathy",
                        "range": {
                            "type": "stat_block_section",
                            "subtype": "range",
                            "text": "100 ft.",
                            "range": 100,
                            "unit": "feet"
                        }
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "alien vestment"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Occult Bestiary",
            "link": {
                "type": "link",
                "name": "Occult Bestiary pg. 14",
                "alt": "Occult Bestiary pg. 14",
                "href": "http://paizo.com/products/btpy9g21?Pathfinder-Campaign-Setting-Occult-Bestiary%0D%0A"
            },
            "page": 14
        }
    ]
}