{
    "name": "Oolioddroo",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any (Abyss)<br/><b>Organization</b> solitary, pair, or cult (3–6)<br/><b>Treasure</b> standard"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Oviposition (Su)</b> As a full-round action once per day, an oolioddroo can use its tongue to implant its eggs into the brain of a helpless, sleeping, unconscious, or willing creature, dealing 1 point of Intelligence damage. Typically, the oolioddroo uses <i>modify memory</i> immediately after an oviposition, making its victim forget the violation. The egg gestates in the victim’s brain for 24 hours, after which a small caterpillar-like larva emerges and nestles painlessly within the victim’s brain. At this point, the oolioddroo can track the victim’s location as if the victim were under the effect of a <i>status</i> spell, can communicate telepathically with the victim across any distance, and can use its <i>detect thoughts, modify memory,</i> and <i>suggestion</i> spell-like abilities through the link to target the victim. The larva (and its link to its oolioddroo) becomes inert whenever the victim and the oolioddroo are on separate planes. Victims carrying this larva radiate a chaotic and evil aura. Anyone who reads the victim’s thoughts, such as via <i>detect thoughts</i> or <i>telepathy</i>, can attempt a Sense Motive check opposed by the oolioddroo’s Bluff check to notice the presence of a second, alien set of thoughts in the target’s mind. <i>Dispel chaos</i> and <i>dispel evil</i> can each immediately end the oviposition—the implanted larva melts into harmless fluid and is absorbed by the victim’s body. This is not a disease effect, though, so <i>heal</i> or <i>remove disease</i> offer no aid in ending the effect. As an immediate action, an oolioddroo can use its <i>feeblemind</i> spell-like ability on the carrier—it uses this “scorched earth” tactic if it fears that the host is about to be rescued or cut off from its influence, such as occurs when the effects are ended via <i>dispel chaos</i> or <i>dispel evil</i>. Using <i>feeblemind</i> in this way automatically destroys the larva, regardless of whether or not the victim succeeds at the saving throw against the feeblemind effect, so an oolioddroo typically waits until the last moment to use this ability. <br/><br/><b>See Thoughts (Su)</b> An oolioddroo can see a creature’s thoughts, interpreting them as a shifting mass of colors, images, and shapes that infuse a creature’s aura. An oolioddroo gains the effects of <i>see invisibility</i> against creatures with an Intelligence score as a result of this unusual sense. This ability also grants the oolioddroo a +8 racial bonus on Sense Motive checks. When it uses <i>detect thoughts</i>, it does not have to study an area or subject to gain all 3 rounds of information—it gains all of this information on the 1st round of using the ability. In addition, it gains a +4 racial bonus to the save DC of its <i>detect thoughts</i> spell-like ability. A blind oolioddroo loses the ability to see thoughts. <br/><br/><b>Shadow Mantle (Su)</b> The supernatural shadows that wreathe an oolioddroo grant the creature a +4 racial bonus on Stealth checks and a +4 deflection bonus to its Armor Class. <br/><br/><b>Thought Siphon (Su)</b> Whenever an oolioddroo damages a creature with its tongue attack, it can drink away one of the creature’s thoughts or memories. A creature can resist this attack with a successful DC 23 Will save. On a failed save, the oolioddroo targets the victim with one of the following effects. The save DC is Charisma-based. <br/><br/><i>Memory Drain</i>: The victim is immediately affected by the oolioddroo’s <i>modify memory</i> spell-like ability. The oolioddroo can adjust up to 5 minutes of memories immediately—it does not need to increase the spell’s casting time to match the duration of the modified memory. <br/><br/><i>Skill Drain</i>: The victim loses all skill ranks in a skill of the oolioddroo’s choosing for 24 hours. Lost skill ranks can be recovered immediately with a <i>restoration</i> or <i>greater restoration</i> spell. <br/><br/><i>Spell Drain</i>: The victim immediately loses one prepared spell or one unused spell slot of the oolioddroo’s choice; this lost spell or spell slot can be replenished normally. <br/><br/><i>Wisdom Drain</i>: The victim takes 2 points of Wisdom drain. <br/><br/><b>Tongue (Ex)</b> An oolioddroo’s tongue attack is a primary attack that deals piercing and slashing damage. Whenever an oolioddroo damages a foe with its tongue, it can use its thought siphon attack."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Oolioddroos, known also as moth demons, are an especially insidious breed of fiend that can infest the brains of living creatures with their eggs, allowing them to manipulate their victims’ thoughts and minds from afar. This might mean an oolioddroo’s victim could go about its normal life for months or even years before the demon capitalizes on the link and forces it to undertake a particularly nefarious or vile deed. In the worst cases, the victim commits crimes or heinous acts at the oolioddroo’s bidding and then immediately forgets about these acts, creating the perfect sleeper agent who not only unknowingly does the oolioddroo’s bidding, but might, when not controlled, be significantly involved in efforts to oppose the acts of sabotage and terrorism the oolioddroo commands. To the oolioddroo, the torment, shame, and despair a victim feels upon realizing he’s been at least somewhat responsible for such actions is as delicious and delightful as the pain and suffering caused by the acts themselves. <br/><br/>An oolioddroo appears as a skeletally thin woman with gray flesh. Its shadow mantle typically appears in the form of a flowing, diaphanous gown of semisolid shadows and smoke, but the demon can make this defense appear to be black clothes or simply its own shadow. The oolioddroo’s deeply unsettling face is that of a horned moth, and her tongue, while flexible, is strong enough to penetrate flesh and bone with ease. An oolioddroo stands 6 feet tall, but weighs only 100 pounds. These sinister demons form from the souls of those who used brainwashing, mind control, and similar techniques, either magical or mundane, to trick or force the innocent into committing terrible acts of brutality. <br/><br/>Oolioddroos are particularly valued in more subtle invasions of the mortal realm, where the act of possession might be too blatant a tactic to use against the innocents of the world. When an oolioddroo does its job well, none even suspect demonic influence; instead they think that the devastating cruelties its influence has engendered rose entirely from the debased thoughts of lone fanatics or sociopaths. <br/><br/>An encounter with an oolioddroo can be rather complex due to the nature of the creature’s special abilities— especially if a PC is its intended victim. If an oolioddroo attempts to seize control of a lone PC, one tricky tactic is to simply ask the character’s player to attempt all the necessary rolls and checks beforehand. Typically, one of these demons attempts to implant eggs in a character who is alone or asleep, in which case that character can attempt a Perception check (at a –10 penalty if the character is sleeping) and a saving throw against the <i>modify memory</i> spell—if both fail, the implanted egg hatches without the player noticing. Thereafter, the source of the strange voices and compulsions in the character’s mind, as well as the source of the periodic <i>suggestions</i> and other magical attacks, can be as frighteningly mysterious to the player as they are to the character. Of course, the GM should take care not to go too far with this—and if a PC or an ally uses detect evil, for example, she might guess that something is afoot when a normally nonevil PC radiates an unexpected aura."
        }
    ],
    "html": "<i>This skeletally thin woman has a mothlike face, flies upon dragonfly wings, and is wrapped in shadows.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Oolioddroo",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 7
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 32
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "see thoughts"
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Outsider",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "chaotic"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "demon"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "evil"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "extraplanar"
                }
            ],
            "size": "Medium",
            "alignment": "Chaotic Evil",
            "alignment_text": "CE",
            "family": "Demon",
            "cr": "13",
            "xp": 25600
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 28,
                "touch": 22,
                "flat-footed": 20,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+4 deflection"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+7 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+1 dodge"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+6 natural"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 11
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 16
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 16
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "shadow mantle"
                }
            ],
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 10,
                    "text": "10/good",
                    "damage_types": [
                        "good"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "electricity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "mind-affecting effects"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "poison"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "acid"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "cold"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "fire"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 24
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "perfect<br/>"
                            }
                        ],
                        "name": "fly 40 ft.",
                        "movement_type": "fly",
                        "value": 40
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 2,
                    "name": "claws",
                    "bonus": [
                        21
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4+2"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "tongue",
                    "bonus": [
                        21
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d6+2"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "thought siphon"
                        }
                    ]
                }
            ],
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "oviposition"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "sneak attack +3d6"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Spell-Like Abilities",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "calm emotions",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 18",
                                            "dc": 18
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "charm person",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 17",
                                            "dc": 17
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "detect thoughts",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 22",
                                            "dc": 22
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "greater teleport",
                                        "modifiers": [
                                            {
                                                "type": "stat_block_section",
                                                "subtype": "modifier",
                                                "name": "self plus 50 lbs. of objects only"
                                            }
                                        ]
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "invisibility"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "modify memory (DC 19)"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "sending"
                                    }
                                ],
                                "count_text": "At will",
                                "frequency": "At will"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "hold person",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 19",
                                            "dc": 19
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "metamagic": "quickened",
                                        "name": "invisibility"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "suggestion (DC 19)"
                                    }
                                ],
                                "count_text": "3/day",
                                "count": 3,
                                "frequency": "day"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "dream"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "feeblemind (DC 21)"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "nightmare",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 21",
                                            "dc": 21
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "summon",
                                        "modifiers": [
                                            {
                                                "type": "stat_block_section",
                                                "subtype": "modifier",
                                                "name": "level 4"
                                            },
                                            {
                                                "type": "stat_block_section",
                                                "subtype": "modifier",
                                                "name": "1 oolioddroo 35% or 1d4 shadow demons 35%"
                                            }
                                        ]
                                    }
                                ],
                                "count_text": "1/day",
                                "count": 1,
                                "frequency": "day"
                            }
                        ],
                        "caster_level": 14,
                        "concentration": 20
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 14
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "value": 16
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "value": 38
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 14,
            "dex": 25,
            "con": 24,
            "int": 21,
            "wis": 24,
            "cha": 23,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Dodge",
                    "link": {
                        "type": "link",
                        "name": "Dodge",
                        "alt": "Dodge",
                        "href": "FeatDisplay.aspx?ItemName=Dodge"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Lightning Stance",
                    "link": {
                        "type": "link",
                        "name": "Lightning Stance",
                        "alt": "Lightning Stance",
                        "href": "FeatDisplay.aspx?ItemName=Lightning%20Stance"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Mobility",
                    "link": {
                        "type": "link",
                        "name": "Mobility",
                        "alt": "Mobility",
                        "href": "FeatDisplay.aspx?ItemName=Mobility"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "invisibility"
                        }
                    ],
                    "name": "Quicken Spell-Like Ability",
                    "link": {
                        "type": "link",
                        "name": "Quicken Spell-Like Ability (invisibility)",
                        "alt": "Quicken Spell-Like Ability (invisibility)",
                        "href": "FeatDisplay.aspx?ItemName=Quicken%20Spell-Like%20Ability"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Spring Attack",
                    "link": {
                        "type": "link",
                        "name": "Spring Attack",
                        "alt": "Spring Attack",
                        "href": "FeatDisplay.aspx?ItemName=Spring%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Weapon Finesse",
                    "link": {
                        "type": "link",
                        "name": "Weapon Finesse",
                        "alt": "Weapon Finesse",
                        "href": "FeatDisplay.aspx?ItemName=Weapon%20Finesse"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Wind Stance",
                    "link": {
                        "type": "link",
                        "name": "Wind Stance",
                        "alt": "Wind Stance",
                        "href": "FeatDisplay.aspx?ItemName=Wind%20Stance"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Acrobatics",
                        "value": 21
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Bluff",
                        "value": 23
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Diplomacy",
                        "value": 23
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Fly",
                        "value": 32
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (arcana, planes)",
                        "value": 22
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 32
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Sense Motive",
                        "value": 32
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Spellcraft",
                        "value": 22
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 28
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Use Magic Device",
                        "value": 23
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+8 Perception"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+4 Stealth"
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Abyssal"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Celestial"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Draconic"
                    }
                ],
                "communication_abilities": [
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "telepathy",
                        "range": {
                            "type": "stat_block_section",
                            "subtype": "range",
                            "text": "300 ft.",
                            "range": 300,
                            "unit": "feet"
                        }
                    }
                ]
            }
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Bestiary 6",
            "link": {
                "type": "link",
                "name": "Bestiary 6 pg. 86",
                "alt": "Bestiary 6 pg. 86",
                "href": "http://paizo.com/products/btpy9oge?Pathfinder-Roleplaying-Game-Bestiary-6-Hardcover%0D%0A"
            },
            "page": 86
        },
        {
            "type": "source",
            "name": "The Worldwound",
            "link": {
                "type": "link",
                "name": "The Worldwound pg. 50",
                "alt": "The Worldwound pg. 50",
                "href": "http://paizo.com/products/btpy8yvk?Pathfinder-Campaign-Setting-The-Worldwound"
            },
            "page": 50
        }
    ]
}