{
    "name": "Slithering Pit",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any land<br/><b>Organization</b> solitary<br/><b>Treasure</b> incidental"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Breach Sense (Su)</b> A slithering pit can detect the presence and location of extradimensional spaces within the range of its blindsense, including those created by magic items like bags of holding, handy haversacks, and portable holes, as well as spell effects such as mage’s <i>magnificent mansion</i> and <i>rope trick</i>. This ability also allows slithering pits to detect others of their kind. <br/><br/><b>Breach Vulnerability (Su)</b> If a slithering pit consumes an extradimensional space, such as one created by a bag of holding, a handy haversack, or a portable hole, the competing energies cause violent spasms that deal 2d6 points of damage to the slithering pit each round it contains the item. If killed in this way, the slithering pit explodes; anything trapped within the ooze takes 2d6 points of damage and is ejected to a random empty space within 30 feet of the slithering pit. <br/><br/><b>Pit (Su)</b> As a standard action, a slithering pit can cause its surface to open into an extradimensional space in order to capture and digest food. A slithering pit can use this ability only while on a solid horizontal surface of sufficient size to support it. The extradimensional space created by this ability is 10 feet deep, and any Medium or smaller creatures stepping into its space must succeed at a DC 15 Reflex save or fall into the pit, taking 1d6 points of damage from the fall. A slithering pit can also actively try to trap creatures by moving into their space. A target of this attack can make an attack of opportunity, but immediately falls into the extradimensional space following the attack. If the target forgoes this attack of opportunity, it can attempt a Reflex save to avoid falling into the extradimensional space as if it had wandered into the slithering pit’s space. At any one time, a slithering pit can contain up to one Medium creature, two Small creatures, or four Tiny creatures. The save DC is Constitution-based. The interior surface of the pit is as hard as rough stone. While the pit is open, a creature inside can climb out with a successful DC 15 Climb check. A slithering pit can close its extradimensional space as a move action, trapping a creature inside. A trapped creature takes 1 point of acid damage each round it remains in the extradimensional space. A creature thus trapped can attack the walls of the space to damage the slithering pit. The walls have an AC of 10 and hardness 8. A slithering pit can forcibly eject the contents of its extradimensional space as a standard action, dealing 1d6 points of damage to creatures inside. Ejected creatures end up in a random square adjacent to the slithering pit. If a slithering pit is killed, its extradimensional space collapses and ejects its contents immediately. <br/><br/><b>Transparent (Ex)</b> A slithering pit is difficult to discern from its surroundings in most environments. The slithering pit gains a +8 racial bonus on Stealth checks and can move at full speed without taking a penalty on Stealth checks. A creature that fails to notice a slithering pit and walks into it risks falling into its pit (if its pit is open) or taking damage as if struck by the slithering pit’s tentacle attack."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Bizarre oozes born from magical mishaps, slithering pits use their naturally occurring extradimensional spaces to attack and trap prey. An extradimensional breach coats the top surface of these oozes, and the creatures prowl lazily, hunting for well-traveled routes and then quietly lying down for hours—or even days—until tasty morsels literally fall into their waiting grasps. Like most oozes, slithering pits lack true mouths and any digestive organs. While they can trap creatures within their extradimensional wells, they must wait for their prey to dissolve in digestive acids before they can absorb any nutrition. Luckily, slithering pits can survive for weeks between feedings, and in lean times they can even hibernate for months, appearing to be nothing but a slick spot in an alleyway or a shallow puddle. <br/><br/>Slithering pits frequent ruins and neglected urban areas, where their transparency allows them to blend in with the shadows of darkened alleys and crumbling corridors. No thicker than a few inches at the center, slithering pits are difficult to distinguish from natural features when immobile. Their slimy exteriors pick up debris and rubble as they stalk, further helping them blend into city streets and ruined floors. Beyond their mobility and slight thickness, slithering pits’ only revealing feature is their shiny mucus, which leaves a glistening trail wherever the creatures travel—but even this dries up and flakes away in a few hours once the ooze settles in at a favored ambush site. While slithering pits are camouflaged on top, their undersides reveal their true appearance: moist and decorated in scintillating patterns of red, green, and blue. Slithering pits are 5 feet in diameter and weigh less than 20 pounds. <br/><br/>As ambush predators, slithering pits are most successful when inactive. Because of their transparent appearances, most slithering pits are hardly noticed or are mistaken for shallow puddles by locals. When periods between feedings grow too long, the oozes become more aggressive. Despite their usually patient tactics, slithering pits become vicious when hungry or threatened, lashing out with a thin pseudopod from their perimeter. When desperate, they dispense with stealth and attempt to drag prey into their maws or throw themselves beneath stumbling feet. The fall into the pit is often enough to kill their prey; those who survive the fall instead die from being slowly digested if they can’t quickly clamber back out. These creatures even show rudimentary strategy, sometimes trapping a child or small animal, whose cries for help eventually draw larger victims. <br/><br/>A slithering pit’s inner well functions much like a <i>bag of holding</i>, allowing it to carry more prey than its small body could normally contain and potentially feeding it for months after a good hunting season. Anyone or anything inside moves along with the ooze wherever it travels without any sense of outside momentum. <br/><br/>A slithering pit can sometimes come into existence when an intelligent ooze—in most cases, a slithering tracker (<i>Pathfinder RPG Bestiary 2</i> 250)—consumes a <i>bag of holding</i> or another magic item that makes use of extradimensional spaces. The residual magical energies are infused within the ooze, and when it dies, the ooze’s remaining material is reborn as a slithering pit. <br/><br/>Slithering pits become dangerous urban blights as they prowl congested cities and cramped slums. They especially flourish in decaying or neglected areas, where potholes filled with water are overlooked. In areas plagued by crime, slithering pits are sometimes used to dispose of bodies. Some clever and opportunistic creatures— especially those immune to the pit’s digestive acids—sometimes use slithering pits as roaming lairs, dragging their own kills into the oozes’ cave-like interiors to share leftovers, and scavenging the freely available prey that the oozes trap. Some spellcasters consider the mucus of a slithering pit to be an ideal component for magic concerned with interdimensional travel and storage. <br/><br/>Those researching these oozes claim that there are different varieties of slithering pits. Scattered reports exist of slithering pits that are much larger, sometimes stretching across an entire narrow street or setting up an ambush in the opening of a wide alley. Some lurk within the darkened expanses of warehouses or beneath boardwalks in dockside settlements. Scholars are unclear whether these larger oozes are simply regular slithering pits that have fed and lived long enough to grow, or if they form when larger oozes consume more powerful magic items."
        }
    ],
    "html": "<i>Weathered cobblestones give way to a deep, rough pit, the edges of which wriggle and contract of their own accord.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Slithering Pit",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 3
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 2
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "blindsight 60 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "breach sense"
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Ooze",
            "size": "Medium",
            "alignment": "Neutral",
            "alignment_text": "N",
            "cr": "2",
            "xp": 600
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 13,
                "touch": 13,
                "flat-footed": 10,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+3 Dex"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 5
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 4
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": -2
                }
            },
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "acid"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "ooze traits"
                }
            ],
            "weaknesses": [
                {
                    "type": "stat_block_section",
                    "subtype": "weakness",
                    "name": "breach vulnerability"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "10 ft.",
                        "movement_type": "walk",
                        "value": 10
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "tentacle",
                    "bonus": [
                        5
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4+4"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "pull"
                        }
                    ]
                }
            ],
            "space": "5 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "10 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "pit"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "tentacle"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "5 ft."
                        }
                    ],
                    "name": "pull"
                }
            ],
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 2
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "value": 5
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "value": 18
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 16,
            "dex": 16,
            "con": 19,
            "int": 2,
            "wis": 5,
            "cha": 1,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "Stealth"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "Perception"
                        }
                    ],
                    "name": "Skill Focus",
                    "link": {
                        "type": "link",
                        "name": "Skill Focus (Stealth",
                        "alt": "Skill Focus (Stealth",
                        "href": "FeatDisplay.aspx?ItemName=Skill%20Focus"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 2
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 15
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+8 Stealth"
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "transparent"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Bestiary 6",
            "link": {
                "type": "link",
                "name": "Bestiary 6 pg. 254",
                "alt": "Bestiary 6 pg. 254",
                "href": "http://paizo.com/products/btpy9oge?Pathfinder-Roleplaying-Game-Bestiary-6-Hardcover%0D%0A"
            },
            "page": 254
        },
        {
            "type": "source",
            "name": "Pathfinder #97: In Hell's Bright Shadow",
            "link": {
                "type": "link",
                "name": "Pathfinder #97: In Hell's Bright Shadow pg. 88",
                "alt": "Pathfinder #97: In Hell's Bright Shadow pg. 88",
                "href": "http://paizo.com/products/btpy9g0q?Pathfinder-Adventure-Path-97-In-Hells-Bright-Shadow%0D%0A"
            },
            "page": 88
        }
    ]
}