{
    "name": "Hooded Harbinger",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any<br/><b>Organization</b> solitary<br/><b>Treasure</b> none"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Bloodless Touch (Ex)</b> When a hooded harbinger makes a melee touch attack, its target must attempt a DC 23 Fortitude save. If the save is successful, the victim takes 2d6+8 points of damage and is wracked by pain for 1 round, gaining the staggered condition. It is thereafter immune to that hooded harbinger’s bloodless touch for 1 day. On a failed save, the portion of the victim’s body that is touched begins to swell and turn purplishblack as the blood flow to it is restricted. This effect deals 4d6+12 points of damage per round and the victim gains the staggered and sickened conditions from the intense pain. After 1d4 rounds, the victim can attempt a new saving throw each round to try and end the effect. The effect can be ended sooner by a heal spell or a successful DC 23 Heal check. The Heal check requires a precise incision to the affected flesh, and consequently deals 2d6 points of bleed damage to the victim as the pressure of the entrapped blood flow is released. Once a victim has been affected by a bloodless touch, it can’t be affected by another until the effects of the first one have ended. If the effects are ended by a successful save, then that individual is immune to further bloodless touch attacks by that hooded harbinger for 1 day. The bloodless touch attack of a hooded harbinger affects only living creatures with recognizable physiology and a blood supply. Undead, oozes, most constructs, and creatures that are not subject to precision damage are immune to bloodless touch. The save DC is Constitution-based.<br/><br/><b>Manifest Yellow Sign (Sp)</b> Once per day, a hooded harbinger can trace a mystical pattern in the air, causing a glowing, immaterial image of the Yellow Sign to appear before it. This image remains in place for 1d4 minutes. Any creatures within 100 feet who is able to see the sign (it glows as per <i>light</i>) must succeed at a DC 23 Will save or be confused for as long as the sign persists. The sign can be erased with <i>dispel chaos</i>, <i>dispel evil</i>, <i>dispel magic</i>, or <i>erase</i> with a successful DC 26 caster level check. Anyone under the effects of the Yellow Sign will not act against the hooded harbinger in any way, though that does not mean that they will follow its commands. The save DC is Charisma-based and includes a +2 racial bonus. This is a mind-affecting compulsion effect.<br/><br/><b>Profane Reek (Su)</b> The musty, carrion stench wafting from the foul folds of a hooded harbinger’s rags extends in a 5-foot radius, creating an aura of obscene influence around the creature. This terrible smell gives a hooded harbinger a profane bonus to its AC equal to its Charisma modifier. In addition, any breathing creature that enters this cloud must succeed at a DC 21 Fortitude save or be affected as though under the mental effects of a <i>mind fog</i> spell for as long as it remains within the profane reek’s area of effect and for 2d4 rounds after it leaves. A creature that succeeds at its save is immune to the <i>mind fog</i> effect of that hooded harbinger’s profane reek for 1 day. The save DC is Charisma-based.<br/><br/><b>Prophetic Utterance (Su)</b> Three times per day as an immediate action, a hooded harbinger can mutter a prophetic utterance against any single creature within 100 feet that has just dealt damage to it. This mutter is unintelligible to anyone but the target, which hears the utterance as a telepathic message pronouncing its doom. The target is immediately affected by a <i>doom</i> spell (no save) for the next hour or until the utterance is successfully dispelled (requiring a successful DC 26 caster level check).<br/><br/><b>Terrible Visage (Su)</b> A hooded harbinger never reveals its face. Only if slain or rendered helpless can anyone attempt to remove the hood and reveal the harbinger’s true visage. However, as layers of the stinking, rotten wrappings around its face are peeled back or cut away, new layers are found beneath. These many filth-crusted layers can be removed only with 1d4+2 rounds of effort. If they are successfully removed, only those adjacent to the creature can see the revealed countenance and anyone able to do so must succeed at a DC 21 Will save or be affected by an <i>insanity</i> spell. Those who succeed at their saves are unaffected, as their minds mercifully erase the image from their memories. Those cured of the insanity receive the same relief. Immediately after the hooded harbinger’s face is revealed, its body explodes in a massive flash of light and concussive force that completely obliterates all evidence of it. Anyone within 10 feet of the corpse when it explodes takes 6d10 points of force damage (Reflex DC 23 half) and must attempt two DC 23 Fortitude saves, one against blindness and one against deafness (both as per <i>blindness/deafness</i>). The save DC to resist the insanity effect is Charisma-based, and the save DCs to resist the explosion’s effects are Constitution-based."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "It is said that the Crawling Chaos is the messenger of the Great Old Ones, but whether this is by their command or his own whim is debatable. Regardless of why, the Great Old One known as Hastur sometimes instead relies on his hooded harbingers to relay messages to his far-flung cults and even to the High Priest Not To Be Described of mystery-shrouded Leng. These dread figures swathed in filthy yellow rags bear the whispered tidings of their Unnamed Lord. There are those who even speculate that the veiled priest of Leng is actually the greatest of the hooded harbingers, who gained some measure of autonomy—but the truth of this remains unknown. Thought to have originated in distant Carcosa by unthinkable means, hooded harbingers are exceedingly rare, and seldom is more than one encountered at a time.<br/><br/>Though tasked with the menial role of messengers, hooded harbingers take their charge very seriously. Infused with the hateful potency of their master, they are able to call upon many terrible powers in defense of their duties. When forced into combat, they prefer to trip opponents with the trailing ends of their ragged arm coverings and administer their bloodless touch to as many victims as possible. They always attempt to use <i>plane shift</i> to flee if in danger of imminent defeat.<br/><br/>Serving as messengers for Hastur, hooded harbingers receive the communications they deliver directly from the Great Old One via mental transmission. Upon receiving the message, the hooded harbinger twitches and shakes as if it were having a seizure. During this time they are particularly dangerous, because if they are attacked or distracted in any way, they fly into a furious rage and the offender risks attracting the attention of the King in Yellow.<br/><br/>No one has seen a hooded harbinger’s face and lived to describe it. If its hood is pulled back, the creature’s head is seen to be completely swathed in the same filthy rags that cover its body. If it is helpless, the rags can be unraveled, but each layer only gives way to dozens of layers of the tattered yellow cloth. Eventually, a face is revealed, but it appears to be the face of the unraveler. If she is lucky, her memories are immediately wiped clean. If she is less fortunate or less able to forget, she is driven insane."
        }
    ],
    "html": "<i>This creature resembles a mummified humanoid swathed in filthy, sallow rags. Its stooped posture and ragged coverings make its height hard to judge. Its arms appear abnormally long, or perhaps dislocated and hanging freely. A hood of the same jaundiced fabric obscures its face.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Hooded Harbinger",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 8
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 21
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "see invisibility"
            }
        ],
        "auras": [
            {
                "type": "stat_block_section",
                "subtype": "aura",
                "name": "profane reek",
                "saving_throw": {
                    "type": "stat_block_section",
                    "subtype": "save_dc",
                    "text": "DC 21",
                    "dc": 21
                }
            },
            {
                "type": "stat_block_section",
                "subtype": "aura",
                "name": "unnatural aura",
                "range": {
                    "type": "stat_block_section",
                    "subtype": "range",
                    "text": "30 ft.",
                    "range": 30,
                    "unit": "feet"
                }
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Aberration",
            "size": "Medium",
            "alignment": "Chaotic Evil",
            "alignment_text": "CE",
            "cr": "12",
            "xp": 19200
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 27,
                "touch": 17,
                "flat-footed": 23,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+4 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+10 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+3 profane"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 12
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 11
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 13
                }
            },
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 10,
                    "text": "10/lawful and slashing",
                    "conjunction": "and",
                    "damage_types": [
                        "lawful",
                        "slashing"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "death effects"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "mind-affecting effects"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "poison"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "cold"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 23
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 2,
                    "name": "slams",
                    "bonus": [
                        20
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d6+8"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "trip"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "touch",
                    "bonus": [
                        20
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "bloodless touch"
                        }
                    ]
                }
            ],
            "space": "5 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "10 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "DC 21"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "command undead only"
                        }
                    ],
                    "name": "channel negative energy 3/day"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "manifest Yellow Sign"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "prophetic utterance"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Spell-Like Abilities",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "see invisibility"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "tongues"
                                    }
                                ],
                                "count_text": "Constant",
                                "frequency": "Constant"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "detect good"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "detect law"
                                    }
                                ],
                                "count_text": "At will",
                                "frequency": "At will"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "confusion",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 17",
                                            "dc": 17
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "mass hold person",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 20",
                                            "dc": 20
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "plane shift"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "silence",
                                        "saving_throw": {
                                            "type": "stat_block_section",
                                            "subtype": "save_dc",
                                            "text": "DC 15",
                                            "dc": 15
                                        }
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "teleport",
                                        "modifiers": [
                                            {
                                                "type": "stat_block_section",
                                                "subtype": "modifier",
                                                "name": "self plus 50 lbs. of objects only"
                                            }
                                        ]
                                    }
                                ],
                                "count_text": "3/day",
                                "count": 3,
                                "frequency": "day"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "freedom of movement"
                                    }
                                ],
                                "count_text": "1/day",
                                "count": 1,
                                "frequency": "day"
                            }
                        ],
                        "caster_level": 15,
                        "concentration": 18
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 12
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "value": 20
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "value": 34
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 26,
            "dex": 18,
            "con": 21,
            "int": 16,
            "wis": 13,
            "cha": 17,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Bleeding Critical",
                    "link": {
                        "type": "link",
                        "name": "Bleeding Critical",
                        "alt": "Bleeding Critical",
                        "href": "FeatDisplay.aspx?ItemName=Bleeding%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Casting",
                    "link": {
                        "type": "link",
                        "name": "Combat Casting",
                        "alt": "Combat Casting",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Casting"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Combat Reflexes",
                        "alt": "Combat Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Command Undead",
                    "link": {
                        "type": "link",
                        "name": "Command Undead",
                        "alt": "Command Undead",
                        "href": "FeatDisplay.aspx?ItemName=Command%20Undead"
                    },
                    "notation": "B"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Critical Focus",
                    "link": {
                        "type": "link",
                        "name": "Critical Focus",
                        "alt": "Critical Focus",
                        "href": "FeatDisplay.aspx?ItemName=Critical%20Focus"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Great Fortitude",
                    "link": {
                        "type": "link",
                        "name": "Great Fortitude",
                        "alt": "Great Fortitude",
                        "href": "FeatDisplay.aspx?ItemName=Great%20Fortitude"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "slam"
                        }
                    ],
                    "name": "Improved Critical",
                    "link": {
                        "type": "link",
                        "name": "Improved Critical (slam)",
                        "alt": "Improved Critical (slam)",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative",
                    "link": {
                        "type": "link",
                        "name": "Improved Initiative",
                        "alt": "Improved Initiative",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Initiative"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Iron Will",
                        "alt": "Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Lightning Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Lightning Reflexes",
                        "alt": "Lightning Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Lightning%20Reflexes"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Acrobatics",
                        "value": 24
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Climb",
                        "value": 28
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Escape Artist",
                        "value": 24
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Intimidate",
                        "value": 31
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Knowledge (religion)",
                        "value": 27
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 21
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 24
                    }
                ],
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+4 Knowledge (religion)"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "racial_modifier",
                        "name": "+8 Intimidate"
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Aklo"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    }
                ],
                "communication_abilities": [
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "telepathy",
                        "range": {
                            "type": "stat_block_section",
                            "subtype": "range",
                            "text": "100 ft.",
                            "range": 100,
                            "unit": "feet"
                        }
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "communication_ability",
                        "name": "tongues"
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "terrible visage"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Pathfinder #112: The Whisper Out of Time",
            "link": {
                "type": "link",
                "name": "Pathfinder #112: The Whisper Out of Time pg. 88",
                "alt": "Pathfinder #112: The Whisper Out of Time pg. 88",
                "href": "http://paizo.com/products/btpy9q9o?Pathfinder-Adventure-Path-112-The-Whisper-Out-of-Time%0D%0A"
            },
            "page": 88
        }
    ]
}