{
    "name": "Kakuen-Taka",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any (the Worldwound)<br/><b>Organization</b> solitary, patrol (1 swarm with 1 flesh mansion and 1d4 carrionstorms), or gang (1d3 patrols)<br/><b>Treasure</b> incidental"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Consume Flesh (Su)</b> Once per round, when a kakuen-taka kills or reduces a creature to negative hit points with its swarm attack, it automatically attempts to consume the target's flesh as a free action (Fortitude DC 24 negates). If the target fails its save, its body is destroyed and the kakuen-taka gains the benefits of a <i>death knell </i>spell. This is a death attack.<br/><br/><b>Create Carrionstorm (Ex)</b> As a full-round action at sunrise, a kakuen-taka (a bhoga swarm with a flesh mansion) can create 1d4 carrionstorms (see page 408 of the <i>Rise of the Runelords Anniversary Edition</i>). These carrionstorms have a blinding poison in addition to their swarm attack. The carrionstorms are not under the control of the kakuen-taka but instinctively follow it, attacking minor foes while the kakuen-taka destroys greater threats. If the flesh mansion is destroyed and the kakuen-taka does not create another one within 24 hours, the carrionstorms are destroyed. Any carrionstorms in excess of four wander away from the kakuen-taka and are automatically destroyed 24 hours later.<br/><br/><i>Carrionstorm Poison (Ex) </i>Swarm—injury; <i>save </i>Fort DC 12, <i>frequency </i>1/round for 6 rounds, <i>effect </i>permanent blindness, <i>cure </i>2 consecutive saves. The save DC is Constitution-based (using the carrionstorm's Constitution).<br/><br/><b>Dimensional Snare (Su)</b> Any creature affected by the kakuentaka's swarm attack must succeed at a DC 21 Will save or be affected by <i>dimensional anchor </i>for 1 round. This save is Charisma-based.<br/><br/><b>Flesh Mansion (Ex)</b> A kakuen-taka's bhoga swarm normally inhabits a hollowed-out reconfigured corpse called a flesh mansion, which it uses as a shelter, vehicle, and war machine. When the swarm wears a flesh mansion, it uses the above stat block (unlike a normal swarm, the flesh mansion's slam attacks have reach and threaten squares within its reach). As a standard action, the swarm can abandon its flesh mansion (which falls inert in its square), inhabit an empty flesh mansion, hide within its flesh mansion (gaining cover against all opponents but still being able to use its swarm attack), or stop hiding within the flesh mansion. If the flesh mansion is destroyed, the swarm can create another by performing a ritual that requires 1 hour and the corpse of a Huge creature. The flesh mansion is not a separate creature, nor is it undead; it is merely a corpse the swarm manipulates. Without a flesh mansion, the bhoga swarm's statistics are CE Diminutive outsider (chaotic, evil, extraplanar, swarm); <b>AC </b>22, touch 21, flat-footed 15; <b>Defensive Abilities </b>swarm traits; <b>Melee </b>swarm (5d6 plus dimensional snare and distraction); <b>Reach </b>0 ft.; <b>Str </b>1; <b>CMB </b>—; <b>CMD </b>— (can't be tripped); Stealth +32.<br/><br/><b>Fleshy Shield (Ex)</b> A newly created flesh mansion has 150 hit points. The swarm takes only half damage from all attacks that deal hit point damage, with the remainder taken by the flesh mansion. Because a swarm of Diminutive creatures is immune to all weapon damage, apply half of all weapon damage to the fleshy shield and ignore the half that would be applied to the swarm. When the flesh mansion reaches 0 hit points, it is destroyed and the swarm functions like a normal swarm (see Flesh Mansion above). A kakuen-taka can repair a damaged flesh mansion by spending a full-round action grafting a corpse into it (restoring 5 hit points for a Small corpse, 10 for Medium, 20 for Large, 50 for Huge)."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "In the far northern lands bordering on the Worldwound, a strange and terrifying menace plagues the tundra and prairie—shambling fleshy abominations called kakuentaka, the Hunger That Moves. They wander the desolate emptiness of the subpolar wilds, a living manifestation of the Worldwound’s taint whose horrific onset is presaged by a sour-sweet wind and wheeling, screaming flocks of undead birds. The lucky victims of the birds’ blinding poison are spared the sight of the rumbling juggernauts of putrefying meat driven like siege engines by a swarm of fiends called bhogas. Individually these fiends have little wit or skill, but together they have a malign intellect that allows them to construct mobile nests out of dead flesh like morbid termites building a mound.<br/><br/>The bhogas find a giant, mammoth, or other creature of great size and devour its organs, usually while the creature is still alive and trying to resist. Once the creature is dying or dead, the fiends reconfigure the corpse’s remaining flesh and bone into a hideous, multilegged pillar, which they then invade and inhabit like a hollow tree. Some of the bhogas use their collective strength to move the fleshy mansion’s limbs while the rest clamber about its walls or skulk underneath it, searching for new prey to terrorize and consume. This monstrosity attracts birds the fiends animate as flesh-craving undead swarms. Together, the three components of this peculiar ecology stalk the demontainted lands. If a healthy swarm discovers another suitable corpse, the fiends engage in a frenzy of mating, build a second flesh mansion, split into two swarms, then rapidly give birth to fill all the available space in their new home.<br/><br/>When a flesh mansion becomes so rotted that it cannot maintain its structure or the swarm cannot easily move it, the bhogas abandon their creation and seek out another, leaving behind a monstrous, decaying shell, unrecognizable as the living creature it once was. Necromancers can use the husk for parts or animate the entire thing as a new abomination. Desperate ghouls, zombies, or animals might feed on it and become tainted by its latent Abyssal energies.<br/><br/>As much a plague upon demons as upon the mortal races, kakuen-taka have no true allies. Perhaps this accounts for their constant wandering and their fondness for desolate and isolated locales, far from any that might interfere with their feasting. Rarely, a powerful demon might enslave one with magic and use the swarm’s dimensional snare ability to capture and kill its rivals. Driven out of the central part of the Worldwound by more intelligent and organized demons, kakuen-taka have become a recurring plague in the southern fringes of the territory, below Storasta and abutting the borders with Numeria and Ustalav. In these lonely moors and hills, kakuen-taka regularly eradicate patrols and entire settlements. None of the adjacent countries values the empty lands highly enough to risk major resources to stamp them out.<br/><br/>Kakuen-taka are indifferent to their own kind and attack each other only if one swarm has a flesh mansion and the other does not. Given adequate food, several kakuen-taka might travel together to tear apart larger prey, but over time they usually wander apart, following their separate carrionstorms, and have no sense of loyalty toward their former comrades."
        }
    ],
    "html": "<i>Within a towering structure of bone and rotting flesh lurk hundreds of flittering fiends.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Kakuen-Taka",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 10
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 31
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Outsider",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "chaotic"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "evil"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "extraplanar"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "swarm"
                }
            ],
            "size": "Huge",
            "alignment": "Chaotic Evil",
            "alignment_text": "CE",
            "cr": "14",
            "xp": 38400
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 16,
                "touch": 15,
                "flat-footed": 9,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+6 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+1 dodge"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+1 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-2 size"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 17
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 20
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 10
                }
            },
            "defensive_abilities": [
                {
                    "type": "stat_block_section",
                    "subtype": "defensive_ability",
                    "name": "fleshy shield"
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "poison"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "acid"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "cold"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "electricity"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "fire"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 25
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "30 ft.",
                        "movement_type": "walk",
                        "value": 30
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "swarm",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "5d6"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "dimensional snare"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "distraction"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 2,
                    "name": "slams",
                    "bonus": [
                        19
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "5d6"
                        }
                    ]
                }
            ],
            "space": "15 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "10 ft. with slam"
                    }
                ],
                "value": "0 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "consume flesh"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "5d6"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "DC 20"
                        }
                    ],
                    "name": "trample"
                }
            ],
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 21
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "value": 23
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "can’t be tripped"
                    }
                ],
                "value": 40
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 10,
            "dex": 23,
            "con": 16,
            "int": 6,
            "wis": 13,
            "cha": 13,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "consume flesh"
                        }
                    ],
                    "name": "Ability Focus",
                    "link": {
                        "type": "link",
                        "name": "Ability Focus (consume flesh)",
                        "alt": "Ability Focus (consume flesh)",
                        "href": "FeatDisplay.aspx?ItemName=Ability%20Focus"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Dodge",
                    "link": {
                        "type": "link",
                        "name": "Dodge",
                        "alt": "Dodge",
                        "href": "FeatDisplay.aspx?ItemName=Dodge"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Great Fortitude",
                    "link": {
                        "type": "link",
                        "name": "Great Fortitude",
                        "alt": "Great Fortitude",
                        "href": "FeatDisplay.aspx?ItemName=Great%20Fortitude"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative",
                    "link": {
                        "type": "link",
                        "name": "Improved Initiative",
                        "alt": "Improved Initiative",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Initiative"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Improved Iron Will",
                        "alt": "Improved Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Iron Will",
                    "link": {
                        "type": "link",
                        "name": "Iron Will",
                        "alt": "Iron Will",
                        "href": "FeatDisplay.aspx?ItemName=Iron%20Will"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Lightning Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Lightning Reflexes",
                        "alt": "Lightning Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Lightning%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Run",
                    "link": {
                        "type": "link",
                        "name": "Run",
                        "alt": "Run",
                        "href": "FeatDisplay.aspx?ItemName=Run"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "Perception"
                        }
                    ],
                    "name": "Skill Focus",
                    "link": {
                        "type": "link",
                        "name": "Skill Focus (Perception)",
                        "alt": "Skill Focus (Perception)",
                        "href": "FeatDisplay.aspx?ItemName=Skill%20Focus"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Step Up",
                    "link": {
                        "type": "link",
                        "name": "Step Up",
                        "alt": "Step Up",
                        "href": "FeatDisplay.aspx?ItemName=Step%20Up"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Toughness",
                    "link": {
                        "type": "link",
                        "name": "Toughness",
                        "alt": "Toughness",
                        "href": "FeatDisplay.aspx?ItemName=Toughness"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Acrobatics",
                        "value": 30
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Intimidate",
                        "value": 25
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 31
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Stealth",
                        "value": 12
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Survival",
                        "value": 11
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Abyssal"
                    }
                ]
            }
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Inner Sea Bestiary",
            "link": {
                "type": "link",
                "name": "Inner Sea Bestiary pg. 20",
                "alt": "Inner Sea Bestiary pg. 20",
                "href": "http://paizo.com/products/btpy8v2x?Pathfinder-Campaign-Setting-Inner-Sea-Bestiary%0D%0A"
            },
            "page": 20
        }
    ]
}