{
    "name": "Giant Hook Fly",
    "type": "monster",
    "sections": [
        {
            "name": "Description",
            "type": "section",
            "html": "Giant hook flies are terrifying, overgrown insects that thrive on their victims’ fresh blood. In particular, giant hook flies are known for their rampant breeding and fast gestation period. Their reproduction is tied to the blood they drain from victims; the more blood they drink, the quicker they can expel their young—which are threats on their own.<br/><br/>Giant hook flies and their parasitic broods can be found anywhere, from a nest in an abandoned barn to the depths of a neglected basement to untold stretches of wilderness. Naturally, they are attracted to blood, so any place where blood is spilled can become a hook fly breeding ground. Butchers and livestock farmers, in particular, must stay vigilant against these dangerous pests, as even the sighting of a single juvenile hook fly might herald a terrible infestation just weeks or even days away. Blood cultists, too, sometimes find that giant hook flies and their spawn are unwelcome visitors to their lairs. On more than one occasion, giant hook flies and their swarms have unwittingly driven evil creatures from their hiding places, surreptitiously aiding a populace shocked that the cultists have been operating in their midst the entire time. Left unchecked, giant hook flies can overrun small farms or other rural places where individuals capable of ending these infestations might be scarce.<br/><br/>That said, giant hook flies are not particularly compelled to stay together, even if they were members of the same brood. In the absence of a strong blood scent to follow, a swarm of juvenile hook flies moves randomly until it finds a secluded area in which to build its cocoon. Once the adults hatch, each of the unintelligent vermin drifts aimlessly, seeking the scent of blood. However, once rooted, giant hook fly populations can prove maddeningly difficult to fully eliminate. Rumor has it that swarms can be dispersed only with gouts of flame; otherwise enough juvenile hook flies survive for the swarm to reform—and surviving swarms inevitably build cocoons that yield fully formed and dangerous new giant hook flies. A common rural saying goes, “If you haven’t killed hook flies with fire, you haven’t really killed them at all.”<br/><br/>The process of spawning a hook fly swarm typically kills the swarm’s parent. Those that survive normally live up to another 6 months, but the damage to their abdomens leaves them unable to spawn again. However, tales tell of particularly enormous and resilient giant hook flies that live much longer life spans and take minimal damage from spawning their broods—meaning they can spawn again. Worse, these creatures are said to expel two brood swarms at a time."
        }
    ],
    "html": "<i>This enormous, horrifically bloated fly has a proboscis shaped like a serrated hook. Its many-faceted eyes smolder like hot coals.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Giant Hook Fly",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 1
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 0
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Vermin",
            "size": "Small",
            "alignment": "Neutral",
            "alignment_text": "N",
            "family": "Hook Fly",
            "cr": "2",
            "xp": 600
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 14,
                "touch": 12,
                "flat-footed": 13,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+1 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+2 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+1 size"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 5
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 2
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 1
                }
            },
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "mind-affecting effects"
                }
            ]
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "20 ft.",
                        "movement_type": "walk",
                        "value": 20
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "average<br/>"
                            }
                        ],
                        "name": "fly 60 ft.",
                        "movement_type": "fly",
                        "value": 60
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "bite",
                    "bonus": [
                        3
                    ],
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "1d4"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "attach"
                        }
                    ]
                }
            ],
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "death throes"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "spawn brood"
                }
            ],
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 2
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+9 grapple when attached"
                    }
                ],
                "value": 1
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "20 vs. trip"
                    }
                ],
                "value": 12
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 11,
            "dex": 13,
            "con": 14,
            "int": null,
            "wis": 11,
            "cha": 2,
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Fly",
                        "value": 3
                    }
                ]
            }
        },
        "ecology": {
            "name": "Ecology",
            "type": "stat_block_section",
            "subtype": "ecology",
            "environment": "any",
            "organization": "solitary, pair, or cloud (3–6)",
            "treasure": "none"
        },
        "special_abilities": [
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "name": "Attach",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex",
                "text": "When a giant hook fly hits with a bite attack, it latches onto the target, anchoring the target in place. An attached hook fly is effectively grappling its prey. The hook fly loses its Dexterity bonus to AC and has an AC of 13 (touch 11), but holds on with great tenacity and inserts its proboscis into the grappled target’s flesh. A giant hook fly has a +8 racial bonus on combat maneuver checks to maintain its grapple on a foe once it is attached. An attached hook fly can be struck with a weapon or grappled itself; if its prey manages to succeed at a grapple combat maneuver check or Escape Artist check against it, the hook fly is removed."
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "name": "Death Throes",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex",
                "text": "If a giant hook fly dies after draining blood with its spawn brood ability but before disgorging a hook fly swarm, its swollen abdomen bursts, sending dead hook flies in every direction. Their tiny hooks deal 2d4 points of slashing damage to all creatures within 10 feet. A successful DC 13 Reflex save halves the damage. The save DC is Constitution-based."
            },
            {
                "type": "stat_block_section",
                "subtype": "special_ability",
                "name": "Spawn Brood",
                "ability_type": "Extraordinary",
                "ability_type_abbrev": "Ex",
                "text": "A giant hook fly drains blood at the end of its turn if it is attached to a foe, dealing 1d2 points of Constitution damage. When a giant hook fly drains blood, its abdomen becomes bloated as it spawns an enormous brood of young. It gestates these flies in its abdomen until it has dealt 6 points of Constitution damage with this ability. The following round, the giant hook fly detaches from its victim, and as a standard action that provokes attacks of opportunity, its abdomen ruptures and disgorges a hook fly swarm. The swarm appears adjacent to the giant hook fly and immediately attacks any nearby foes (it ignores the giant hook fly that spawned it). When its abdomen ruptures, the giant hook fly takes 3d6 points of slashing damage. Blood stored in a giant hook fly’s abdomen is absorbed after 24 hours and cannot be used to spawn a brood."
            }
        ]
    },
    "sources": [
        {
            "type": "source",
            "name": "Gallows of Madness",
            "link": {
                "type": "link",
                "name": "Gallows of Madness pg. 60",
                "alt": "Gallows of Madness pg. 60",
                "href": "http://paizo.com/products/btpy9nfu/discuss&page=last?Pathfinder-Module-Gallows-of-Madness%0D%0A"
            },
            "page": 60
        }
    ]
}