{
    "name": "Squamous Demodand",
    "type": "monster",
    "sections": [
        {
            "name": "Ecology",
            "type": "section",
            "html": "<b>Environment</b> any (Abyss)<br/><b>Organization</b> solitary or battalion (2-5 plus 1 shaggy demodand plus 3-12 tarry demodands)<br/><b>Treasure</b> standard"
        },
        {
            "name": "Special Abilities",
            "type": "section",
            "html": "<b>Abyssal Roar (Su)</b> Once every 1d4 rounds as a standard action, a squamous demodand can harness the intense Abyssal power roiling within its body and release a furious roar upon its enemies. This functions like a breath weapon that deals 20d6 points of sonic damage in a 40-foot cone as pure cacophonous evil assaults the ears of creatures in the area. A target can attempt a DC 31 Fortitude saving throw for half damage. Creatures that fail the saving throw are also permanently deafened. Because of the evil and extraplanar nature of this attack, a remove blindness/deafness spell can negate this deafness only if the caster succeeds at a DC 31 caster level check, but limited wish or any stronger similar magic can cure the deafness without requiring such a check. The saving throw is Constitution-based.<br/><br/><b>Stunning Descent (Su)</b> Three times per day, when a squamous demodand has used a move action to fly, as a standard action it can land on a solid surface and slam its feet mightily, releasing a wave of kinetic energy. All creatures within 60 feet (whether on the surface or in the air) must succeed at a DC 31 Reflex saving throw or be stunned for 1 round and staggered for an additional 3 rounds thereafter. On a successful saving throw, a creature is simply staggered for 1 round. The saving throw is Constitution-based."
        },
        {
            "name": "Description",
            "type": "section",
            "html": "Squamous demodands were among the last of the Abyssal demodands into which the thanatotic titans breathed life. As the Abyss began to crawl with the charred, melted forms of shaggy, slimy, tarry, and other demodands, the early members of this horrific race began to sense a missing element in their masters’ plans. The demodands knew that they were created as a race of worshipers meant to wreak as much destruction as possible on their progenitors’ behalf, and though they wielded great and disgusting powers, the demodands knew that they needed more sheer muscle to truly become a force to be reckoned with in the multiverse. And so the idea for the squamous demodands’ creation came not from their godlike creators but from these sycophantic servants that wished to see the titans’ will made manifest. After the demodands came to an agreement—an uncommon occurrence for the chaotic creatures—that they needed much more powerful allies, the shaggy demodands approached their creators with the idea. Suppressing the urge to quash their upstart creations, the thanatotic titans admitted the merit of creating an enormous, mighty, monstrous type of demodand to serve in their armies as wanton destroyers that would herald the titans’ vision of a godless multiverse. Thus the titans formed squamous demodands by fusing the flesh of shaggy demodands with armor-like scales pulled from the essence of the Abyss itself. Squamous demodands still stand today as the most terrible, hulking, and murderous of their kind.<br/><br/> Because each type of demodand had already found a distinct place in the scattered hierarchy of the titans’ armies— shaggy demodands as generals, slimy demodands as shock troops, and tarry demodands as grunts—the demodands worried that the new creations might supplant them all. To allay these fears and ensure that the mighty squamous demodands would actually obey orders, the titans made their new pets as dim witted as they were ferocious. Instead of serving any subtle tactical function in demodand armies, squamous demodands are pure, unadulterated muscle, and they almost always act at the behest of a higher-ranking shaggy demodand or a thanatotic titan. Towering blocks of claws, muscle, and scales, squamous demodands have four arms and a pair of wings ideal for causing maximum destruction. Squamous demodands stand over 50 feet tall and weigh around 120 tons.<br/><br/> Because they are far less savvy than others of their race, squamous demodands are guided by their baser instincts when left to their own devices. Although they delight in crushing mountains under their fists, their hunger for ever-increasing amounts of flesh and the visceral feeling of blood running down their gaping maws drives them more than anything else. Other demodands—particularly shaggy demodands, which have spent millennia learning how to focus these killer urges— have to make sure that squamous demodands first finish destroying structures that stand in their armies’ way before they are allowed to gorge on their kills.<br/><br/> Demodand generals typically outfit their larger armies with at least one squamous demodand. Adding more of these beasts is sometimes a challenge, for they can easily view each other as rival predators, and squamous demodands turning on each other puts an army at risk. Rarely, shaggy demodands or thanatotic titans put together a battalion of squamous demodands meant to visit abject ruin upon a wide expanse or an opposing army, but such strategic overtures are usually a sign of desperation. Most demodand generals would rather risk massive losses in their ranks than potentially deal with a battalion of their squamous kin blindly raging. That said, a few shaggy demodands still gamble on squamous demodand battalions, likely due to both their sheer destructive efficiency and a well-kept demodand secret: shaggy demodands that earn the most favor from the thanatotic titans are next in line for transformation into squamous demodands.<br/><br/> Due to their low intelligence and their animalistic focus on feeding and destruction, squamous demodands have very little society to speak of, even by Abyssal creatures’ standards. They are content following the orders of shaggy demodands, as long as they are provided with sufficient food and opportunities for obliteration. Occasionally, however, shaggy demodands get caught up in internal feuds or turn on each other. In these cases, squamous demodands typically follow the lead of the general that proves itself the strongest, although a squamous demodand that has followed the orders of a single commander for long spans of time may view its superior protectively, almost as an adult child would an aging parent. These are the situations that often turn most destructive for demodands, as the squamous demodand either defends its general or exacts vengeance on its behalf, causing a massive intrademodand war either way. When this happens, only the thanatotic titans can rein in their monstrous creations, and sometimes even they have trouble doing so if multiple squamous demodands are involved."
        }
    ],
    "html": "<i>This titanic mass of flesh is covered in razor-sharp scales and has bony wings, four taloned arms, and a toothy, toad-like head.</i>",
    "game-obj": "Monsters",
    "stat_block": {
        "name": "Squamous Demodand",
        "type": "stat_block",
        "initiative": {
            "type": "stat_block_section",
            "subtype": "initiative",
            "value": 11
        },
        "perception": [
            {
                "type": "stat_block_section",
                "subtype": "perception",
                "value": 43
            }
        ],
        "senses": [
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "blindsense 30 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "darkvision 60 ft."
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "detect good"
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "detect magic"
            },
            {
                "type": "stat_block_section",
                "subtype": "sense",
                "name": "true seeing"
            }
        ],
        "creature_type": {
            "type": "stat_block_section",
            "subtype": "creature_type",
            "creature_type": "Outsider",
            "creature_subtypes": [
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "chaotic"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "demodand"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "evil"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "creature_subtype",
                    "name": "extraplanar"
                }
            ],
            "size": "Gargantuan",
            "alignment": "Chaotic Evil",
            "alignment_text": "CE",
            "family": "Demodand",
            "cr": "20",
            "xp": 307200
        },
        "defense": {
            "name": "Defense",
            "type": "stat_block_section",
            "subtype": "defense",
            "ac": {
                "name": "AC",
                "type": "stat_block_section",
                "subtype": "armor_class",
                "ac": 36,
                "touch": 13,
                "flat-footed": 29,
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+7 Dex"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+23 natural"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "-4 size"
                    }
                ]
            },
            "saves": {
                "type": "stat_block_section",
                "subtype": "saves",
                "fort": {
                    "name": "Fort",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 23
                },
                "ref": {
                    "name": "Ref",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 23
                },
                "will": {
                    "name": "Will",
                    "type": "stat_block_section",
                    "subtype": "save",
                    "value": 16
                }
            },
            "dr": [
                {
                    "type": "stat_block_section",
                    "subtype": "dr",
                    "value": 15,
                    "text": "15/good and magic",
                    "conjunction": "and",
                    "damage_types": [
                        "good",
                        "magic"
                    ]
                }
            ],
            "immunities": [
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "acid"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "immunity",
                    "name": "poison"
                }
            ],
            "resistances": [
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "cold"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "resistance",
                    "value": 10,
                    "name": "fire"
                }
            ],
            "sr": {
                "type": "stat_block_section",
                "subtype": "sr",
                "value": 31
            }
        },
        "offense": {
            "name": "Offense",
            "type": "stat_block_section",
            "subtype": "offense",
            "speed": {
                "name": "Speed",
                "type": "stat_block_section",
                "subtype": "speeds",
                "movement": [
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "name": "40 ft.",
                        "movement_type": "walk",
                        "value": 40
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "speed",
                        "modifiers": [
                            {
                                "type": "stat_block_section",
                                "subtype": "modifier",
                                "name": "average<br/>"
                            }
                        ],
                        "name": "fly 60 ft.",
                        "movement_type": "fly",
                        "value": 60
                    }
                ]
            },
            "melee": [
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "name": "bite",
                    "bonus": [
                        36
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d8+11"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "effect": "bleed"
                        }
                    ]
                },
                {
                    "type": "stat_block_section",
                    "subtype": "attack",
                    "attack_type": "melee",
                    "count": 4,
                    "name": "claws",
                    "bonus": [
                        36
                    ],
                    "critical_range": "19–20",
                    "damage": [
                        {
                            "type": "stat_block_section",
                            "subtype": "attack_damage",
                            "formula": "2d6+11"
                        }
                    ]
                }
            ],
            "space": "20 ft.",
            "reach": {
                "type": "stat_block_section",
                "subtype": "reach",
                "value": "20 ft."
            },
            "special_attacks": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "Abyssal roar"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "2d6"
                        }
                    ],
                    "name": "bleed"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "DC 27"
                        }
                    ],
                    "name": "faith-stealing strike"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "4 claws"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "2d6+16"
                        }
                    ],
                    "name": "rend"
                },
                {
                    "type": "stat_block_section",
                    "subtype": "special_attack",
                    "name": "stunning descent"
                }
            ],
            "magic": {
                "name": "Magic",
                "type": "stat_block_section",
                "subtype": "magic",
                "spells": [
                    {
                        "name": "Spell-Like Abilities",
                        "type": "stat_block_section",
                        "subtype": "spells",
                        "spell_list": [
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "detect good"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "detect magic"
                                    },
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "true seeing"
                                    }
                                ],
                                "count_text": "Constant",
                                "frequency": "Constant"
                            },
                            {
                                "type": "stat_block_section",
                                "subtype": "spell_list",
                                "spells": [
                                    {
                                        "type": "stat_block_section",
                                        "subtype": "spell",
                                        "name": "summon (level 8, 1d8 tarry demodands or 1d4 slimy demodands or 1 shaggy demodand 75%)"
                                    }
                                ],
                                "count_text": "1/day",
                                "count": 1,
                                "frequency": "day"
                            }
                        ],
                        "caster_level": 20,
                        "concentration": 23
                    }
                ]
            },
            "bab": {
                "type": "stat_block_section",
                "subtype": "bab",
                "value": 29
            },
            "cmb": {
                "type": "stat_block_section",
                "subtype": "cmb",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "+48 bull rush"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "overrun"
                    }
                ],
                "value": 44
            },
            "cmd": {
                "type": "stat_block_section",
                "subtype": "cmd",
                "modifiers": [
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "63 vs bull rush"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "modifier",
                        "name": "overrun"
                    }
                ],
                "value": 61
            }
        },
        "statistics": {
            "type": "stat_block_section",
            "subtype": "statistics",
            "str": 32,
            "dex": 25,
            "con": 25,
            "int": 6,
            "wis": 24,
            "cha": 17,
            "feats": [
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Alertness",
                    "link": {
                        "type": "link",
                        "name": "Alertness",
                        "alt": "Alertness",
                        "href": "FeatDisplay.aspx?ItemName=Alertness"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Awesome Blow",
                    "link": {
                        "type": "link",
                        "name": "Awesome Blow",
                        "alt": "Awesome Blow",
                        "href": "FeatDisplay.aspx?ItemName=Awesome%20Blow"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Combat Reflexes",
                    "link": {
                        "type": "link",
                        "name": "Combat Reflexes",
                        "alt": "Combat Reflexes",
                        "href": "FeatDisplay.aspx?ItemName=Combat%20Reflexes"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Critical Focus",
                    "link": {
                        "type": "link",
                        "name": "Critical Focus",
                        "alt": "Critical Focus",
                        "href": "FeatDisplay.aspx?ItemName=Critical%20Focus"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Flyby Attack",
                    "link": {
                        "type": "link",
                        "name": "Flyby Attack",
                        "alt": "Flyby Attack",
                        "href": "FeatDisplay.aspx?ItemName=Flyby%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Greater Bull Rush",
                    "link": {
                        "type": "link",
                        "name": "Greater Bull Rush",
                        "alt": "Greater Bull Rush",
                        "href": "FeatDisplay.aspx?ItemName=Greater%20Bull%20Rush"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Greater Overrun",
                    "link": {
                        "type": "link",
                        "name": "Greater Overrun",
                        "alt": "Greater Overrun",
                        "href": "FeatDisplay.aspx?ItemName=Greater%20Overrun"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Bull Rush",
                    "link": {
                        "type": "link",
                        "name": "Improved Bull Rush",
                        "alt": "Improved Bull Rush",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Bull%20Rush"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "modifiers": [
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "bite"
                        },
                        {
                            "type": "stat_block_section",
                            "subtype": "modifier",
                            "name": "claw"
                        }
                    ],
                    "name": "Improved Critical",
                    "link": {
                        "type": "link",
                        "name": "Improved Critical (bite",
                        "alt": "Improved Critical (bite",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Critical"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Initiative",
                    "link": {
                        "type": "link",
                        "name": "Improved Initiative",
                        "alt": "Improved Initiative",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Initiative"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Improved Overrun",
                    "link": {
                        "type": "link",
                        "name": "Improved Overrun",
                        "alt": "Improved Overrun",
                        "href": "FeatDisplay.aspx?ItemName=Improved%20Overrun"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Intimidating Prowess",
                    "link": {
                        "type": "link",
                        "name": "Intimidating Prowess",
                        "alt": "Intimidating Prowess",
                        "href": "FeatDisplay.aspx?ItemName=Intimidating%20Prowess"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Power Attack",
                    "link": {
                        "type": "link",
                        "name": "Power Attack",
                        "alt": "Power Attack",
                        "href": "FeatDisplay.aspx?ItemName=Power%20Attack"
                    }
                },
                {
                    "type": "stat_block_section",
                    "subtype": "feat",
                    "name": "Stunning Critical",
                    "link": {
                        "type": "link",
                        "name": "Stunning Critical",
                        "alt": "Stunning Critical",
                        "href": "FeatDisplay.aspx?ItemName=Stunning%20Critical"
                    }
                }
            ],
            "skills": {
                "type": "stat_block_section",
                "subtype": "skills",
                "skills": [
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Fly",
                        "value": 33
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Intimidate",
                        "value": 46
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Perception",
                        "value": 43
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "skill",
                        "name": "Sense Motive",
                        "value": 43
                    }
                ]
            },
            "languages": {
                "type": "stat_block_section",
                "subtype": "languages",
                "languages": [
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Abyssal"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Celestial"
                    },
                    {
                        "type": "stat_block_section",
                        "subtype": "language",
                        "name": "Common"
                    }
                ]
            },
            "special_qualities": [
                {
                    "type": "stat_block_section",
                    "subtype": "special_quality",
                    "name": "heretical soul"
                }
            ]
        }
    },
    "sources": [
        {
            "type": "source",
            "name": "Book of the Damned",
            "link": {
                "type": "link",
                "name": "Book of the Damned pg. 244",
                "alt": "Book of the Damned pg. 244",
                "href": "http://paizo.com/products/btpy9tok"
            },
            "page": 244
        }
    ]
}